{
  "range": "Sheet1!A1:N20",
  "majorDimension": "ROWS",
  "values": [
    [
      "Company-ID",
      "LinkedIn-Job-Link",
      "Company-Name",
      "Job-Title",
      "Location",
      "Job-Description",
      "Apply-Link",
      "Region",
      "Job-Type",
      "Job-Tags",
      "Job-Category",
      "Hours",
      "Salary-Min",
      "Salary-Max"
    ],
    [
      "1810",
      "https://www.linkedin.com/jobs/view/strategic-account-executive-at-signifyd-3762391942",
      "Signifyd",
      "Strategic Account Executive",
      "USA",
      "\u003ch2\u003eJob Description: Strategic Accounts Account Executive\u003c/h2\u003e\n\n\u003cp\u003eSignifyd is looking for a Strategic Accounts Account Executive to create the strategy, cadence, and execution necessary to scale revenue across our largest, high-value US-based strategic prospects and customers. In this role, you’ll partner with critical stakeholders within our Revenue, Finance, Operations, Product, and Strategy organizations to establish a globally consistent approach that develops strong customer relationships.\u003c/p\u003e\n\n\u003cp\u003eThis is a senior position, expected to routinely interact with C-level decision makers both internally, and with prospective new clients. If you have experience in a role that combines sales, consulting, strategic thinking, and business analysis, and thrive in front of customers, please consider this role.\u003c/p\u003e\n\n\u003cp\u003eWe are seeking highly creative problem-solvers who can develop and clearly communicate novel business solutions to complex business needs. To do this you enjoy putting ideas into digestible materials to move the business of ecommerce forward. The ideal candidate will comprehend the nuances of the Signifyd platform and close the feedback loop to our product and marketing teams in order to continuously improve our own business while helping others grow theirs.\u003c/p\u003e\n\n\u003cp\u003eYou will collaborate with CFOs, CMOs, ecommerce leaders and fraud and risk experts. Clear communication and strong relationship building skills are required, with the ability to build on ideas in real time. You’ll manage the deal process and lead a multidisciplinary team of Signifyers and will be responsible for driving business activities that result in successful deployments of our platform.\u003c/p\u003e\n\n\u003ch3\u003eWhat You’ll Do:\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eDevelop, implement, and execute the vision, framework, and strategy to consistently acquire and grow new strategic customers across top strategic accounts, most of which manage business globally\u003c/li\u003e\n  \u003cli\u003eWork directly with potential clients at the highest levels, demonstrating a consultative approach to solving their problems\u003c/li\u003e\n  \u003cli\u003eThis is a hands-on, direct selling role where you will lead a set of cross-functional, matrixed team members to orchestrate winning partnerships to exceed revenue targets.\u003c/li\u003e\n  \u003cli\u003eCreate and articulate compelling value propositions around the Signifyd solution\u003c/li\u003e\n  \u003cli\u003eProvide strategic direction and critical thinking as we continue to expand globally\u003c/li\u003e\n  \u003cli\u003ePartner closely with Business Development, Solutions Engineering, Product, Finance, Customer Success, Data Science, Legal and other groups as needed to drive internal alignment\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eQualifications:\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eWe are looking for 8+ years of B2B experience managing end-to-end sales cycles, preferably in the e-commerce, risk, or fraud space\u003c/li\u003e\n  \u003cli\u003eExperience creating, building, scaling, and leading a strategic sales process within a complex and diverse SaaS company\u003c/li\u003e\n  \u003cli\u003eInfluential thinker, communicator, and SaaS thought leader who gains buy in from others in sensitive situations across all channels, mediums, and cultures\u003c/li\u003e\n  \u003cli\u003eDemonstrated indirect leadership experience, enabling a cross functional group to propel a growing initiative forward\u003c/li\u003e\n  \u003cli\u003ePrior experience in a role that requires rigorous business analytics and/or strategic thought (consulting, finance, business analysis, etc.) or experience in a technical role (Solutions/Sales Engineer, Product Manager, etc.)\u003c/li\u003e\n  \u003cli\u003eDemonstrated success owning significant outcomes for an organization\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eBenefits in our US offices:\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003e4-day workweek\u003c/li\u003e\n  \u003cli\u003eDiscretionary Time Off Policy (Unlimited!)\u003c/li\u003e\n  \u003cli\u003e401K Match\u003c/li\u003e\n  \u003cli\u003eStock Options\u003c/li\u003e\n  \u003cli\u003eAnnual Performance Bonus or Commissions\u003c/li\u003e\n  \u003cli\u003ePaid Parental Leave (12 weeks)\u003c/li\u003e\n  \u003cli\u003eOn-Demand Therapy for all employees & their dependents\u003c/li\u003e\n  \u003cli\u003eDedicated learning budget through Learnerbly\u003c/li\u003e\n  \u003cli\u003eHealth Insurance\u003c/li\u003e\n  \u003cli\u003eDental Insurance\u003c/li\u003e\n  \u003cli\u003eVision Insurance\u003c/li\u003e\n  \u003cli\u003eFlexible Spending Account (FSA)\u003c/li\u003e\n  \u003cli\u003eShort Term and Long Term Disability Insurance\u003c/li\u003e\n  \u003cli\u003eLife Insurance\u003c/li\u003e\n  \u003cli\u003eCompany Social Events\u003c/li\u003e\n  \u003cli\u003eSignifyd Swag\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eWe want to provide an inclusive interview experience for all, including people with disabilities. We are happy to provide reasonable accommodations to candidates in need of individualized support during the hiring process.\u003c/p\u003e\n\n\u003cp\u003eSignifyd provides a base salary, bonus, equity and benefits to all its employees. Our posted job may span more than one career level, and offered level and salary will be determined by the applicant’s specific experience, knowledge, skills, and abilities, as well as internal equity and alignment with market data.\u003c/p\u003e\n\n\u003ch4\u003eUSA Base Salary Pay Range\u003c/h4\u003e\n\n\u003cp\u003e$160,000—$185,000 USD\u003c/p\u003e\n\n\u003cp\u003eSignifyd's Applicant Privacy Notice\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3762391942/",
      "North America",
      "Remote,100% Salary, Four Days",
      "eCommerce, SaaS, RiskManagement, SalesStrategy, BusinessAnalytics",
      "Sales & Account Management, Business Development",
      "32",
      "160000",
      "185000"
    ],
    [
      "1807",
      "https://uk.linkedin.com/jobs/view/account-executive-f-m-d-at-awin-global-3752826420",
      "Awin Global",
      "Account Executive",
      "London Area, United Kingdom",
      "\u003ch2\u003eJob Purpose\u003c/h2\u003e\n\n\u003cp\u003eThis is a fantastic opportunity for a confident and motivated individual to play an integral role in the fast paced and rewarding environment of account management. If you are enthusiastic about affiliate marketing, this is a great chance to further develop your program management skills and gain valuable experience while working with some of the largest clients across Awin.\u003c/p\u003e\n\n\u003ch2\u003eKey Tasks\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003eAssume ownership and serve as the primary point of contact for assigned clients, providing training, guidance, and ongoing support in line with each client’s agreed service level.\u003c/li\u003e\n  \u003cli\u003eImplement program management strategies designed to produce a successful affiliate program, meeting a client’s objectives and goals.\u003c/li\u003e\n  \u003cli\u003eWork independently to produce all necessary account management documentation and deliver regular reports on assigned programs.\u003c/li\u003e\n  \u003cli\u003eProactively recruit new affiliates across the portfolio and project manage affiliate migrations in collaboration with clients and publisher team while building a working relationship with top 50 affiliates on network.\u003c/li\u003e\n  \u003cli\u003eFamiliarise yourself with industry trends and Awin products to inform program management, while keeping clients informed of relevant information.\u003c/li\u003e\n  \u003cli\u003eRegularly leverage & utilise the Awin platform and third-party tools (i.e. Tableau, PowerBI, SimilarWeb, etc.) in support of account management deliverables for assigned clients and in support of wider network activities.\u003c/li\u003e\n  \u003cli\u003eMonitor affiliate program performance to ensure network compliance and program health.\u003c/li\u003e\n  \u003cli\u003eTake a proactive approach in solving issues with assigned clients, escalating issues to the appropriate team level when necessary.\u003c/li\u003e\n  \u003cli\u003eCommunicate effectively and professionally with clients, publishers, vendors and internal teams via email, phone and face-to-face.\u003c/li\u003e\n  \u003cli\u003eProvide support to all team members when necessary and be a reference point of knowledge and expertise for more junior members of the team.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eSkills & Expertise\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003eKnowledge of the affiliate marketing industry, including commission models, tracking solutions and various affiliate types.\u003c/li\u003e\n  \u003cli\u003eProficiency with MS Office suite, specifically Excel and Powerpoint and willingness to learn new technology systems.\u003c/li\u003e\n  \u003cli\u003eExcellent written and verbal communication skills.\u003c/li\u003e\n  \u003cli\u003eStrong time management skills with the ability to be flexible and manage multiple projects simultaneously in a fast-paced environment.\u003c/li\u003e\n  \u003cli\u003eFast learner with strong team orientation and a positive, can-do attitude.\u003c/li\u003e\n  \u003cli\u003eAccepts and seeks out ownership and accountability of work.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eOur Offer\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003eFlexi-Week and Work-Life Balance: We prioritise your mental health and wellbeing, offering you a flexible four-day Flexi-Week at full pay and with no reduction to your annual holiday allowance. We also offer a variety of different paid special leaves.\u003c/li\u003e\n  \u003cli\u003eFlexi-Office: Do you prefer to work from our cool office, from home, or in a completely different environment? With us, the choice is yours. We offer the flexibility to work wherever you want within our Awin locations.\u003c/li\u003e\n  \u003cli\u003eWelfare: We provide you with a life assurance, travel insurance and a private health insurance that covers several types of health, vision, and dental treatments. Furthermore, you can take advantage of our Cycle to Work Scheme or Season Ticket Loan.\u003c/li\u003e\n  \u003cli\u003eHealth & Well Being: With our support and access to various initiatives and sports offers, you can devote yourself to your mental and physical well-being.\u003c/li\u003e\n  \u003cli\u003eDevelopment: We’ve built our extensive training suite Awin Academy to cover a wide range of skills that nurture you professionally and personally, with trainings conveniently packaged together to support your overall development. You can also improve your English skills by participating in our local language course.\u003c/li\u003e\n  \u003cli\u003eRemote Working: You will receive a monthly allowance to cover part of your running costs. In addition, we will support you in setting up your remote workspace appropriately.\u003c/li\u003e\n  \u003cli\u003eAppreciation: Thank and reward colleagues by sending them a voucher through our peer-to-peer program and show your appreciation for colleagues who have gone the extra mile to support you.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eEstablished in 2000, Awin is proud of our dynamic, social and inclusive culture.\u003c/p\u003e\n\n\u003cp\u003eLike all businesses, we’ve had to adapt and nurture our culture in a virtual environment. Our virtual ‘Life @ Awin’ hub brings our colleagues from across the globe together for various social activities.\u003c/p\u003e\n\n\u003cp\u003eDiversity & Inclusion are paramount to us, and we proudly pursue and hire diverse team members. We champion uniqueness and authenticity; this is who we are at our core. Our network of affiliate partnerships are diverse and transparent, as are the employees powering our vision to build the world’s leading open partner ecosystem. We welcome all backgrounds, identities, and experiences. If you need support at any point in the application or interview process, please let us know.\u003c/p\u003e\n\n\u003cp\u003eApply now to begin the next stage of your career at a progressive company that supports both your professional and personal development.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3752826420/",
      "Europe",
      "Remote, 100% Salary, Four Days",
      "Affiliate Marketing, Excel, PowerPoint, Account Management, Communication Skills",
      "Sales & Account Management, Marketing",
      "32",
      " \n",
      " \n"
    ],
    [
      "1759",
      "https://www.linkedin.com/jobs/view/senior-content-marketer-usa-only-100%25-remote-at-close-3763374907",
      "Close",
      "Senior Content Marketer",
      "United States",
      "\u003ch2\u003eAbout Us\u003c/h2\u003e\n\n\u003cp\u003eClose is a bootstrapped, profitable, 100% remote, 90 person team of thoughtful individuals who value autonomy and impact. We’re eager to make a product our customers fall in love with over and over again.\u003c/p\u003e\n\n\u003cp\u003eWe ❤️ startups & SMBs. Since 2013, we’ve been building a CRM that focuses on better communication, without the hassle of manual data entry or complex UI. Our goal: double the productivity of every sales rep.\u003c/p\u003e\n\n\u003cp\u003eWe’re looking to add an experienced senior content marketer to the team to help the company create, update and optimize our library of 1,500+ high-quality sales-related resources that drive our top of funnel marketing efforts.\u003c/p\u003e\n\n\u003ch2\u003eAbout You\u003c/h2\u003e\n\n\u003cp\u003eWe’re seeking a talented and driven content marketer to join the Close marketing team. As a Senior Content Marketer, you’ll play a crucial role in creating world-class sales, marketing, and small business resources to support our marketing efforts.\u003c/p\u003e\n\n\u003cp\u003eYou’ll report to the Head of Content, Ryan Robinson.\u003c/p\u003e\n\n\u003cp\u003eOur ideal candidate is a skilled writer, editor and marketer with a strong attention to detail that knows how to balance education & entertainment. As a senior content marketer on the Close marketing team, you’ll be responsible for crafting engaging content across various formats, including blog posts, white papers, and guest posts. This role will also involve editing and proofreading content from third-party writers, collaborating with contributors, using your relationships to pitch & write guest posts, and formatting content in our CMS.\u003c/p\u003e\n\n\u003cp\u003eIf you thrive in a collaborative, supportive environment, have a keen eye for detail, and possess a strong understanding of content marketing & SEO best practices, we’d love to hear from you!\u003c/p\u003e\n\n\u003ch2\u003eRequirements\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003e5+ years of experience with in-house B2B SaaS content marketing, writing, editing, SEO, and web analytics\u003c/li\u003e\n  \u003cli\u003eStrong history of writing, editing, and proofreading in a B2B environment\u003c/li\u003e\n  \u003cli\u003eYou have fun writing actionable (and entertaining) content on sales-related topics in your sleep\u003c/li\u003e\n  \u003cli\u003eYou approach copywriting tasks with eagerness, excitement, and are very comfortable experimenting with voice, style & tone\u003c/li\u003e\n  \u003cli\u003eYou have extensive experience using WordPress, Ghost, Webflow, and/or other similar content management systems\u003c/li\u003e\n  \u003cli\u003eBackground working in a previous role as a salesperson is a plus\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eResponsibilities\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003eCreate high-quality sales-related resources, including blog posts, white papers, guest posts, landing page copy, and other content formats we’ll explore with a high level of attention to detail (40%)\u003c/li\u003e\n  \u003cli\u003eEdit and proofread written content from third-party writers, including providing feedback and working with other contributors to produce publish-ready content (25%)\u003c/li\u003e\n  \u003cli\u003eFormat content in our CMS, including sourcing stock images, identifying and executing internal link opportunities, completing meta details, working with designers to produce custom graphics, and internal linking (20%)\u003c/li\u003e\n  \u003cli\u003eExecute and optimize our SEO strategy to drive new, targeted visits (10%)\u003c/li\u003e\n  \u003cli\u003eDistribute content on various platforms including Quora, Help a B2B Writer and otherwise (5%)\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eWhy Close?\u003c/h2\u003e\n\n\u003cp\u003eWatch our most recent culture video featuring our annual team retreat in Italy\u003c/p\u003e\n\u003cp\u003e100% remote company\u003c/p\u003e\n\u003cp\u003eChoose between working 5 days/wk (standard full-time) or 4 days/wk @ 80% pay\u003c/p\u003e\n\u003cp\u003e5 weeks PTO + Winter Holiday Break with 2 additional PTO days for every year with the company\u003c/p\u003e\n\u003cp\u003e1 month paid sabbatical every 5 years\u003c/p\u003e\n\u003cp\u003ePaid parental leave\u003c/p\u003e\n\u003cp\u003eMedical, Dental, Vision with HSA option (US residents)\u003c/p\u003e\n\u003cp\u003e401k matching at 6% (US residents)\u003c/p\u003e\n\u003cp\u003eDependent care FSA (US residents)\u003c/p\u003e\n\u003cp\u003eContributor to Stripe's climate initiative\u003c/p\u003e\n\u003cp\u003eOur story and team\u003c/p\u003e\n\n\u003ch2\u003eOur Values\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003eBuild a house you want to live in -- Examine long-term thinking and action\u003c/li\u003e\n  \u003cli\u003eNo BS -- Practice transparency and honesty, especially when it’s hard\u003c/li\u003e\n  \u003cli\u003eInvest in each other -- Build successful relationships with your coworkers and customers\u003c/li\u003e\n  \u003cli\u003eDiscipline equals freedom -- Keep your word to yourself and others\u003c/li\u003e\n  \u003cli\u003eStrive for greatness -- Constantly challenge yourself and others\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eHow We Work Together\u003c/h2\u003e\n\n\u003cp\u003eProductivity, Quality & Impact: We don’t track hours. We trust you’re an adult and know best how to prioritize, meet your goals and contribute at a high level.\u003c/p\u003e\n\u003cp\u003eAsynchronous communication & collaboration: We have team members all over the world. We don’t expect anyone to work untraditional hours, that means our default is async. Most teams have 2-5 hours of internal meetings weekly.\u003c/p\u003e\n\u003cp\u003eAppreciation for Deep Work: *During your normal work day, not after a day of meetings*.\u003c/p\u003e\n\u003cp\u003eAutonomy & Freedom: Create a work environment that is sustainable for you. We place a high amount of trust and responsibility with our team members from the start.\u003c/p\u003e\n\n\u003cp\u003eWorking from 22+ countries, we’re a collection of talented humans rich in diverse backgrounds, lifestyles, and cultures. Close has been 100% remote since 2016, creating an intentional workplace around asynchronous communication and collaboration. Every year we meet up somewhere around the world to spend time with one another. These gatherings are an opportunity to strengthen the relationships within our global community.\u003c/p\u003e\n\n\u003cp\u003eWe practice a mature approach to the workplace -- manage your time effectively, communicate thoughtfully with your teammates and customers, and produce high quality work. We have impressive tenure amongst the team; we stay at Close because we love working with our colleagues, we appreciate the autonomy and we thrive in an environment that challenges us to do our best work.\u003c/p\u003e\n\n\u003cp\u003eUnanimously, our favorite value is “Build a house you want to live in.” We make decisions that are rooted in helping our customers become more successful. We care equally about the health of our business and the wellbeing of our people.\u003c/p\u003e\n\n\u003cp\u003eOur application process was designed to promote equitable and unbiased hiring practices. We ask a small series of questions that are similar to what would be asked in the first interview. This helps us learn more about you right from the start so please be sure to answer each question thoughtfully. Each application will receive two screens by two different reviewers. Regardless of fit, you will hear back from us letting you know if we'll be moving forward.\u003c/p\u003e\n\n\u003cp\u003eWhile we are excited by all the opportunities that generative AI has unlocked, we request that you refrain from relying on AI tools when completing an application. We ask these questions because we want to get to know you, your experience, and your communication style. All responses are read closely by multiple humans and any obviously AI generated applications will be disregarded.\u003c/p\u003e\n\n\u003cp\u003eInterested in Close but don't think this role is the best fit for you? View our other positions.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3763374907/",
      "North America",
      "Remote, 100% Salary, Four Days",
      "SEO, Content Marketing, CMS, B2B SaaS, Copywriting",
      "Marketing, Writing",
      "32"
    ],
    [
      "1759",
      "https://www.linkedin.com/jobs/view/senior-or-staff-software-engineer-backend-python-usa-only-100%25-remote-at-close-3602557784",
      "Close",
      "Senior or Staff Software Engineer - Backend/Python",
      "United States",
      "\u003ch2\u003eWe are looking for US-based Senior and Staff level engineers to join our team.\u003c/h2\u003e\n\u003cp\u003eBase salary range is $140,000 to $200,000. These are fully remote positions. Read on to learn more!\u003c/p\u003e\n\n\u003ch2\u003eAbout Us\u003c/h2\u003e\n\u003cp\u003eClose is a bootstrapped, profitable, 100% remote, 90 person team of thoughtful individuals who value autonomy and impact. We’re eager to make a product our customers fall in love with over and over again.\u003c/p\u003e\n\u003cp\u003eWe ❤️ startups & SMBs. Since 2013, we’ve been building a CRM that focuses on better communication, without the hassle of manual data entry or complex UI. Our goal: double the productivity of every sales rep.\u003c/p\u003e\n\u003cp\u003eOur backend tech stack currently consists primarily of Python Flask web apps with our TaskTiger scheduler handling many of the backend asynchronous task processing chores. Our data stores include MongoDB, PostgreSQL, Elasticsearch, and Redis. The underlying infrastructure runs on AWS using a combination of managed services like EKS, MSK, RDS and ElasticCache and non-managed services running on EC2 instances. All of our compute runs through CI/CD pipelines that build Docker images, run automated tests and deploy to our Kubernetes clusters. Our backend primarily serves a well-documented public API that our front-end JavaScript app consumes. Our infrastructure is heavily automated using Terraform, Ansible and other AWS tools.\u003c/p\u003e\n\u003cp\u003eOur product development process is inspired by Shape Up. We❤️ open sourcing our code and ideas on our GitHub and onThe Making of Close, our behind-the-scenes Product & Engineering blog. Check out our projects like SocketShark, TaskTiger, LimitLion and ciso8601.\u003c/p\u003e\n\n\u003ch2\u003eAbout You\u003c/h2\u003e\n\u003cp\u003eWe’re looking for high achieving full-time Software Engineers to join our engineering team. Someone who has a good understanding in web technologies and wants to help design, implement, launch, and scale major systems and user-facing features.\u003c/p\u003e\n\u003cp\u003eYou're comfortable working in a fast-paced environment with a small and talented team where you're supported in your efforts to grow professionally. You're able to manage your time well, communicate effectively and collaborate in a fully distributed team.\u003c/p\u003e\n\n\u003ch3\u003eRequirements...\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eSenior/Staff level candidates should have 5+ years experience building modern back-end systems.\u003c/li\u003e\n  \u003cli\u003eMid-level candidates should have 3 years of similar experience and be eager to level up with the right opportunity.\u003c/li\u003e\n  \u003cli\u003ePython experience is preferred but experience in other languages is acceptable if you have a desire to work with Python.\u003c/li\u003e\n  \u003cli\u003eYou have hands-on production experience working with MongoDB, PostgreSQL, Elasticsearch, or similar data stores.\u003c/li\u003e\n  \u003cli\u003eYou have experience designing, scaling, debugging, and optimizing systems to make them fast and reliable.\u003c/li\u003e\n  \u003cli\u003eYou have participated in code reviews and provided overall code quality suggestions to help maintain the structure and quality of the codebase.\u003c/li\u003e\n  \u003cli\u003eYou care about the craftsmanship of the code and systems you produce.\u003c/li\u003e\n  \u003cli\u003eLocated in the USA. Not in the US? Check out this job post for our non-US BE position.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eBonus point if you have…\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003eContributed open source code related to our tech stack\u003c/li\u003e\n  \u003cli\u003eLed small project teams building and launching features\u003c/li\u003e\n  \u003cli\u003eBuilt B2B SaaS products\u003c/li\u003e\n  \u003cli\u003eWorked with complex architectures that support multiple APIs (e.g. REST, GQL, WebSockets) as well as async task and event processing frameworks\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eCome help us with projects like...\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003eConceiving, designing, building, and launching new user-facing features\u003c/li\u003e\n  \u003cli\u003eImproving the performance and scalability of our GraphQL and REST API\u003c/li\u003e\n  \u003cli\u003eImproving how we sync millions of sales emails and calendar events each month\u003c/li\u003e\n  \u003cli\u003eWorking with Twilio's API, WebSockets, and WebRTC to improve our calling features\u003c/li\u003e\n  \u003cli\u003eBuilding user-facing analytics features that provide actionable insights based on sales activity data\u003c/li\u003e\n  \u003cli\u003eImproving our Elastic search-backed powerful search features\u003c/li\u003e\n  \u003cli\u003eImproving our internal messaging infrastructure using streaming technologies like Kafka and Redis\u003c/li\u003e\n  \u003cli\u003eBuilding new and enhancing existing integrations with other SaaS platforms like Google’s G Suite, Zapier, and Web Conferencing providers\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eWhy Close?\u003c/h2\u003e\n\u003cp\u003eWatch our most recent culture video featuring our annual team retreat in Italy\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003e100% remote company\u003c/li\u003e\n  \u003cli\u003eChoose between working 5 days/wk (standard full-time) or 4 days/wk @ 80% pay\u003c/li\u003e\n  \u003cli\u003e5 weeks PTO + Winter Holiday Break with 2 additional PTO days for every year with the company\u003c/li\u003e\n  \u003cli\u003e1 month paid sabbatical every 5 years\u003c/li\u003e\n  \u003cli\u003ePaid parental leave\u003c/li\u003e\n  \u003cli\u003eMedical, Dental, Vision with HSA option (US residents)\u003c/li\u003e\n  \u003cli\u003e401k matching at 6% (US residents)\u003c/li\u003e\n  \u003cli\u003eDependent care FSA (US residents)\u003c/li\u003e\n  \u003cli\u003eContributor to Stripe's climate initiative\u003c/li\u003e\n  \u003cli\u003eOur story and team\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eOur Values\u003c/h2\u003e\n\u003cul\u003e\n  \u003cli\u003eBuild a house you want to live in -- Examine long-term thinking and action\u003c/li\u003e\n  \u003cli\u003eNo BS -- Practice transparency and honesty, especially when it’s hard\u003c/li\u003e\n  \u003cli\u003eInvest in each other -- Build successful relationships with your coworkers and customers\u003c/li\u003e\n  \u003cli\u003eDiscipline equals freedom -- Keep your word to yourself and others\u003c/li\u003e\n  \u003cli\u003eStrive for greatness -- Constantly challenge yourself and others\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eHow We Work Together\u003c/h2\u003e\n\u003cp\u003eProductivity, Quality & Impact: We don’t track hours. We trust you’re an adult and know best how to prioritize, meet your goals and contribute at a high level.\u003c/p\u003e\n\u003cp\u003eAsynchronous communication & collaboration: We have team members all over the world. We don’t expect anyone to work untraditional hours, that means our default is async. Most teams have 2-5 hours of internal meetings weekly.\u003c/p\u003e\n\u003cp\u003eAppreciation for Deep Work: *During your normal work day, not after a day of meetings*.\u003c/p\u003e\n\u003cp\u003eAutonomy & Freedom: Create a work environment that is sustainable for you. We place a high amount of trust and responsibility with our team members from the start.\u003c/p\u003e\n\n\u003cp\u003eWorking from 22+ countries, we’re a collection of talented humans rich in diverse backgrounds, lifestyles, and cultures. Close has been 100% remote since 2016, creating an intentional workplace around asynchronous communication and collaboration. Every year we meet up somewhere around the world to spend time with one another. These gatherings are an opportunity to strengthen the relationships within our global community.\u003c/p\u003e\n\n\u003cp\u003eWe practice a mature approach to the workplace -- manage your time effectively, communicate thoughtfully with your teammates and customers, and produce high quality work. We have impressive tenure amongst the team; we stay at Close because we love working with our colleagues, we appreciate the autonomy and we thrive in an environment that challenges us to do our best work.\u003c/p\u003e\n\n\u003cp\u003eUnanimously, our favorite value is “Build a house you want to live in.” We make decisions that are rooted in helping our customers become more successful. We care equally about the health of our business and the wellbeing of our people.\u003c/p\u003e\n\n\u003cp\u003eOur application process was designed to promote equitable and unbiased hiring practices. We ask a small series of questions that are similar to what would be asked in the first interview. This helps us learn more about you right from the start so please be sure to answer each question thoughtfully. Each application will receive two screens by two different reviewers. Regardless of fit, you will hear back from us letting you know if we'll be moving forward.\u003c/p\u003e\n\n\u003cp\u003eWhile we are excited by all the opportunities that generative AI has unlocked, we request that you refrain from relying on AI tools when completing an application. We ask these questions because we want to get to know you, your experience, and your communication style. All responses are read closely by multiple humans and any obviously AI generated applications will be disregarded.\u003c/p\u003e\n\n\u003cp\u003eInterested in Close but don't think this role is the best fit for you? View our other positions.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3602557784/",
      "North America",
      "Remote, 100% Salary, Four Days",
      "Python, MongoDB, PostgreSQL, Elasticsearch, AWS",
      "Engineering, Data & Analytics",
      "32",
      "140000",
      "200000"
    ],
    [
      "1807",
      "https://de.linkedin.com/jobs/view/accountant-general-ledger-bilanzbuchhalter-f-m-d-at-awin-global-3747055388",
      "Awin Global",
      "Accountant General Ledger / Bilanzbuchhalter",
      "Berlin, Germany",
      "\u003ch2\u003ePurpose of Position\u003c/h2\u003e\n\u003cp\u003eIn this role you will be responsible for the accounting and reporting for AWIN AG. You are actively contributing to monthly and yearly closings for AWIN AG according to IFRS and local GAAP (HGB). You excel in the external communication between Awin and its shareholders, auditors and tax authorities. Together with a global team of experts you are working in the Accounting, Reporting and Consolidation team, striving for continues improvement and global process harmonization.\u003c/p\u003e\n\n\u003ch2\u003eKey Tasks\u003c/h2\u003e\n\u003cul\u003e\n  \u003cli\u003eAccounting and reporting for Awin AG according to German GAAP and IFRS\u003c/li\u003e\n  \u003cli\u003eMonthly balance sheet reconciliations and analysis\u003c/li\u003e\n  \u003cli\u003eMonthly IFRS reporting to shareholders\u003c/li\u003e\n  \u003cli\u003eMonthly VAT related local tax reporting\u003c/li\u003e\n  \u003cli\u003eYearly external audit according to German GAAP and IFRS\u003c/li\u003e\n  \u003cli\u003eAnnual local GAAP reporting\u003c/li\u003e\n  \u003cli\u003eIFRS competence centre\u003c/li\u003e\n  \u003cli\u003eInterface function to the global tax team and the FP&A team\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eSkills And Expertise\u003c/h2\u003e\n\u003cul\u003e\n  \u003cli\u003eAt least 3 years of professional experience in a comparable position\u003c/li\u003e\n  \u003cli\u003eExtensive practical and theoretical knowledge of accounting according to IFRS and German GAAP (HGB) as well as local taxation\u003c/li\u003e\n  \u003cli\u003eBilanzbuchhalter, Certified Accountant, Steuerfachangestellter\u003c/li\u003e\n  \u003cli\u003eDegree in business administration with a focus on accounting\u003c/li\u003e\n  \u003cli\u003eAdvanced knowledge and proficiency of Microsoft D365, Office Suite, especially Excel and\u003c/li\u003e\n  \u003cli\u003eKnowledge in Lucanet, Power BI is beneficial\u003c/li\u003e\n  \u003cli\u003eVery good communication (written and verbal in English & German)\u003c/li\u003e\n  \u003cli\u003eTeam player with global mindset and the ability to develop international relationships\u003c/li\u003e\n  \u003cli\u003eConscientiousness and flexibility are not foreign to you, you work goal-oriented, and you feel comfortable in an agile work environment\u003c/li\u003e\n  \u003cli\u003eStructured, accurate and self-organised way of working\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eOur Offer\u003c/h2\u003e\n\u003cul\u003e\n  \u003cli\u003eFlexi-Week and Work-Life Balance: We prioritise your mental health and wellbeing, offering you a flexible four-day Flexi-Week at full pay and with no reduction to your annual holiday allowance. We also offer a variety of different paid special leaves.\u003c/li\u003e\n  \u003cli\u003eFlexi-Office: Do you prefer to work from our cool office, from home, or in a completely different environment? With us, the choice is yours. We offer the flexibility to work wherever you want within our Awin locations.\u003c/li\u003e\n  \u003cli\u003eWelfare: We provide you with a life assurance, travel insurance and a private health insurance that covers several types of health, vision, and dental treatments. Furthermore, you can take advantage of our Cycle to Work Scheme or Season Ticket Loan.\u003c/li\u003e\n  \u003cli\u003eHealth & Well Being: With our support and access to various initiatives and sports offers, you can devote yourself to your mental and physical well-being.\u003c/li\u003e\n  \u003cli\u003eDevelopment: We’ve built our extensive training suite Awin Academy to cover a wide range of skills that nurture you professionally and personally, with trainings conveniently packaged together to support your overall development. You can also improve your English skills by participating in our local language course.\u003c/li\u003e\n  \u003cli\u003eRemote Working: You will receive a monthly allowance to cover part of your running costs. In addition, we will support you in setting up your remote workspace appropriately.\u003c/li\u003e\n  \u003cli\u003eAppreciation: Thank and reward colleagues by sending them a voucher through our peer-to-peer program and show your appreciation for colleagues who have gone the extra mile to support you.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eEstablished in 2000, Awin is proud of our dynamic, social and inclusive culture. Like all businesses, we’ve had to adapt and nurture our culture in a virtual environment. Our virtual ‘Life @ Awin’ hub brings our colleagues from across the globe together for various social activities.\u003c/p\u003e\n\n\u003cp\u003eDiversity & Inclusion are paramount to us, and we proudly pursue and hire diverse team members. We champion uniqueness and authenticity; this is who we are at our core. Our network of affiliate partnerships are diverse and transparent, as are the employees powering our vision to build the world’s leading open partner ecosystem. We welcome all backgrounds, identities, and experiences.\u003c/p\u003e\n\n\u003cp\u003eIf you need support at any point in the application or interview process, please let us know. Apply now to begin the next stage of your career at a progressive company that supports both your professional and personal development.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3747055388/",
      "Europe",
      "Hybrid, 100% Salary, Four Days",
      "IFRS, HGB, MicrosoftD365, Excel, PowerBI",
      "Accounting & Finance, Data & Analytics",
      "32"
    ],
    [
      "1807",
      "https://it.linkedin.com/jobs/view/retention-and-growth-manager-f-m-d-at-awin-global-3748816107",
      "Awin Global",
      "Retention and Growth Manager",
      "Milan, Lombardy, Italy",
      "\u003ch2\u003ePurpose of Position\u003c/h2\u003e\n\n\u003cp\u003eOur newly defined Retention & Growth Team is responsible for two keys areas;\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eRetention of customers to ensure sustainable continuity\u003c/li\u003e\n  \u003cli\u003eGrowth of our portfolio in line with GP and ARR targets\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eWith retention in mind, this team will lead the migration of customers onto MarTech commercials as part of our business transformation.\u003c/p\u003e\n\n\u003cp\u003eAlongside this the team will also be the home for revenue optimisation through the methods of;\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eUpselling customers to a higher Platform Offer or Service Package\u003c/li\u003e\n  \u003cli\u003eCross-selling additional services or add-ons\u003c/li\u003e\n  \u003cli\u003eExpanding into new markets or opening-up additional programmes\u003c/li\u003e\n  \u003cli\u003eAlternatively downgrading customers to a more suitable Platform Offer or Service Package that meets their needs\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eThe R&G Manager role is responsible for overseeing the migration and therefore negotiation of customers to new MarTech contracts at local market level, and achieving the targets set by their R&G Team Leader.\u003c/p\u003e\n\n\u003cp\u003eThe role will report directly into their local R&G Team Leader who will support with direct line management and training, with the wider team reporting back to the Global Migration Manager focussed on R&G team alignment on things like processes and progress reporting.\u003c/p\u003e\n\n\u003cp\u003eThe role at its core will require ownership of customer relationships on the topic of renegotiations, upsell, and downgrade opportunities – ending in signed contract.\u003c/p\u003e\n\n\u003cp\u003eFor the purpose of Retention & Growth this role will be expected to liaise with many other departments within the business including Client Services, GtM, GBOps, Legal, Info-sec, Finance and our technical teams to name the most common.\u003c/p\u003e\n\n\u003cp\u003eThe R&G team are committed to working as a virtual team – exchanging knowledge, aligning processes, and delivering data and insights from their teams. This team is also likely to support other market R&G teams where needed and therefore not isolated to one single market support.\u003c/p\u003e\n\n\u003ch2\u003eKey Tasks\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003eDrafting, reviewing and executing agreements (including but not limited to Contracts, Renegotiations/Renewals, Upgrades, Downgrades, Non-Disclosure Agreements, Partner or Third-Party Agreements, etc.)\u003c/li\u003e\n  \u003cli\u003eNegotiating directly where appropriate with client contacts with a view to reaching a mutually agreeable solution that remains within our MarTech strategy and connected to our GP and ARR targets\u003c/li\u003e\n  \u003cli\u003eWork to personal targets set by your local R&G Team Leader, reviewing and reporting on progress across all accounts\u003c/li\u003e\n  \u003cli\u003eRunning risk & opportunity analysis sessions with the local market Client Services teams to better understand the target customer set and recommended approach\u003c/li\u003e\n  \u003cli\u003eCollaborate and communicate regularly with the other in-market R&G Managers, attending team huddles at both local market and virtual R&G team level\u003c/li\u003e\n  \u003cli\u003eLeading/involvement in existing business RFP’s, coordinating required teams and overseeing the delivery of this to the customer\u003c/li\u003e\n  \u003cli\u003eCompleting and coordinating any contract queries within your scope including but not limited to; Security Audits, DPA’s and Voucher connect agreements\u003c/li\u003e\n  \u003cli\u003eLiaising with the group legal department on any non-standard advertiser contract amends as required to minimise Awin exposure and risk\u003c/li\u003e\n  \u003cli\u003eWorking closely with the Finance team to ensure adherence to broader finance and risk requirements, such as revenue recognitions, pricing and discounting policies, etc., with a clear understanding and ability to evaluate the economic impact of terms and term options\u003c/li\u003e\n  \u003cli\u003eDeveloping and implementing procedures in line with our business strategy for contract management and administration and, where appropriate, contribute and consult on other company policies and procedures\u003c/li\u003e\n  \u003cli\u003eProviding guidance on contractual matters internally, including contracting practices and processes\u003c/li\u003e\n  \u003cli\u003eCommunicating clearly with all parties the relevant information, including status updates and signed contracts\u003c/li\u003e\n  \u003cli\u003eAdhere to correct contract administration, records, and documentation including receipt and control of all contract correspondence, changes, status reports, etc.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eSkills & Expertise\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003eAffiliate marketing experience ideally in a customer facing-facing role\u003c/li\u003e\n  \u003cli\u003eAwareness of your local market competitor landscape and Awin Offering (MarTech Vision, Offers and Service Packages)\u003c/li\u003e\n  \u003cli\u003eStrong verbal communication skills\u003c/li\u003e\n  \u003cli\u003eYou have a thirst for knowledge and can work under pressure\u003c/li\u003e\n  \u003cli\u003eYou are driven with a commercial mindset\u003c/li\u003e\n  \u003cli\u003eProven problem-solving skills\u003c/li\u003e\n  \u003cli\u003eProven negotiating and persuading skills\u003c/li\u003e\n  \u003cli\u003eLocal market language required\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eOur Offer\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003eFlexi-Week and Work-Life Balance: We prioritise your mental health and wellbeing, offering you a flexible four-day Flexi-Week at full pay and with no reduction to your annual holiday allowance. We also offer a variety of different paid special leaves.\u003c/li\u003e\n  \u003cli\u003eFlexi-Office: Do you prefer to work from our cool office, from home, or in a completely different environment? With us, the choice is yours. We offer the flexibility to work wherever you want within our Awin locations.\u003c/li\u003e\n  \u003cli\u003eWelfare: We provide you with a life assurance, travel insurance and a private health insurance that covers several types of health, vision, and dental treatments. Furthermore, you can take advantage of our Cycle to Work Scheme or Season Ticket Loan.\u003c/li\u003e\n  \u003cli\u003eHealth & Well Being: With our support and access to various initiatives and sports offers, you can devote yourself to your mental and physical well-being.\u003c/li\u003e\n  \u003cli\u003eDevelopment: We’ve built our extensive training suite Awin Academy to cover a wide range of skills that nurture you professionally and personally, with trainings conveniently packaged together to support your overall development. You can also improve your English skills by participating in our local language course.\u003c/li\u003e\n  \u003cli\u003eRemote Working: You will receive a monthly allowance to cover part of your running costs. In addition, we will support you in setting up your remote workspace appropriately.\u003c/li\u003e\n  \u003cli\u003eAppreciation: Thank and reward colleagues by sending them a voucher through our peer-to-peer program and show your appreciation for colleagues who have gone the extra mile to support you.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eEstablished in 2000, Awin is proud of our dynamic, social and inclusive culture.\u003c/p\u003e\n\n\u003cp\u003eLike all businesses, we’ve had to adapt and nurture our culture in a virtual environment. Our virtual ‘Life @ Awin’ hub brings our colleagues from across the globe together for various social activities.\u003c/p\u003e\n\n\u003cp\u003eDiversity & Inclusion are paramount to us, and we proudly pursue and hire diverse team members. We champion uniqueness and authenticity; this is who we are at our core. Our network of affiliate partnerships are diverse and transparent, as are the employees powering our vision to build the world’s leading open partner ecosystem. We welcome all backgrounds, identities, and experiences. If you need support at any point in the application or interview process, please let us know.\u003c/p\u003e\n\n\u003cp\u003eApply now to begin the next stage of your career at a progressive company that supports both your professional and personal development.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3748816107/",
      "Europe",
      "Hybrid, 100% Salary, Four Days",
      "Affiliate Marketing, Negotiation, Contract Management, Risk Analysis, Communication Skills",
      "Sales & Account Management, Business Development",
      "32",
      "\n",
      "\n\n"
    ],
    [
      "3674",
      "https://www.linkedin.com/jobs/view/client-services-manager-at-digible-inc-3760353629",
      "Digible, Inc",
      "Client Services Manager",
      "Denver, CO",
      "\u003ch2\u003eJob Description: Client Services Manager\u003c/h2\u003e\n\n\u003ch3\u003eCompany Overview:\u003c/h3\u003e\n\n\u003cp\u003ePrivately owned and operated, Digible was founded in 2017 with a mission to bring sophisticated digital marketing solutions to the multifamily industry. We offer a comprehensive suite of digital services as well as a predictive analytics platform, Fiona, that is the first of its kind.\u003c/p\u003e\n\n\u003cp\u003eAt Digible, Inc. we love to celebrate our diverse group of hardworking employees – and it shows. We pride ourselves on our collaborative, transparent, and authentic culture. These values are pervasive throughout every step of a Digible employee's journey. Starting with our interviews and continuing through our weekly All Hands Transparency Round-up, values are at the heart of working at Digible.\u003c/p\u003e\n\n\u003cp\u003eWe value diversity and believe forming teams in which everyone can be their authentic self is key to our success. We encourage people from underrepresented backgrounds and different industries to apply. Come join us and find out what the best work of your career could look like here at Digible.\u003c/p\u003e\n\n\u003ch3\u003eThe Role:\u003c/h3\u003e\n\n\u003cp\u003eDigible, Inc. is looking for a Client Services Manager to join our team!\u003c/p\u003e\n\n\u003cp\u003eThe Client Services Manager is responsible for:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eLeading, growing & retaining a team of 6-8 employees\u003c/li\u003e\n  \u003cli\u003eInnovating and improving process & strategy\u003c/li\u003e\n  \u003cli\u003eEnsuring their clients receive best-in class experience, upholding our Digible Guarantee\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDigible is expected to:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eGrow revenue to $40 million over the next 12 months\u003c/li\u003e\n  \u003cli\u003eDouble account volume, size and team growth\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eThe Client Services Manager will have:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eStrong managerial & leadership skills\u003c/li\u003e\n  \u003cli\u003eA background in both digital marketing & client support\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eThis role reports directly to the Director of Client Services and works closely with the rest of Digible's leadership team.\u003c/p\u003e\n\n\u003ch3\u003eYou'll love this job if you:\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eLove building a team and inspiring others\u003c/li\u003e\n  \u003cli\u003eAre extremely process oriented and results driven, can manage to numbers and hold the team accountable\u003c/li\u003e\n  \u003cli\u003eHave a track record of excellent client management and can lead by example for managing difficult relationships\u003c/li\u003e\n  \u003cli\u003eEnjoy improving workflow & maximizing efficiency\u003c/li\u003e\n  \u003cli\u003eHave experience thriving in a fast-paced agency environment\u003c/li\u003e\n  \u003cli\u003eAnticipate growth needs and organize work and bandwidth across multiple individuals\u003c/li\u003e\n  \u003cli\u003eAre skilled at building business cases and advocating for team needs while keeping company objectives top of mind\u003c/li\u003e\n  \u003cli\u003eAre a team player and naturally think \"we\" instead of \"I\", adopting a company first mindset\u003c/li\u003e\n  \u003cli\u003eHave an insatiable appetite for learning and self-improvement and are striving to be the best version of yourself\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eWhat you'll do:\u003c/h3\u003e\n\n\u003cp\u003eAs a Client Services Manager, you will:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eManage and oversee a team of 6-8 account managers & account coordinators all focused on a large enterprise client\u003c/li\u003e\n  \u003cli\u003eHire, retain, and coach your team\u003c/li\u003e\n  \u003cli\u003eConduct employee 1&1s, team meetings, performance reviews, and annual reviews\u003c/li\u003e\n  \u003cli\u003eOwn & Manage to all KPIs for your team:\u003c/li\u003e\n  \u003cul\u003e\n    \u003cli\u003eRevenue\u003c/li\u003e\n    \u003cli\u003eEmail response time\u003c/li\u003e\n    \u003cli\u003eRetention\u003c/li\u003e\n    \u003cli\u003eChurn\u003c/li\u003e\n    \u003cli\u003eDeal size\u003c/li\u003e\n    \u003cli\u003eaccts/fte\u003c/li\u003e\n    \u003cli\u003erev/fte\u003c/li\u003e\n    \u003cli\u003e# of issues\u003c/li\u003e\n  \u003c/ul\u003e\n  \u003cli\u003eDevelop a strong relationship with enterprise client by:\u003c/li\u003e\n  \u003cul\u003e\n    \u003cli\u003eSetting vision for a successful partnership, inspiring and exciting key stakeholders\u003c/li\u003e\n    \u003cli\u003eProviding escalation support when needed & solving problems that arise\u003c/li\u003e\n  \u003c/ul\u003e\n  \u003cli\u003eWork closely with director on carrying out dept vision & setting dept goals\u003c/li\u003e\n  \u003cli\u003eWork closely with managers across departments to improve scale & efficiency\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eHow success will be measured:\u003c/h3\u003e\n\n\u003cp\u003eSuccess in this role will be measured by:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eTeam efficiency (accts/fte & rev/fte)\u003c/li\u003e\n  \u003cli\u003eTeam happiness scores\u003c/li\u003e\n  \u003cli\u003eTeam revenue & retention rate\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eYou should have:\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003e4+ years of relevant experience in a customer facing role\u003c/li\u003e\n  \u003cli\u003e2+ years of digital agency experience\u003c/li\u003e\n  \u003cli\u003eManagement experience a strong plus\u003c/li\u003e\n  \u003cli\u003eMultifamily/Senior Living/Student Housing Experience a strong plus\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eYou should have superb communication skills, the ability to learn quickly, a growth mindset, and a values-driven personality.\u003c/p\u003e\n\n\u003ch3\u003eCore Values:\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eAuthenticity - The commitment to be steadfast and genuine with our actions and communication toward everyone we touch.\u003c/li\u003e\n  \u003cli\u003eCuriosity - The belief that a deep and fundamental curiosity (the \"why\") in our work is vital to company innovation and evolution.\u003c/li\u003e\n  \u003cli\u003eFocus - The collective will to remain completely devoted and ultimately accountable to our deliverables.\u003c/li\u003e\n  \u003cli\u003eHumility - The recognition and daily practice that \"we\" is always greater than \"I\".\u003c/li\u003e\n  \u003cli\u003eHappiness - The decision to prioritize passion and love for what we do above everything else.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003ePay, perks and such:\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eAnnual Salary of $75,000-95,000\u003c/li\u003e\n  \u003cli\u003e4-Day Work Week (32 Hour Work Week)\u003c/li\u003e\n  \u003cli\u003e1 Day / Week Remote\u003c/li\u003e\n  \u003cli\u003eProfit Sharing Bonus\u003c/li\u003e\n  \u003cli\u003e3 weeks of PTO as well as Sick leave, and Bereavement\u003c/li\u003e\n  \u003cli\u003e11 paid holidays\u003c/li\u003e\n  \u003cli\u003e401(k) + Match\u003c/li\u003e\n  \u003cli\u003e75% employer paid health benefits, including Medical, Dental, and Vision\u003c/li\u003e\n  \u003cli\u003e$75/ month reimbursement for Physical Wellness\u003c/li\u003e\n  \u003cli\u003e$75/ month reimbursement for Mental Wellness\u003c/li\u003e\n  \u003cli\u003e$1000/year travel fund for employees who have been with Digible 3+ years\u003c/li\u003e\n  \u003cli\u003eMonthly subscription for financial wellness\u003c/li\u003e\n  \u003cli\u003eDog-Friendly Office\u003c/li\u003e\n  \u003cli\u003ePaid Parental Leave\u003c/li\u003e\n  \u003cli\u003eCompany Sponsored Social Event\u003c/li\u003e\n  \u003cli\u003eCompany Provided Lunches, Snacks for in office employees\u003c/li\u003e\n  \u003cli\u003eEmployee Development Program\u003c/li\u003e\n\u003c/ul\u003e",
      "https://digible.com/why-digible/current-openings/?gh_jid=5022505004",
      "North America",
      "Hybrid, 100% Salary, Four Days",
      "SEO, PPC, Analytics, CRM, Account-Management",
      "Marketing, Customer Support",
      "32",
      "75000",
      "95000"
    ],
    [
      "3678",
      "https://ca.linkedin.com/jobs/view/staff-front-end-engineer-at-procurify-3768874380",
      "Procurify",
      "Staff Front End Engineer",
      "Vancouver, BC",
      "\u003ch2\u003eProcurify's Intelligent Spend Management Platform\u003c/h2\u003e\n\u003cp\u003eProcurify's Intelligent Spend Management platform provides hundreds of organizations worldwide with real-time visibility and control over all business spend. We're looking for a talented and team-driven Staff Front-end Engineer to join us on our journey.\u003c/p\u003e\n\n\u003ch2\u003eAbout The Role\u003c/h2\u003e\n\u003cp\u003eProcurify is looking for a Staff Frontend Engineer to join our architecture team at Procurify. This team is helping to shape the future of engineering at Procurify as we look to scale up to our next level of growth.\u003c/p\u003e\n\u003cp\u003eIn this role, you will help design and deliver a web application that our customers love. You will be a thought leader for frontend at Procurify and help coach our highly engaged, creative frontend engineers across the engineering organization.\u003c/p\u003e\n\u003cp\u003eProcurify just secured a series C round of funding and we are growing to serve new customers, in new industries, all over the world. This role will lead the articulation of a clear vision for our frontend web application to support this growth and to delight our customers.\u003c/p\u003e\n\n\u003ch2\u003eWhat You'll Be Working On\u003c/h2\u003e\n\u003cul\u003e\n  \u003cli\u003eArchitecting the next iteration of our web application with React.\u003c/li\u003e\n  \u003cli\u003eEstablish and communicate a clear vision for the future by collaborating with our Design and Product teams to build a customer-centric frontend that scales with Procurify.\u003c/li\u003e\n  \u003cli\u003eEmpower the team to deliver modern frontend features like real-time messaging, localization + internationalization, and accessibility.\u003c/li\u003e\n  \u003cli\u003eOperating at a high standard of engineering and coaching our engineering team to deliver at the same standard with skills such as:\u003c/li\u003e\n  \u003cul\u003e\n    \u003cli\u003eKnowledge of engineering and design principles and when to apply them\u003c/li\u003e\n    \u003cli\u003eKnowledge of architectural patterns and how to articulate the associated trade offs\u003c/li\u003e\n    \u003cli\u003eAwareness of common attack vectors and mitigations\u003c/li\u003e\n  \u003c/ul\u003e\n  \u003cli\u003eUsing your architectural skills and deep knowledge of patterns to accelerate our legacy javascript to React migration. In this effort you will use your knowledge of patterns and where to apply them.\u003c/li\u003e\n  \u003cli\u003eWork closely with architecture team backend and data counterparts to influence our system high-level design principles and ensure our frontend architecture aligns to them.\u003c/li\u003e\n  \u003cli\u003eJoin annual hackathons and immerse yourself in all things fintech innovation.\u003c/li\u003e\n  \u003cli\u003eRotate between projects and commit to continuous learning with our lean kanban processes.\u003c/li\u003e\n  \u003cli\u003eWork with a cloud native architecture:\u003c/li\u003e\n  \u003cul\u003e\n    \u003cli\u003eReact/Typescript\u003c/li\u003e\n    \u003cli\u003ePython/Django\u003c/li\u003e\n    \u003cli\u003eKubernetes\u003c/li\u003e\n    \u003cli\u003eFully deployed in AWS\u003c/li\u003e\n  \u003c/ul\u003e\n  \u003cli\u003eProvide thought leadership and guide the technology and architecture choices of our frontend in collaboration with other engineers.\u003c/li\u003e\n  \u003cli\u003eBuild reusable architecture for our web client using well-accepted design patterns that allow for iterative, autonomous development and future scaling.\u003c/li\u003e\n  \u003cli\u003eAdvise Procurify's leadership team on critical technical considerations related to the future of our frontend technology.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eWho We're Looking For\u003c/h2\u003e\n\u003cp\u003eHave 6-8+ years of frontend software engineering experience.\u003c/p\u003e\n\u003cp\u003eDeep knowledge of and experience with patterns such as Singleton, Observer, Strategy, Decorator, Flux patterns.\u003c/p\u003e\n\u003cp\u003eDependency Injection Clean Architecture.\u003c/p\u003e\n\u003cp\u003eHigher Order component pattern + Container/Presenter pattern.\u003c/p\u003e\n\u003cp\u003eExperience building reliable and scalable software solutions with a team of software developers, using React.\u003c/p\u003e\n\u003cp\u003eExpert level experience with Typescript.\u003c/p\u003e\n\u003cp\u003eExcellent Design/CSS skills to ensure that our frontend has a UI/UX that customers love.\u003c/p\u003e\n\u003cp\u003eA proven track record of building/maintaining business-critical web applications at scale.\u003c/p\u003e\n\u003cp\u003eA coach who has experience growing technical leadership on an engineering team.\u003c/p\u003e\n\u003cp\u003eFamiliarity with agile and software development practices such as scrum/kanban, CI/CD, test automation, and infrastructure as code.\u003c/p\u003e\n\n\u003ch2\u003eWHY PROCURIFY?\u003c/h2\u003e\n\u003cp\u003eHelp us modernize spend management.\u003c/p\u003e\n\u003cp\u003eProcurify is a remote-first company with a big heart and a strong ambition to modernize the way organizations manage business spend. We're trusted by hundreds of companies around the world — across industries like biotechnology, education, health care, manufacturing, and software — to manage over $30B in spend. We recently closed $50M in Series C funding to help us strengthen our core offering, launch new payment capabilities, and provide customers with an AI-enhanced procure-to-pay experience. Read the press release \u003ca href=\"https://www.procurify.com/press/procurify-raises-50m-series-c-funding\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eBe empowered to do your best work.\u003c/p\u003e\n\u003cp\u003eWe've created an environment where personal and professional growth is a real priority. Some of the great perks we offer include:\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003eFlexible working: We're a remote-first organization with flexible working hours. Work anywhere from within Canada!\u003c/li\u003e\n  \u003cli\u003eFour-day workweek: Burnout is real. To help you restore balance between work and life, all Procurify team members work four days a week.\u003c/li\u003e\n  \u003cli\u003eUnlimited responsible time off: Work hard, play harder. All team members can take advantage of our unlimited responsible time off policy.\u003c/li\u003e\n  \u003cli\u003eExtended health benefits: We prioritize our team's health and well-being. We offer a competitive health, vision, and dental package along with an Employee Assistance Program (EAP), and a health and wellness spending account.\u003c/li\u003e\n  \u003cli\u003eCommunity initiatives: We have a strong commitment to giving back to our communities, including regular volunteer days, our Donate Your Day program, and education lunch and learns.\u003c/li\u003e\n  \u003cli\u003eStock options: Everyone has a chance to own a part of Procurify with our competitive stock program.\u003c/li\u003e\n  \u003cli\u003eDEI initiatives: We regularly run a diversity, equity, and inclusion roundtable where we host guest speakers and tackle the topics that matter.\u003c/li\u003e\n  \u003cli\u003eBase Salary Range: $146,000 - $218,000 (This range is dependent on experience and not inclusive of any bonus, commission, benefits or equity that might exist in your total compensation package.)\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eWork with an amazing team.\u003c/p\u003e\n\u003cp\u003eWe've welcomed team members who were boat captains, funeral directors, swing dancers, competitive gamers, plumbers, and novelists. Everyone has a story and we're here to embrace them!\u003c/p\u003e\n\n\u003ch2\u003eLEARN MORE\u003c/h2\u003e\n\u003cp\u003eProcurify is an Equal Opportunity Employer. We do not discriminate against any team members or applicants for employment because of race, color, disability, sex, age, national origin, religion, sexual orientation, or gender identity and/or expression.\u003c/p\u003e\n\n\u003cp\u003eIf you feel like you don't meet all of the requirements for this role, we encourage you to apply anyway. We know that feelings of imposter syndrome can get in the way of meeting incredible candidates, and we certainly don't want those feelings to get in the way of meeting you! We really want to get to know you and why you're great for the role. Please avoid including your picture and age on your resume.\u003c/p\u003e\n\n\u003cp\u003eApply online today and let's start a conversation.\u003c/p\u003e\n\n\u003cp\u003eTo learn more about Procurify, check out these resources:\u003c/p\u003e\n\u003cul\u003e\n  \u003cli\u003eGet to know our team through our Meet Us Monday videos\u003c/li\u003e\n  \u003cli\u003eCheck out what our customers are saying about us\u003c/li\u003e\n  \u003cli\u003eLearn more about our procure-to-pay platform\u003c/li\u003e\n\u003c/ul\u003e",
      "https://boards.greenhouse.io/procurify/jobs/4340642005#app",
      "North America",
      "Remote, Four Days, 100% Salary",
      "React, Typescript, CSS, Python/Django, Kubernetes",
      "Engineering",
      "32",
      "146000",
      "218000"
    ],
    [
      "4197",
      "https://ph.linkedin.com/jobs/view/platform-engineer-sre-remote-philippines-at-shape-construction-3776710475",
      "Shape Construction",
      "Platform Engineer / SRE - Remote (Philippines)",
      "Philippines",
      "\u003ch2\u003eJob Description: Platform Engineer\u003c/h2\u003e\n\n\u003cp\u003eEver wondered how it would be to revolutionise one of the least digitised industries in the market, alongside a growing and switched-on team? Read on!\u003c/p\u003e\n\n\u003ch3\u003eAbout Us\u003c/h3\u003e\n\n\u003cp\u003eWe are Shape.Construction! We are digitising the largest and most fundamental industry in the world, the industry that literally builds the foundations of the civilisation we all depend on to spare us from a brutal hunter-gatherer life: CONSTRUCTION. It is one of the least digitised industries in the world but also the largest – 1 in 9 people globally work in the construction industry and it constitutes 11% of global GDP. Improving construction strengthens the very foundation of human civilisation. (Watch our short film about it \u003ca href=\"youtu.be/PxcBZupiI7Y\"\u003ehere\u003c/a\u003e).\u003c/p\u003e\n\n\u003cp\u003eWe got our start as a high-end construction project management consultancy. As a consultancy, we are focused on genuinely upgrading the way construction projects are delivered. We then take the deep understanding of the projects we work on to develop construction management software products that anyone can use to deliver their projects better. We are building a full suite of products one module at a time – kind of like office 365 but for construction management. (Check out \u003ca href=\"www.shape.construction/\"\u003ewww.shape.construction/\u003c/a\u003e, our construction management tech and watch this video about what we are doing \u003ca href=\"youtu.be/tgi4hW3G_NY\"\u003ehere\u003c/a\u003e).\u003c/p\u003e\n\n\u003cp\u003eThe core of all this is our true secret sauce; people. We only recruit the very best both in capability and personality. We are deeply focused on designing a new type of organisation that is optimised for the flourishing of the people in the team first and foremost. People that join us develop fast as a whole person in ways they never imagined. (Read more about our vision and mission \u003ca href=\"www.shape.construction/join-us/\"\u003ehere\u003c/a\u003e).\u003c/p\u003e\n\n\u003cp\u003eThis approach has allowed us to grow from just 2 people in 2017 to over 160 today (including consultancy) and we are still very much at the beginning! Joining us isn’t just some “job”, it is a transformative educational experience. We challenge you to be your best self in all aspects of life.\u003c/p\u003e\n\n\u003ch3\u003e4 Core Values for a Good Life\u003c/h3\u003e\n\n\u003cp\u003eWe believe a life of human flourishing is all about meaningful relationships with others and challenging yourself to create a positive impact. So our values reflect the 4 levels of relationships that each of us has:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eGrow yourself – Your relationship with yourself\u003c/li\u003e\n  \u003cli\u003eCare about people – Your relationship with others around you\u003c/li\u003e\n  \u003cli\u003eExecute to greatness – Your relationship with your team\u003c/li\u003e\n  \u003cli\u003eBuild civilisation – Your relationship with humanity and the world\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eThis goes much deeper but for the sake of brevity, we will keep the summary version! We enshrined our values in our vision:\u003c/p\u003e\n\n\u003cp\u003eWe exist so that everyone in our team can thrive in a high-impact community that:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eConnects us with meaningful relationships\u003c/li\u003e\n  \u003cli\u003eInspires us to develop ourselves to become better humans\u003c/li\u003e\n  \u003cli\u003eEmpowers us to pursue our own learning adventures\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eWe believe that, by first doing this, we can achieve the highest levels of value for the world. And enable the achievement of our vision through our dual missions:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eTo fully digitise the construction of human civilisation\u003c/li\u003e\n  \u003cli\u003eTo create a new type of organisation that enables human flourishing while delivering a huge positive impact on society\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eThe Role\u003c/h3\u003e\n\n\u003cp\u003eWe are currently looking for a Platform Engineer who crafts the tools to accelerate development and delights our engineers and is capable of architecting our scalable and resilient cloud infrastructure.\u003c/p\u003e\n\n\u003ch4\u003eTeam\u003c/h4\u003e\n\n\u003cp\u003eOur team is made up of experienced software engineers, product designers, and product strategists. Together we will build the digital backbone of a construction organisation.\u003c/p\u003e\n\n\u003ch4\u003eYour Top 3 Objectives\u003c/h4\u003e\n\n\u003col\u003e\n  \u003cli\u003eBe the foundation that supports our app's rapid growth.\u003c/li\u003e\n  \u003cli\u003eDesign and construct a high-rise platform for our suite of products.\u003c/li\u003e\n  \u003cli\u003eTo develop yourself and everyone around you.\u003c/li\u003e\n\u003c/ol\u003e\n\n\u003ch4\u003eYour Top 5 Responsibilities\u003c/h4\u003e\n\n\u003cul\u003e\n  \u003cli\u003eOwn Platform: Support the development environment of our software engineers.\u003c/li\u003e\n  \u003cli\u003eBuild and develop your team: Lead, grow and develop our amazing platform team, ensuring we stay focused are producing work of exceptional quality and having a lot of fun along the way.\u003c/li\u003e\n  \u003cli\u003eKeep us on the cutting edge: Stay up to date with the latest industry technologies and tools and techniques to ensure we are staying ahead of the rest of the industry.\u003c/li\u003e\n  \u003cli\u003eInfra as code: Terraform all the things!\u003c/li\u003e\n  \u003cli\u003eDevelop everyone: Maximise the development of your team personally and professionally and educate.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch4\u003eYour Capabilities\u003c/h4\u003e\n\n\u003cp\u003eYou are a proven Platform Engineer who sets up observability tools and provides the developers with the necessary means for them to have faster feedback.\u003c/p\u003e\n\n\u003ch5\u003eMust-Have (The fundamentals)\u003c/h5\u003e\n\n\u003cul\u003e\n  \u003cli\u003eMastery: Deep level of knowledge on the frameworks and tools used.\u003c/li\u003e\n  \u003cli\u003eCommunication: Good communication is much more than saying the right thing. It is about communicating messages clearly and concisely. Ability to choose the best method of communication based on context, audience, and urgency.\u003c/li\u003e\n  \u003cli\u003eLeadership: Can help colleagues achieve goals. Knows how to share his/her knowledge and experience.\u003c/li\u003e\n  \u003cli\u003eImpact: Over-analysing or over-thinking can be as problematic as not analysing or not thinking. Ability to make decisions and take action.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch5\u003eNice to Have (If you don’t have it now you will after joining)\u003c/h5\u003e\n\n\u003cul\u003e\n  \u003cli\u003eMastery: Ability to write code with a high level of simplicity and a low level of complexity.\u003c/li\u003e\n  \u003cli\u003eCommunication: Presents concerns, doubts, or ideas publicly (speaking or writing) and with associated research (internal or external meetups, conferences).\u003c/li\u003e\n  \u003cli\u003eLeadership: Give us and others constructively critical feedback in order to continuously improve.\u003c/li\u003e\n  \u003cli\u003eImpact: Ability to drive change, generate knowledge, and empower the team.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eShape isn’t the place for you if any of the following is true:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eYou want an easy, chilled-out role without much challenge\u003c/li\u003e\n  \u003cli\u003eYou like to be the smartest person in the room\u003c/li\u003e\n  \u003cli\u003eYou don’t like continuously receiving honest candid feedback\u003c/li\u003e\n  \u003cli\u003eYou prefer to do your own thing rather than work with a team\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eFrequently Asked Questions\u003c/h3\u003e\n\n\u003cp\u003e\u003cstrong\u003eCan you tell me more about what the role is like?\u003c/strong\u003e We are in scale-up mode, so it will be a pretty full-on role with more things to do than time available. This is why it will be important to prioritize and also develop capacity in the team by hiring and holding the team to the highest standards. We don’t like to mess about, so you will need to be a very high performer who only wants to work with others of your ilk. We are growing rapidly, so that means your role will grow rapidly too. You will need to keep up and constantly be looking 1-2 years ahead.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eWhere would I be working?\u003c/strong\u003e All of our roles are 100% remote and home-based. However, if you would like to work in a co-work space to get out of the house, we can arrange that. If you are in one of our locations with offices, you can come as often as you like.\u003c/p\u003e\n\n\u003ch3\u003eSalary and Benefits\u003c/h3\u003e\n\n\u003cp\u003e\u003cstrong\u003eStandard Stuff\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003ePaid Annual Leave 25 days + statutory Bank Holidays\u003c/li\u003e\n  \u003cli\u003eFlexible hours\u003c/li\u003e\n  \u003cli\u003eCompensation for this role depends on your capability level and will likely fall in the PHP 836,550 to 2,585,700 annual range.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003eThe Life-Changing Stuff\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003e4 Day Weeks: That’s right, 4 day weeks\u003c/li\u003e\n  \u003cli\u003eGrow your whole self: Our leaders are more like coaches and one of our main objectives is to give 5 years’ worth of learning and development for every 1 year with us. You have a coach, mentor, well-being therapist, and a development-orientated environment. That’s literally what our vision is all about and the primary reason Shape exists\u003c/li\u003e\n  \u003cli\u003eBe surrounded by the best: We only hire and retain the very best people. You might be used to being the smartest in the room, but that won’t be the case in Shape. You will be surrounded by people you can learn from. We are 100% meritocratic, so fast progression is the norm. You will be supported to excel in whichever areas you are most interested in! With Shape, development is unbounded\u003c/li\u003e\n  \u003cli\u003eLong-term impact: We are focused on solving the biggest issues in construction project delivery in a way that can spread and outlast us\u003c/li\u003e\n  \u003cli\u003eA generous equity scheme: as a fast-growing consultancy as well as the fact we are building software, this has a huge upside, particularly for people that stay with us through our growth\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eApplying Properly!!! Important!!!\u003c/h3\u003e\n\n\u003cp\u003eWe get thousands of applications, so please write us a letter as part of your application explaining:\u003c/p\u003e\n\n\u003col\u003e\n  \u003cli\u003eWhy do you want to join us?\u003c/li\u003e\n  \u003cli\u003eWhat do you think you bring to the team?\u003c/li\u003e\n\u003c/ol\u003e\n\n\u003cp\u003eWe aren't a giant faceless corporation; we really care about the people who want to join our team, so all letters will be read",
      "https://www.linkedin.com/jobs/view/3776710475/",
      "Asia",
      "Remote, 100% Salary, Four Days",
      "Terraform, Observability, Cloud, Leadership, Communication",
      "Engineering",
      "32"
    ],
    [
      "4727",
      "https://www.linkedin.com/jobs/view/architectural-draftsperson-at-bsb-design-3768703232",
      "BSB Design",
      "Architectural Draftsperson",
      "Philadelphia, PA",
      "\u003ch2\u003eJob Description\u003c/h2\u003e\n\n\u003cp\u003eBSB has generated lasting impact across the country for more than 50 years! The foundation of BSB Design will always be our people, those who give their all to help generate success for our clients and our firm. We believe that by working together in an environment that promotes respect, opportunities for growth and fun, our employees are able to deliver their best every day. That is also why we have launched our FOUR-DAY WORK WEEK!\u003c/p\u003e\n\n\u003cp\u003eAs one of the largest architecture firms in the country, our designs impact tens of thousands of people. We are always looking for passionate professionals who aspire to make a difference.\u003c/p\u003e\n\n\u003cp\u003eWe strive to achieve two goals: Create success that builds a trusted partnership with our client, and positively impact the way people live, work and play.\u003c/p\u003e\n\n\u003ch3\u003eJob Summary:\u003c/h3\u003e\n\u003cp\u003eAssists the Project Manager in producing quality construction documents in an efficient and profitable manner. Transforms initial schematic design by utilizing our custom AutoCAD system to produce working documents.\u003c/p\u003e\n\n\u003ch3\u003eResponsibilities:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eUses AutoCAD, Revit, and manual processes to produce construction documents using instructions and pre-established guidelines set by others.\u003c/li\u003e\n  \u003cli\u003eFollows applicable guidelines for project standards.\u003c/li\u003e\n  \u003cli\u003eConverts limited verbal and written directions from Job Captain or Project Manager throughout the design process and into a finished product or document.\u003c/li\u003e\n  \u003cli\u003eDrafts specification changes as needed.\u003c/li\u003e\n  \u003cli\u003eGenerates architectural plans and graphics.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eSkill Sets:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eHas knowledge of commonly used architectural concepts, practices, and procedures\u003c/li\u003e\n  \u003cli\u003eAbility to manage multiple tasks and meet deadlines\u003c/li\u003e\n  \u003cli\u003eAutoCAD experience required\u003c/li\u003e\n  \u003cli\u003eRevit experience required\u003c/li\u003e\n  \u003cli\u003eDesign, graphic and related computer skills a plus\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eEducation:\u003c/h3\u003e\n\u003cp\u003eAssociate degree in Drafting and/or Design. Preferably has experience in architecture and/or construction.\u003c/p\u003e\n\n\u003cp\u003eBSB Design provides equal employment opportunities to all employees and applicants for employment without regard to race, color, ancestry, national origin, sex, sexual orientation, marital status, religion, age, disability, gender identity or expression, pregnancy, parenting status, results of genetic testing, service in the military or any other quality or characteristic protected by federal, state, or local law. Equal employment opportunity applies to all terms and conditions of employment, including hiring, placement, promotion, termination, layoff, recall, transfer, leave of absence, compensation, and training.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3768703232/",
      "North America",
      "On-site, Four Days, 100% Salary",
      "AutoCAD, Revit, Drafting, Architecture, ConstructionDocuments",
      "Architecture, Design",
      "32"
    ],
    [
      "4727",
      "https://www.linkedin.com/jobs/view/architectural-commercial-technical-draftsperson-at-bsb-design-3768703241",
      "BSB Design",
      "Architectural Commercial Technical Draftsperson",
      "Los Angeles, CA",
      "\u003ch2\u003eJob Description\u003c/h2\u003e\n\n\u003cp\u003eBSB has generated lasting impact across the country for more than 50 years! The foundation of BSB Design will always be our people, those who give their all to help generate success for our clients and our firm. We believe that by working together in an environment that promotes respect, opportunities for growth and fun, our employees are able to deliver their best every day. That is also why we have launched our FOUR-DAY WORK WEEK!\u003c/p\u003e\n\n\u003cp\u003eAs one of the largest architecture firms in the country, our designs impact tens of thousands of people. We are always looking for passionate professionals who aspire to make a difference.\u003c/p\u003e\n\n\u003cp\u003eWe strive to achieve two goals: Create success that builds a trusted partnership with our client, and positively impact the way people live, work and play.\u003c/p\u003e\n\n\u003cp\u003eWe are seeking Technical Draftspeople in our Withee Malcolm — A BSB Design Studio office at all levels—entry to advanced—for commercial/industrial projects across California and nationally.\u003c/p\u003e\n\n\u003ch3\u003eJob Summary:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eCreating, coordinating or refining architectural plans, elevations, sections, etc.\u003c/li\u003e\n  \u003cli\u003eProducing illustrative or graphic materials such as renderings or other visuals for presentations\u003c/li\u003e\n  \u003cli\u003eDeveloping design documentation under the guidance of Job Captains or Project Managers\u003c/li\u003e\n  \u003cli\u003eIncorporating corrections into drawings sets (red lines or plan check comments)\u003c/li\u003e\n  \u003cli\u003eAssisting in project administration\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eResponsibilities:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eAll levels – produce technical work supporting production and design departments\u003c/li\u003e\n  \u003cli\u003eAll levels – work within the team environment to produce architectural details or copy, and revise existing drawings\u003c/li\u003e\n  \u003cli\u003eAll levels – prepare graphic or documentation packages under supervision\u003c/li\u003e\n  \u003cli\u003eAll levels – integrate office-wide standards into graphic and documentation packages\u003c/li\u003e\n  \u003cli\u003eIntroductory/Intermediate level – adapt or generate schematic design drawings or architectural details from rough sketches or marked-up drawings\u003c/li\u003e\n  \u003cli\u003eIntermediate levels – complete schedules, callouts, indexes and other design documentation support materials with the oversight and mark-ups of others\u003c/li\u003e\n  \u003cli\u003eAdvanced levels – implement design revisions, identifying known errors and making recommendations for corrections\u003c/li\u003e\n  \u003cli\u003eAdvanced levels – make design decisions based on the program, code requirements and project concept design\u003c/li\u003e\n  \u003cli\u003eAdvanced levels – prepare area takeoffs and quantity estimates\u003c/li\u003e\n  \u003cli\u003eAdvanced levels – mentor less experienced staff\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eSkill Sets:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eAll levels – general knowledge of building design and documentation\u003c/li\u003e\n  \u003cli\u003eAll levels – interest in learning and expanding graphic as well as documentation skills\u003c/li\u003e\n  \u003cli\u003eAll levels – technical proficiency with Revit / BIM, Bluebeam\u003c/li\u003e\n  \u003cli\u003eAll levels – 3D visualization and graphic presentation via software such as SketchUp, Photoshop and Illustrator\u003c/li\u003e\n  \u003cli\u003eIntermediate/Advance levels – have REVIT modeling and family creation knowledge\u003c/li\u003e\n  \u003cli\u003eIntermediate level – proficiency in document coordination and detail development\u003c/li\u003e\n  \u003cli\u003eAdvanced levels – general knowledge of code requirements\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eEducation:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eIntroductory – Tech School/AA degree preferred\u003c/li\u003e\n  \u003cli\u003eIntermediate – Bachelor of Architecture degree or equivalent required and 2 years minimum architectural experience in an office environment\u003c/li\u003e\n  \u003cli\u003eAdvanced – Bachelor of Architecture degree or equivalent required and 4 years minimum architectural experience in an office environment\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eBSB Design provides equal employment opportunities to all employees and applicants for employment without regard to race, color, ancestry, national origin, sex, sexual orientation, marital status, religion, age, disability, gender identity or expression, pregnancy, parenting status, results of genetic testing, service in the military or any other quality or characteristic protected by federal, state, or local law. Equal employment opportunity applies to all terms and conditions of employment, including hiring, placement, promotion, termination, layoff, recall, transfer, leave of absence, compensation, and training.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3768703241/",
      "North America",
      "On-site, Four Days, 100% Salary",
      "Revit, BIM, Bluebeam, SketchUp, Photoshop",
      "Architecture, Engineering",
      "32"
    ],
    [
      "4727",
      "https://www.linkedin.com/jobs/view/architectural-job-captain-at-bsb-design-3768098527",
      "BSB Design",
      "Architectural Job Captain",
      "Sacramento, CA",
      "\u003ch2\u003eJob Description\u003c/h2\u003e\n\n\u003cp\u003eBSB has generated lasting impact across the country for more than 50 years! The foundation of BSB Design will always be our people, those who give their all to help generate success for our clients and our firm. We believe that by working together in an environment that promotes respect, opportunities for growth and fun, our employees are able to deliver their best every day. That is also why we have launched our FOUR-DAY WORK WEEK!\u003c/p\u003e\n\n\u003cp\u003eAs one of the largest architecture firms in the country, our designs impact tens of thousands of people. We are always looking for passionate professionals who aspire to make a difference.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eJob Summary:\u003c/strong\u003e Responsible for coordinating and leading the architectural drafting team on a project in developing documents. Assists the Project Manager with project administration from schematic design through construction documents.\u003c/p\u003e\n\n\u003ch3\u003eResponsibilities:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eUses AutoCAD software to produce construction documents using designs of others.\u003c/li\u003e\n  \u003cli\u003eGenerates architectural plans on multiple projects from start to finish.\u003c/li\u003e\n  \u003cli\u003eMakes redline corrections to existing construction documents as well as help with scheduling of construction documents.\u003c/li\u003e\n  \u003cli\u003eCommunicates with drafting staff regarding specifications and corrections to construction documents.\u003c/li\u003e\n  \u003cli\u003eEnsure that construction documents are complete and ready for submittal to planning department and design review committee (includes plans, sections, details, elevations, schedules).\u003c/li\u003e\n  \u003cli\u003eWork directly with Project Managers and Licensed Architect to coordinate and delegate work of selected projects.\u003c/li\u003e\n  \u003cli\u003eProvides work direction and delegates work to ensure the team is completing projects within and/or before deadlines.\u003c/li\u003e\n  \u003cli\u003eAssists with and provides training to production staff.\u003c/li\u003e\n  \u003cli\u003eEnsures compliance to applicable codes and standards for construction document production.\u003c/li\u003e\n  \u003cli\u003eResearches and evaluates data for products.\u003c/li\u003e\n  \u003cli\u003eAssesses problems and recommends solutions to the Project Manager for implementation.\u003c/li\u003e\n  \u003cli\u003eAssists in coordination with contractors, clients, engineers (mechanical, electrical, plumbing, structural, civil, landscape).\u003c/li\u003e\n  \u003cli\u003eAssists with client meetings and coordinates this information with the team.\u003c/li\u003e\n  \u003cli\u003eSite visits and coordination with changes in the field.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eSkill Sets:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eProven skill to follow up w/ staff, consultants, and client\u003c/li\u003e\n  \u003cli\u003eAutoCAD proficiency required; 3-D modeling programs desirable- include excel, Microsoft word, Bluebeam, PowerPoint, and Adobe Acrobat\u003c/li\u003e\n  \u003cli\u003eSome travel may be necessary\u003c/li\u003e\n  \u003cli\u003eAbility to lead a team\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eEducation:\u003c/h3\u003e\n\u003cp\u003eBachelor’s degree in Architecture\u003c/p\u003e\n\u003cp\u003eThree to six years of Single-Family experience in design development and contract documents.\u003c/p\u003e\n\n\u003cp\u003eBSB Design provides equal employment opportunities to all employees and applicants for employment without regard to race, color, ancestry, national origin, sex, sexual orientation, marital status, religion, age, disability, gender identity or expression, pregnancy, parenting status, results of genetic testing, service in the military or any other quality or characteristic protected by federal, state, or local law. Equal employment opportunity applies to all terms and conditions of employment, including hiring, placement, promotion, termination, layoff, recall, transfer, leave of absence, compensation, and training.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3768098527/",
      "North America",
      "On-site, Four Days, 100% Salary",
      "AutoCAD, 3D-Modeling, Bluebeam, Leadership, Architecture",
      "Architecture, Engineering",
      "32"
    ],
    [
      "4727",
      "https://www.linkedin.com/jobs/view/architectural-residential-job-captain-at-bsb-design-3768703229",
      "BSB Design",
      "Architectural Residential Job Captain",
      "Irvine, CA",
      "\u003ch2\u003eJob Description\u003c/h2\u003e\n\n\u003cp\u003eBSB has generated lasting impact across the country for more than 50 years! The foundation of BSB Design will always be our people, those who give their all to help generate success for our clients and our firm. We believe that by working together in an environment that promotes respect, opportunities for growth and fun, our employees are able to deliver their best every day. That is also why we have launched our FOUR-DAY WORK WEEK!\u003c/p\u003e\n\n\u003cp\u003eAs one of the largest architecture firms in the country, our designs impact tens of thousands of people. We are always looking for passionate professionals who aspire to make a difference.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eJob Summary:\u003c/strong\u003e Responsible for coordinating and leading the architectural drafting team on a project in developing documents. Assists the Project Manager with project administration from schematic design through construction documents.\u003c/p\u003e\n\n\u003ch3\u003eResponsibilities:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eUses AutoCAD software to produce construction documents using designs of others.\u003c/li\u003e\n  \u003cli\u003eGenerates architectural plans on multiple projects from start to finish.\u003c/li\u003e\n  \u003cli\u003eMakes redline corrections to existing construction documents as well as help with scheduling of construction documents.\u003c/li\u003e\n  \u003cli\u003eCommunicates with drafting staff regarding specifications and corrections to construction documents.\u003c/li\u003e\n  \u003cli\u003eEnsure that construction documents are complete and ready for submittal to planning department and design review committee (includes plans, sections, details, elevations, schedules).\u003c/li\u003e\n  \u003cli\u003eWork directly with Project Managers and Licensed Architect to coordinate and delegate work of selected projects.\u003c/li\u003e\n  \u003cli\u003eProvides work direction and delegates work to ensure the team is completing projects within and/or before deadlines.\u003c/li\u003e\n  \u003cli\u003eAssists with and provides training to production staff.\u003c/li\u003e\n  \u003cli\u003eEnsures compliance to applicable codes and standards for construction document production.\u003c/li\u003e\n  \u003cli\u003eResearches and evaluates data for products.\u003c/li\u003e\n  \u003cli\u003eAssesses problems and recommends solutions to the Project Manager for implementation.\u003c/li\u003e\n  \u003cli\u003eAssists in coordination with contractors, clients, engineers (mechanical, electrical, plumbing, structural, civil, landscape).\u003c/li\u003e\n  \u003cli\u003eAssists with client meetings and coordinates this information with the team.\u003c/li\u003e\n  \u003cli\u003eSite visits and coordination with changes in the field.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eSkill Sets:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eProven skill to follow up w/ staff, consultants, and client\u003c/li\u003e\n  \u003cli\u003eAutoCAD proficiency required; 3-D modeling programs desirable- include excel, Microsoft word, Bluebeam, PowerPoint, and Adobe Acrobat\u003c/li\u003e\n  \u003cli\u003eCommunicate clearly and concisely, both orally and in writing\u003c/li\u003e\n  \u003cli\u003ePositive “can do” attitude\u003c/li\u003e\n  \u003cli\u003eSome travel may be necessary\u003c/li\u003e\n  \u003cli\u003eAbility to lead a team\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eEducation:\u003c/h3\u003e\n\u003cp\u003eBachelor’s degree in Architecture. Three to six years of Single-Family experience in design development and contract documents.\u003c/p\u003e\n\n\u003cp\u003eBSB Design provides equal employment opportunities to all employees and applicants for employment without regard to race, color, ancestry, national origin, sex, sexual orientation, marital status, religion, age, disability, gender identity or expression, pregnancy, parenting status, results of genetic testing, service in the military or any other quality or characteristic protected by federal, state, or local law. Equal employment opportunity applies to all terms and conditions of employment, including hiring, placement, promotion, termination, layoff, recall, transfer, leave of absence, compensation, and training.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3768703229/",
      "North America",
      "On-site, Four Days, 100% Salary",
      "AutoCAD, 3D-Modeling, Bluebeam, MicrosoftOffice, Leadership",
      "Architecture, Design",
      "32"
    ],
    [
      "4727",
      "https://www.linkedin.com/jobs/view/architectural-residential-job-captain-at-bsb-design-3768097848",
      "BSB Design",
      "Architectural Residential Job Captain",
      "Chicago, IL",
      "\u003ch2\u003eJob Description\u003c/h2\u003e\n\n\u003cp\u003eBSB has generated lasting impact across the country for more than 50 years! The foundation of BSB Design will always be our people, those who give their all to help generate success for our clients and our firm. We believe that by working together in an environment that promotes respect, opportunities for growth and fun, our employees are able to deliver their best every day. That is also why we have launched our FOUR-DAY WORK WEEK!\u003c/p\u003e\n\n\u003cp\u003eAs one of the largest architecture firms in the country, our designs impact tens of thousands of people. We are always looking for passionate professionals who aspire to make a difference.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eJob Summary:\u003c/strong\u003e Responsible for coordinating and leading the architectural drafting team on a project in developing documents. Assists the Project Manager with project administration from schematic design through construction documents.\u003c/p\u003e\n\n\u003ch3\u003eResponsibilities:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eUses AutoCAD software to produce construction documents using designs of others.\u003c/li\u003e\n  \u003cli\u003eGenerates architectural plans on multiple projects from start to finish.\u003c/li\u003e\n  \u003cli\u003eMakes redline corrections to existing construction documents as well as help with scheduling of construction documents.\u003c/li\u003e\n  \u003cli\u003eCommunicates with drafting staff regarding specifications and corrections to construction documents.\u003c/li\u003e\n  \u003cli\u003eEnsure that construction documents are complete and ready for submittal to planning department and design review committee (includes plans, sections, details, elevations, schedules).\u003c/li\u003e\n  \u003cli\u003eWork directly with Project Managers and Licensed Architect to coordinate and delegate work of selected projects.\u003c/li\u003e\n  \u003cli\u003eProvides work direction and delegates work to ensure the team is completing projects within and/or before deadlines.\u003c/li\u003e\n  \u003cli\u003eAssists with and provides training to production staff.\u003c/li\u003e\n  \u003cli\u003eEnsures compliance to applicable codes and standards for construction document production.\u003c/li\u003e\n  \u003cli\u003eResearches and evaluates data for products.\u003c/li\u003e\n  \u003cli\u003eAssesses problems and recommends solutions to the Project Manager for implementation.\u003c/li\u003e\n  \u003cli\u003eAssists in coordination with contractors, clients, engineers (mechanical, electrical, plumbing, structural, civil, landscape).\u003c/li\u003e\n  \u003cli\u003eAssists with client meetings and coordinates this information with the team.\u003c/li\u003e\n  \u003cli\u003eSite visits and coordination with changes in the field.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eSkill Sets:\u003c/h3\u003e\n\u003cul\u003e\n  \u003cli\u003eProven skill to follow up w/ staff, consultants, and client\u003c/li\u003e\n  \u003cli\u003eAutoCAD proficiency required; 3-D modeling programs desirable- include excel, Microsoft word, Bluebeam, PowerPoint, and Adobe Acrobat\u003c/li\u003e\n  \u003cli\u003eCommunicate clearly and concisely, both orally and in writing\u003c/li\u003e\n  \u003cli\u003ePositive “can do” attitude\u003c/li\u003e\n  \u003cli\u003eSome travel may be necessary\u003c/li\u003e\n  \u003cli\u003eAbility to lead a team\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eEducation:\u003c/h3\u003e\n\u003cp\u003eBachelor’s degree in Architecture. Three to six years of Single-Family experience in design development and contract documents.\u003c/p\u003e\n\n\u003cp\u003eBSB Design provides equal employment opportunities to all employees and applicants for employment without regard to race, color, ancestry, national origin, sex, sexual orientation, marital status, religion, age, disability, gender identity or expression, pregnancy, parenting status, results of genetic testing, service in the military or any other quality or characteristic protected by federal, state, or local law. Equal employment opportunity applies to all terms and conditions of employment, including hiring, placement, promotion, termination, layoff, recall, transfer, leave of absence, compensation, and training.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3768097848/",
      "North America",
      "On-site, Four Days, 100% Salary",
      "AutoCAD, 3D-Modeling, Bluebeam, Microsoft-Office, Leadership",
      "Architecture, Design",
      "32"
    ],
    [
      "4727",
      "https://www.linkedin.com/jobs/view/architectural-residential-project-manager-at-bsb-design-3513224855",
      "BSB Design",
      "Architectural Residential Project Manager",
      "Los Angeles Metropolitan Area",
      "\u003ch2\u003eJob Description\u003c/h2\u003e\n\n\u003cp\u003eBSB has generated lasting impact across the country for more than 50 years! The foundation of BSB Design will always be our people, those who give their all to help generate success for our clients and our firm. We believe that by working together in an environment that promotes respect, opportunities for growth and fun, our employees are able to deliver their best every day. That is also why we have launched our FOUR-DAY WORK WEEK!\u003c/p\u003e\n\n\u003cp\u003eAs one of the largest architecture firms in the country, our designs impact tens of thousands of people. We are always looking for passionate professionals who aspire to make a difference.\u003c/p\u003e\n\n\u003cp\u003eWe strive to achieve two goals: Create success that builds a trusted partnership with our client, and positively impact the way people live, work and play. BSB Design is looking to hire a Residential Project Manager based out of our Torrance, CA office.\u003c/p\u003e\n\n\u003ch3\u003eJob Summary:\u003c/h3\u003e\n\n\u003cp\u003eProject Managers are responsible for guiding the overall management direction of existing and new projects. They also guide project planning, organizing and staffing by assigning key field positions through Drafts people, Job Captains, subordinate Project Managers and other staff as needed. Managers create the vital team environments that our projects thrive in. They also identify and address the ongoing needs and concerns of clients and work to successfully satisfy them.\u003c/p\u003e\n\n\u003ch3\u003eResponsibilities:\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eDirect all project communication including contracts, meetings, and contact with team members\u003c/li\u003e\n  \u003cli\u003ePrepare staffing requirements, schedules, budgets and fee projections\u003c/li\u003e\n  \u003cli\u003eCoordinate and supervise internal staff to meet established schedules and budgets as well as outside consultants\u003c/li\u003e\n  \u003cli\u003eVerify that all project work is done efficiently and in accordance with established office standards\u003c/li\u003e\n  \u003cli\u003eResearch and coordinate building systems, materials and products, governing codes and regulation\u003c/li\u003e\n  \u003cli\u003eCoordinate agency submittals and answer requests for information (RFI’s)\u003c/li\u003e\n  \u003cli\u003eReview shop drawing, material submittals, and construction pay authorizations\u003c/li\u003e\n  \u003cli\u003eAttend construction coordination meetings at project sites and prepare field reports\u003c/li\u003e\n  \u003cli\u003eMaintain a positive atmosphere, motivating employees and maintaining staff morale at a high level\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eSkill Sets:\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eLeadership, communication, marketing, negotiation, and problem-solving capabilities\u003c/li\u003e\n  \u003cli\u003eProficiency with Revit/BIM, Bluebeam\u003c/li\u003e\n  \u003cli\u003eComfortable handling a broad range of functions and maintaining multiple projects in parallel sequence\u003c/li\u003e\n  \u003cli\u003eAbility to problem solve construction- and design-related issues\u003c/li\u003e\n  \u003cli\u003eTechnical knowledge of high-density infill, Type V and Type III projects\u003c/li\u003e\n  \u003cli\u003eExtensive technical knowledge of building systems, codes, regulations and construction standards\u003c/li\u003e\n  \u003cli\u003eComprehensive knowledge of industry drawing standards and production techniques\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eEducation:\u003c/h3\u003e\n\n\u003cp\u003eBachelors of Architecture Degree or equivalent required\u003c/p\u003e\n\u003cp\u003eLicensed or actively pursuing registration preferred\u003c/p\u003e\n\u003cp\u003eThree to five years’ experience in assisting with all phases of a project.\u003c/p\u003e\n\n\u003cp\u003eBSB Design provides equal employment opportunities to all employees and applicants for employment without regard to race, color, ancestry, national origin, sex, sexual orientation, marital status, religion, age, disability, gender identity or expression, pregnancy, parenting status, results of genetic testing, service in the military or any other quality or characteristic protected by federal, state, or local law. Equal employment opportunity applies to all terms and conditions of employment, including hiring, placement, promotion, termination, layoff, recall, transfer, leave of absence, compensation, and training.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3513224855/",
      "North America",
      "On-site, Four Days, 100% Salary",
      "Revit, BIM, Bluebeam, Type-V, Type-III",
      "Architecture, Project Management",
      "32"
    ],
    [
      "3291",
      "https://nz.linkedin.com/jobs/view/seo-content-writer-at-pearl-lemon-group-3778265939",
      "Pearl Lemon Group",
      "SEO Content Writer",
      "New Zealand",
      "\u003ch2\u003eAbout Pearl Lemon\u003c/h2\u003e\n\n\u003cp\u003ePearl Lemon Group is a group of companies with a footprint in digital marketing, sales, food & beverage, game development, recruitment, accounting, consultancy, and more. Based in the heart of London and serving clients worldwide. With a team of 65+ dotted across the UK, USA, Spain, Egypt India, Pakistan, the Philippines, and more, we work like a silicon-valley-startup, 24/7, and have a work ethic comparable to investment bankers. It’s not a surprise when you consider their founder Deepak Shukla an ex-Deloitte consultant and 5x ultramarathon runner.\u003c/p\u003e\n\n\u003cp\u003eCheck out a lot of video and written testimonials of our team members as well as their weekly updates in the 'Blog' section and Apply Here - \u003ca href=\"https://pearllemonplacements.com/\"\u003ehttps://pearllemonplacements.com/\u003c/a\u003e\u003c/p\u003e\n\n\u003ch2\u003eBenefits Of Working With Pearl Lemon\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003eWork remotely and manage 100% of your time\u003c/li\u003e\n  \u003cli\u003eMassive career advancement is encouraged. The ability to do the job is all we care about\u003c/li\u003e\n  \u003cli\u003eSuccess will be rewarded with recognition [via monthly awards]\u003c/li\u003e\n  \u003cli\u003eOver 500 hours of pre-recorded training programs are available\u003c/li\u003e\n  \u003cli\u003eWork with TEDx speakers\u003c/li\u003e\n  \u003cli\u003eWork with a funded startup ($700k raised)\u003c/li\u003e\n  \u003cli\u003eGet Pearl Lemon University certifications\u003c/li\u003e\n  \u003cli\u003eLay a foundation for success with Pearl Lemon\u003c/li\u003e\n  \u003cli\u003eWe have clients from one-man bands to heavily funded startups to FTSE 100 companies and more\u003c/li\u003e\n  \u003cli\u003eWork with a team from over 15 countries, 3 offices, and multiple languages\u003c/li\u003e\n  \u003cli\u003eClients based all over the world\u003c/li\u003e\n  \u003cli\u003eHeavy on-the-job training given\u003c/li\u003e\n  \u003cli\u003eGet laptop upgrades and speed and productivity training as a standard\u003c/li\u003e\n  \u003cli\u003e75% of our leaders are promoted within and started in an entry-level position\u003c/li\u003e\n  \u003cli\u003eGoogle \"Pearl Lemon Placement Interviews\" to see what our team says about us\u003c/li\u003e\n  \u003cli\u003e4.6 star rating on Glassdoor from 84 write-ups\u003c/li\u003e\n  \u003cli\u003eMany of our team have said \"they have learned more with us in 3 months than their entire academic education\" or its equivalent to 2 years at other firms\u003c/li\u003e\n  \u003cli\u003e31% of FTSE 100 companies are led by CEOs who formerly occupied sales and marketing positions - so come learn sales and marketing with Pearl Lemon\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eThe Role\u003c/h2\u003e\n\n\u003cp\u003ePearl Lemon is looking for a highly motivated and driven person to help drive forward our ambitious growth plans throughout 2023 and beyond. You will be an important part of a tight-knit team who have a hands-on approach and are passionate about taking the business to the next level.\u003c/p\u003e\n\n\u003cp\u003eThe content writer is an integral part of our team. We are looking for someone who will help build out excellent content for our companies about our services.\u003c/p\u003e\n\n\u003cp\u003eWe are looking for someone who prides themselves on their speed of communication, attention to detail, and meticulous planning skills, but can adapt to change in a very fast-moving environment.\u003c/p\u003e\n\n\u003cp\u003eA strong understanding of digital marketing is essential, as are exceptional people and communication skills to help develop team members who you will manage directly.\u003c/p\u003e\n\n\u003ch3\u003ePOSSIBLE Responsibilities\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eProduce high-quality, engaging content for our company platforms, including blogs, articles, website pages, and social media.\u003c/li\u003e\n  \u003cli\u003eWriting new SEO-friendly copy for pages for Internal websites\u003c/li\u003e\n  \u003cli\u003eBlog writing and posting\u003c/li\u003e\n  \u003cli\u003eSubmit work to editors for input and approval.\u003c/li\u003e\n  \u003cli\u003eEnsure all-around consistency (style, fonts, images, and tone)\u003c/li\u003e\n  \u003cli\u003eUpdate website content as needed.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eIdeal Profile\u003c/h3\u003e\n\n\u003cp\u003eRequired Skills And Experience\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eWriting new SEO-friendly copy for pages for Internal websites\u003c/li\u003e\n  \u003cli\u003eBlog writing and posting\u003c/li\u003e\n  \u003cli\u003eExceptional communication skills, verbal and written.\u003c/li\u003e\n  \u003cli\u003eBeing punctual and quick to respond and communicate daily.\u003c/li\u003e\n  \u003cli\u003eExperience with WordPress and SEO\u003c/li\u003e\n  \u003cli\u003eProven people-management track record.\u003c/li\u003e\n  \u003cli\u003eIncredibly fast learner.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eWhat's on Offer?\u003c/p\u003e\n\n\u003cp\u003eMassive career advancement encouraged\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3778265939/",
      "Australia-Oceania",
      "Remote, 100% Salary, Four Days",
      "SEO, WordPress, Content-Writing, Digital-Marketing, People-Management",
      "Marketing, Writing",
      "32"
    ],
    [
      "3291",
      "https://nz.linkedin.com/jobs/view/head-of-accounting-at-pearl-lemon-group-3778268776",
      "Pearl Lemon Group",
      "Head of Accounting",
      "New Zealand",
      "\u003ch2\u003eAbout Pearl Lemon\u003c/h2\u003e\n\n\u003cp\u003ePearl Lemon Group is a group of companies with a footprint in digital marketing, sales, food & beverage, game development, recruitment, accounting, consultancy, and more. Based in the heart of London and serving clients worldwide. With a team of 65+ dotted across the UK, USA, Spain, Egypt India, Pakistan, the Philippines and more, we work like a silicon-valley-startup, 24/7 and have a work ethic comparable to investment bankers. It’s not a surprise when you consider their founder Deepak Shukla an ex-Deloitte consultant and 5x ultramarathon runner.\u003c/p\u003e\n\n\u003ch2\u003eBenefits of working with Pearl Lemon\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003eWork remotely and manage 100% of your time\u003c/li\u003e\n  \u003cli\u003eMassive career advancement is encouraged.\u003c/li\u003e\n  \u003cli\u003eThe ability to do the job is all we care about\u003c/li\u003e\n  \u003cli\u003eSuccess will be rewarded with recognition [via monthly awards]\u003c/li\u003e\n  \u003cli\u003eOver 500 hours of pre-recorded training programs are available\u003c/li\u003e\n  \u003cli\u003eWork with TEDx speakers\u003c/li\u003e\n  \u003cli\u003eWork with a funded startup ($700k raised)\u003c/li\u003e\n  \u003cli\u003eGet Pearl Lemon University certifications\u003c/li\u003e\n  \u003cli\u003eLay a foundation for success with Pearl Lemon\u003c/li\u003e\n  \u003cli\u003eWe have clients from one-man bands to heavily funded startups to FTSE 100 companies and more\u003c/li\u003e\n  \u003cli\u003eWork with a team from over 15 countries, 3 offices, and multiple languages\u003c/li\u003e\n  \u003cli\u003eClients based all over the world\u003c/li\u003e\n  \u003cli\u003eHeavy on-the-job training given\u003c/li\u003e\n  \u003cli\u003eGet laptop upgrades and speed and productivity training as a standard\u003c/li\u003e\n  \u003cli\u003e75% of our leaders are promoted within and started in an entry-level position\u003c/li\u003e\n  \u003cli\u003eGoogle \"Pearl Lemon Placement Interviews\" to see what our team says about us\u003c/li\u003e\n  \u003cli\u003e4.6 star rating on Glassdoor from 84 write-ups\u003c/li\u003e\n  \u003cli\u003eMany of our team have said \"they have learned more with us in 3 months than their entire academic education\" or its equivalent to 2 years at other firms\u003c/li\u003e\n  \u003cli\u003e31% of FTSE 100 companies are led by CEOs who formerly occupied sales and marketing positions - so come learn sales and marketing with Pearl Lemon\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eThe Role\u003c/h2\u003e\n\n\u003ch3\u003eThe Role\u003c/h3\u003e\n\n\u003cp\u003eWe are seeking an experienced and highly motivated Accounting Executive to join our Accounting team. The ideal candidate will be responsible for managing the company's financial operations, ensuring accurate financial reporting, and implementing effective accounting procedures. This role demands strong analytical skills, attention to detail, and the ability to thrive in a fast-paced environment.\u003c/p\u003e\n\n\u003ch3\u003ePOSSIBLE Responsibilities\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eResponds to financial inquiries by gathering, analyzing, summarizing, and interpreting data.\u003c/li\u003e\n  \u003cli\u003eAssist in the preparation of financial reports such as financial statements\u003c/li\u003e\n  \u003cli\u003eIdentify areas for improvement and implement improvements to processes\u003c/li\u003e\n  \u003cli\u003eProvide accurate, timely, and relevant recording, reporting, and analysis of financial information\u003c/li\u003e\n  \u003cli\u003eAccomplishes finance and organization mission by completing related results as needed.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eIdeal Profile\u003c/h3\u003e\n\n\u003ch4\u003eRequired Skills And Experience\u003c/h4\u003e\n\n\u003cul\u003e\n  \u003cli\u003eExcellent math skills\u003c/li\u003e\n  \u003cli\u003eExperienced in bookkeeping\u003c/li\u003e\n  \u003cli\u003eAbility to work under high-time pressure\u003c/li\u003e\n  \u003cli\u003eExperienced in MS Office\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eWhat's on Offer?\u003c/h2\u003e\n\n\u003cp\u003eMassive career advancement encouraged.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3778268776/",
      "Australia-Oceania",
      "Remote, 100% Salary, Four Days",
      "Bookkeeping, MS-Office, Financial-Reporting, Analytical-Skills, Time-Management",
      "Accounting & Finance, Administration & Facilities",
      "32"
    ],
    [
      "3291",
      "https://nz.linkedin.com/jobs/view/seo-expert-at-pearl-lemon-group-3778266949",
      "Pearl Lemon Group",
      "SEO Expert",
      "New Zealand",
      "\u003ch2\u003eAbout Pearl Lemon\u003c/h2\u003e\n\n\u003cp\u003ePearl Lemon Group is a group of companies with a footprint in digital marketing, sales, food & beverage, game development, recruitment, accounting, consultancy and more. Based in the heart of London and serving clients worldwide. With a team of 65+ dotted across the UK, USA, Spain, Egypt India, Pakistan, the Philippines and more, we work like a silicon-valley-startup, 24/7 and have a work ethic comparable to investment bankers. It’s not a surprise when you consider their founder Deepak Shukla is an ex-Deloitte consultant and 5x ultramarathon runner.\u003c/p\u003e\n\n\u003cp\u003eCheck out a lot of video and written testimonials of our team members as well as their weekly updates in the 'Blog' section and Apply Here - \u003ca href=\"https://pearllemonplacements.com/\"\u003ehttps://pearllemonplacements.com/\u003c/a\u003e\u003c/p\u003e\n\n\u003ch2\u003eBenefits Of Working With Pearl Lemon\u003c/h2\u003e\n\n\u003cul\u003e\n  \u003cli\u003eWork remotely and manage 100% of your time\u003c/li\u003e\n  \u003cli\u003eMassive career advancement is encouraged. The ability to do the job is all we care about\u003c/li\u003e\n  \u003cli\u003eSuccess will be rewarded with recognition [via monthly awards]\u003c/li\u003e\n  \u003cli\u003eOver 500 hours of pre-recorded training programs are available\u003c/li\u003e\n  \u003cli\u003eWork with TEDx speakers\u003c/li\u003e\n  \u003cli\u003eWork with a funded startup ($700k raised)\u003c/li\u003e\n  \u003cli\u003eGet Pearl Lemon University certifications\u003c/li\u003e\n  \u003cli\u003eLay a foundation for success with Pearl Lemon\u003c/li\u003e\n  \u003cli\u003eWe have clients from one-man bands to heavily funded startups to FTSE 100 companies and more\u003c/li\u003e\n  \u003cli\u003eWork with a team from over 15 countries, 3 offices, and multiple languages\u003c/li\u003e\n  \u003cli\u003eClients based all over the world\u003c/li\u003e\n  \u003cli\u003eHeavy on-the-job training given\u003c/li\u003e\n  \u003cli\u003eGet laptop upgrades and speed and productivity training as a standard\u003c/li\u003e\n  \u003cli\u003e75% of our leaders are promoted within and started in an entry-level position\u003c/li\u003e\n  \u003cli\u003eGoogle \"Pearl Lemon Placement Interviews\" to see what our team says about us\u003c/li\u003e\n  \u003cli\u003e4.6 star rating on Glassdoor from 84 write-ups\u003c/li\u003e\n  \u003cli\u003eMany of our team have said \"they have learned more with us in 3 months than their entire academic education\" or its equivalent to 2 years at other firms\u003c/li\u003e\n  \u003cli\u003e31% of FTSE 100 companies are led by CEOs who formerly occupied sales and marketing positions - so come learn sales and marketing with Pearl Lemon\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eThe Role\u003c/h2\u003e\n\n\u003ch3\u003eThe Role\u003c/h3\u003e\n\n\u003cp\u003ePearl Lemon is looking for an SEO expert to manage all search engine optimization and marketing activities.\u003c/p\u003e\n\n\u003cp\u003eYou will be responsible for managing all SEO activities such as content strategy, link building, and keyword strategy to increase rankings on all major search networks.\u003c/p\u003e\n\n\u003ch3\u003ePOSSIBLE Responsibilities\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eOptimizing copy and landing pages for search engine optimization\u003c/li\u003e\n  \u003cli\u003ePerforming ongoing keyword research including discovery and expansion of keyword opportunities\u003c/li\u003e\n  \u003cli\u003eResearching and implementing content recommendations for organic SEO success\u003c/li\u003e\n  \u003cli\u003eExecute tests, collect and analyze data and results, identify trends and insights to achieve maximum ROI in paid search campaigns\u003c/li\u003e\n  \u003cli\u003eManage campaign expenses, stay on budget, estimate monthly costs, and reconcile discrepancies.\u003c/li\u003e\n  \u003cli\u003eOptimize copy and landing pages for search engine marketing\u003c/li\u003e\n  \u003cli\u003ePerform ongoing keyword discovery, expansion, and optimization\u003c/li\u003e\n  \u003cli\u003eResearch and implement search engine optimization recommendations\u003c/li\u003e\n  \u003cli\u003eResearch and analyze competitor advertising links\u003c/li\u003e\n  \u003cli\u003eDevelop and implement a link-building strategy\u003c/li\u003e\n  \u003cli\u003eWork with the development team to ensure SEO best practices are properly implemented on newly developed code\u003c/li\u003e\n  \u003cli\u003eWork with editorial and marketing teams to drive SEO in content creation and content programming\u003c/li\u003e\n  \u003cli\u003eRecommend changes to website architecture, content, linking, and other factors to improve SEO positions for target keywords\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eIdeal Profile\u003c/h2\u003e\n\n\u003ch3\u003eRequired Skills And Experience\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eProven SEO experience\u003c/li\u003e\n  \u003cli\u003eSolid understanding of performance marketing, conversion, and online customer acquisition\u003c/li\u003e\n  \u003cli\u003eIn-depth experience with website analytics tools (e.g, Google Analytics, NetInsight, Omniture, WebTrends)\u003c/li\u003e\n  \u003cli\u003eExperience with A/B and multivariate experiments\u003c/li\u003e\n  \u003cli\u003eWorking knowledge of HTML, CSS, and JavaScript development and constraints\u003c/li\u003e\n  \u003cli\u003eKnowledge of ranking factors and search engine algorithms\u003c/li\u003e\n  \u003cli\u003eUp-to-date with the latest trends and best practices in SEO\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eWhat's on Offer?\u003c/h2\u003e\n\n\u003cp\u003eMassive career advancement is encouraged.\u003c/p\u003e",
      "https://www.linkedin.com/jobs/view/3778266949/",
      "Australia-Oceania",
      "Remote, 100% Salary, Four Days",
      "SEO, Google Analytics, HTML, Link Building, Keyword Research",
      "Marketing",
      "32"
    ],
    [
      "3297",
      "https://at.linkedin.com/jobs/view/senior-product-owner-manager-at-tractive-3767955194",
      "Tractive",
      "Senior Product Owner/Manager",
      "Linz, Upper Austria, Austria",
      "\u003ch2\u003eYour territory\u003c/h2\u003e\n\n\u003cp\u003eAs a connection between our teams, you will:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eDefine new and innovative products and cross-cutting features to help dogs, cats, and pet parents worldwide\u003c/li\u003e\n  \u003cli\u003eResearch, define concepts, document product requirements, provide written business requirements and user stories as needed, expected impact, risk, business-value assessment, etc.\u003c/li\u003e\n  \u003cli\u003eManage initiatives on a company level and break them down into work packages oriented toward team development\u003c/li\u003e\n  \u003cli\u003ePrioritize backlog items according to their user and business values in collaboration with engineering team members. Provide support throughout the development of these backlogged items\u003c/li\u003e\n  \u003cli\u003eMonitor the performance of our products and correlate that with desired business and user outcomes\u003c/li\u003e\n  \u003cli\u003eAnalyze qualitative and quantitative data to identify opportunities for improvement of our products and services\u003c/li\u003e\n  \u003cli\u003eBring in your fresh ideas to make Tractive better - you’ll never hear the phrase “...because that’s how we’ve always done things”\u003c/li\u003e\n  \u003cli\u003eContinuously grow personally and professionally, take ownership of areas that show your potential, and attend workshops which help you get to the next level\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003eYour Profile\u003c/h2\u003e\n\n\u003ch3\u003eKey requirements\u003c/h3\u003e\n\n\u003cul\u003e\n  \u003cli\u003eMinimum 3-5 years of product ownership / product management experience\u003c/li\u003e\n  \u003cli\u003eTechnical education and proven experience in driving software development projects\u003c/li\u003e\n  \u003cli\u003eExperience with and solid knowledge of digital products\u003c/li\u003e\n  \u003cli\u003eStrong analytical skills and a data-driven approach\u003c/li\u003e\n  \u003cli\u003eVery good English skills\u003c/li\u003e\n  \u003cli\u003eA passion for the latest in (pet) tech\u003c/li\u003e\n  \u003cli\u003ePrior experience in software development a strong plus\u003c/li\u003e\n  \u003cli\u003eValid Austrian work permit!\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDoes this sound like you?\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eA driven, decisive doer\u003c/li\u003e\n  \u003cli\u003eGood at breaking down (and solving) complex problems\u003c/li\u003e\n  \u003cli\u003eBig picture thinker with an eye for detail\u003c/li\u003e\n  \u003cli\u003eWorks well solo and with a team\u003c/li\u003e\n  \u003cli\u003eWilling to come and work with our fantastic team in Austria\u003c/li\u003e\n\u003c/ul\u003e",
      "https://tractive.com/en/jd/senior-product-owner-manager",
      "Europe",
      "Hybrid, 100% Salary, Four Days",
      "Product Management, Software Development, Data Analysis, Digital Products, Agile Methodology",
      "Product, Project Management",
      "35"
    ]
  ]
}
