[{"page": 0, "page_count": 15677, "items_per_page": 20, "took": 19, "timed_out": false, "total": 313522, "results": [{"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-08T12:01:41Z", "short_name": "pharmacy-technician-3aa6cd", "model_type": "jobs", "id": 14102864, "locations": [{"name": "Memphis, TN"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-3aa6cd"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>This position provides an opportunity, in a leading retail pharmacy setting, to excel in a complex, high-impact, patient-focused role and positively impact the lives of others. Pharmacy Technician, FSS colleagues must ensure that they can serve the healthcare needs of our patients, as well as satisfy all regulatory compliance standard requirements. They must demonstrate ethical conduct and always maintain patient confidentiality. Successful Pharmacy Technician, FSS colleagues must be able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions while also providing caring service that exceeds customer expectations. Front Store Supervisor (FSS) duties that may be performed by the Pharmacy Technician, FSS are key to supporting the CVS Store team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. The Pharmacy Technician, FSS supports, as needed, leading the front store staff, ensuring that store operations run smoothly, and is responsible for completing all opening and closing procedures, as applicable. Responsibilities include:<ul><li>Living our purpose of \"Bringing our Heart to Every Moment of Your Health\" by engaging with customers, in-person and over the phone, to help manage and improve patient health. Always focusing on the needs of the customer and displaying genuine care and empathy in all interactions. Ensuring customer satisfaction and educating customers about our service and product offerings to help them make the healthiest choices and decisions for themselves.</li><li>Demonstrating compassion and care by proactively identifying and resolving potential problems to ensure customers have their medications when needed; collaborating with the pharmacy team in their store and other pharmacy teams in their market, as needed, medical staff, insurance companies, and customers to resolve issues, ensure accuracy, and deliver timely resolution of any medication or insurance concerns.</li><li>Effectively following pharmacy workflow procedures with an in-depth understanding of each workstation (i.e., production, pick-up, drive-thru, and drop-off) for safe and accurate prescription fulfillment; delivering results while balancing quality and efficiency in all tasks; embracing agility to manage all workstation responsibilities while reprioritizing to help customers and the team when needed.</li><li>Following basic inventory management policies and procedures as permitted by law and as directed by the pharmacy leadership team, such as accurately putting away warehouse and vendor drug deliveries, completing cycle counts, returns-to-stock, waiting bin inventories, etc.</li><li>Contributing to a high-performing team; embracing a growth mindset and being receptive to feedback and continuous improvement efforts; remaining flexible and opening availability to help meet scheduling and business needs while contributing to a safe, inclusive, and engaging team dynamic; actively seeking opportunities to expand clinical, technical, and insurance knowledge needed to assist customers accurately and more effectively.</li><li>Understanding and following applicable Federal and State laws (e.g., HIPAA), regulations (e.g., OSHA), professional standards, and ethical principles; complying with CVS policies and procedures to ensure and protect patient safety, privacy and security. Where allowable by law and supported by required training and certification, deliver additional patient health care services to support the health and wellness of the community, including, but not limited to point-of-care testing and offsite clinics. Essential Front Store Supervisor (FSS) Functions:</li><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities (i.e. receiving/unloading delivery truck, daily/weekly tasks, etc.)</li><li>Effectively communicate information both to and from store management and crews</li><li>Assist customers with their questions, problems and complaints; escalating to Store, Pharmacy Manager or Tech Team Leader where necessary</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers by promoting the use of assisted/self-service checkout or loyalty programs such as ExtraCare or Carepass.</li><li>Accurately and timely pricing of merchandise</li><li>Ensure placement of product on-shelf using CFR best practices consistently</li><li>Execute the displays, signing and inventory of weekly, promotional, and seasonal merchandise</li><li>Reset departments following planogram schedule and Store Manager (SM) direction</li><li>Appropriate usage of register and door keys, alarm codes, and safe combinations. Execute locking of safe and security doors and setting of alarms when closing the store. Complete random cash verifications as instructed by SM/District AP leader</li><li>Identify and react to shoplifters following Company policies and procedures to ensure colleague and customer safety</li><li>Administer, monitor, and react to Asset Protection programs and systems: employee bag checks; lockers secured; receipts for purchases; and ensure price accuracy</li><li>Perform applicable manager overrides on POS/Smart system in accordance to Company policies/procedures; seek Manager guidance or support as needed</li><li><b>Required Qualifications</b><ul><li>0-3 years prior relevant work experience</li><li>Must be at least 18 years of age</li><li>High school diploma or General Equivalent Degree (GED) required</li><li>State-level licensure and national certification Pharmacy Technician requirements vary by state.</li><li>Regular and reliable attendance</li><li>Attention and Focus: o Ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service and Team Orientation: o Actively look for ways to help people, and do so in a friendly manner o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills: o Use and understand verbal and written communication to interact with patients, customers and colleagues o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning: o Ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution: o Ability to judge when something is wrong or is likely to go wrong; recognizing there is a problem o Choosing the best course of action when faced with a complex situation with several available options</li><li>Physical Demands: o Remaining upright on the feet, particularly for sustained periods of time o Moving about on foot to accomplish tasks, particularly for moving from one work area to another, including outside of the pharmacy area o Lifting, scanning, and bagging purchased items o Finger Dexterity: Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm o Reaching overhead; able to stretch or reach out with the body, arms, and/or legs to grasp items o Extending hand(s) and arm(s) multiple directions to place, move, or lift items o Precision control: able to adjust machines to exact positions o Stooping to a considerable degree and requiring full use of the lower extremities and back muscles to move items between low and high positions, including bending spine at the waist o Visual Acuity: Close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts o Able to orally communicate information and instructions to colleagues and customers o Occasional lifting of up to 30 lbs,; exerting up to 30 lbs. of force occasionally and/or up to 10 lbs. of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>3-5 years prior relevant work experience</li><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a front store supervisor</li><li>Ability to work in the home store and across the market in other locations to meet business needs</li></ul><b>Education</b><ul><li>High School Diploma or General Equivalent Development (GED) - Required</li><li>Other Certification(s): Requirements vary by state - Preferred</li><li>Other License(s): Requirements vary by state - Required</li></ul></li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Tech", "type": "external", "publication_date": "2024-03-08T12:20:22Z", "short_name": "pharmacy-tech-bfa1de", "model_type": "jobs", "id": 12629277, "locations": [{"name": "Hutto, TX"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-tech-bfa1de"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-08T12:15:29Z", "short_name": "shift-supervisor-trainee-03bfc3", "model_type": "jobs", "id": 13190254, "locations": [{"name": "Raleigh, NC"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-03bfc3"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><b>Job Description:</b><br><br>As a Advisor Development Program Financial Solutions Advisor Stage I (ADP FSA I), your journey begins obtaining your Securities Industry licenses, where you receive dedicated and personalized classes for your Securities Industry Essentials [SIE], Series 7 and Series 66 Exams. Once you obtain your licenses, you will be taught the foundational skills needed to be an advisor - from acquiring, building and managing client relationships to considering a client's complex financial picture and guiding them with advice and solutions to help them live their best financial lives, all while humanizing financial interactions. Once you have reached your key milestones, you will begin working in a financial center where you will help to deliver Bank of America's core banking, investment solutions and approach to client care. We will equip you with everything you need as you move through the stages of development.<br> <br>Once you have demonstrated success as a licensed ADP Financial Solutions Advisor Stage I, you will typically progress into the next role, ADP Financial Solutions Advisor Stage II, where you will continue to practice the skills you've learned by growing and deepening relationships within a portfolio of clients. As a successful ADP Financial Solutions Advisor Stage II, you will have the opportunity to advance in many roles within Bank of America and Merrill. The Academy will support you along the way with dedicated programs, tools and resources throughout your career journey.<br><br>This position is subject to SAFE Act registration requirements. Pursuant to the SAFE Act requirements, all employees engaged in residential loan mortgage originations must register with the federal registry system and remain in good standing. Since your position requires SAFE Act registration, you will be required to register and to submit to the required SAFE Act background check and registration process. Failure to obtain and/or maintain SAFE Act registration may result in your immediate termination.<br><br>Required skills:<br>•  Sets and accomplishes goals, achieving whatever you put your mind to.<br>•  Is comfortable in a sales role, finding ways to nurture strong relationships with prospective clients.<br>•  Communicates clearly and confidently with clients from all walks of life.<br>•  Works well with others and collaborates productively to get things done.<br>•  Can manage complexity, prioritize tasks and execute in a fast-paced environment.<br>•  Likes to learn on your feet, adapting to new information and seeking the right solutions for clients.<br>•  Efficiently manages your time and capacity.<br>•  Is thorough and will incorporate relevant regulatory due diligence into daily to-do's and long-term strategies for clients.<br><br>Desired skills:<br>•  Strong computer skills with an ability to multitask in a demanding environment.<br>•  A bachelor's degree, or 1-2 years' experience working in the financial service industry and/or a sales environment where goals were met or exceeded.<br>•  Experience assessing client needs, identifying/recommending solutions, and building/managing client relationships.<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>", "name": "Advisor Development Program - Financial Solutions Advisor Trainee - Montecito Financial Center - Santa Barbara, CA", "type": "external", "publication_date": "2024-02-03T23:27:22Z", "short_name": "advisor-development-program-financial-solutions-advisor-trainee-montecito-financial-center-santa-barbara-ca-2359c3", "model_type": "jobs", "id": 13920607, "locations": [{"name": "Santa Barbara, CA"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/bankofamerica/advisor-development-program-financial-solutions-advisor-trainee-montecito-financial-center-santa-barbara-ca-2359c3"}, "company": {"id": 12145, "short_name": "bankofamerica", "name": "Bank of America"}}, {"contents": "<p>Siemens Mobility Portugal is looking for an experiencedSenior Software Architect to join our architecture team for RealtimeDispatching Systems. In this role, your key responsibilities will be:<br><br><ul><li>Design and develop of software architecture fornew and existing products</li><li>Collaborate with cross-functional teams,including product management and agile development teams, to gatherrequirements, create technical specifications, and specify technical solutionsfor new requirements and product features</li><li>Break down solutions for implementation indevelopment teams, providing guidance and coaching</li><li>Document and maintain the technical productarchitecture</li><li>Coordinate and monitor the implementation ofarchitecture activities across product and project boundaries</li><li>Mentor and guide team members in software design anddevelopment best practices</li><li>Ensure that software code meets quality standards, includingperformance, security, and reliability</li><li>Stay up to date with industry trends and newtechnologies, continuously improving software design and development processes</li><li>Contribute to a healthy and collaborative teamspirit within the large, interdisciplinary product teams based in Aveiro and Hanover(Germany) as well as other Siemens Mobility's locations worldwide.</li></ul><br>Requirements:<br><br><ul><li>Abachelor's degree in Computer Science or a related field</li><li>Atleast 6 years of experience in software design and development</li><li>Experienceas a software architect, preferably with certification according to iSAQB orsimilar</li><li>Proficiency in at least one OOP programminglanguage, such as C++ or Java, with a strong understanding of OOP and softwaredesign patterns</li><li>Experience designing and implementingmulti-tier and distributed component/service architectures, as well as workingwith cloud technologies</li><li>Knowledgein Continuous Integration/Delivery practices and tools</li><li>Excellent communication and moderation skillsin English, with the ability to produce high quality written documentation</li><li>A solution-oriented and independent workingstyle, with the ability to mentor and guide other team members</li></ul><br>If you are an experienced software architect with apassion for solving complex problems and building scalable and reliablesoftware solutions, we encourage you to apply by submitting your resume.<br><br><b>Organization:</b> Siemens Mobility<br><br><b>Company:</b> SIEMENS MOBILITY, UNIPESSOAL LDA<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Senior Software Architect(m/f/d)", "type": "external", "publication_date": "2023-01-03T23:34:15Z", "short_name": "senior-software-architectmfd", "model_type": "jobs", "id": 10654819, "locations": [{"name": "Aveiro, Portugal"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/senior-software-architectmfd"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $19.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-08T12:18:02Z", "short_name": "store-associate-7cab92", "model_type": "jobs", "id": 12826355, "locations": [{"name": "Key West, FL"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-7cab92"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions. As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li></li><li><b>Required Qualifications</b><br>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Free of pending felony charges or convictions for criminal offenses involving controlled substances</li><li></li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60.00 - $73.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Staff Pharmacist", "type": "external", "publication_date": "2024-03-08T12:01:43Z", "short_name": "staff-pharmacist-4418ea", "model_type": "jobs", "id": 13958459, "locations": [{"name": "Reno, NV"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/staff-pharmacist-4418ea"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-08T12:21:56Z", "short_name": "pharmacy-technician-6a4a4d", "model_type": "jobs", "id": 12335299, "locations": [{"name": "Ridgefield, CT"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-6a4a4d"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<div>AB Tasty is a global leader in AI-powered experience optimization solutions empowering brands using personalization, experimentation, recommendations, and search to build better experiences on their websites and apps. Integrated into a single platform, AB Tasty offers web and API-based solutions that provide companies with a unified approach to creating seamless experiences for customers.</div>\n\n<div><br></div>\n\n<div>Brands use AB Tasty’s platform to align digital, e-commerce, and product teams on revenue goals by optimizing and innovating digital experiences.</div>\n\n<div><br></div>\n\n<div>Founded in 2013, AB Tasty’s customer roster includes world-leading brands such as Kering, McDonald’s, Ulta Beauty, L’Oreal, Disneyland Paris, and LVMH among others.</div>\n\n<div>AB Tasty has 12 offices across the globe: North America, Europe, Asia Pacific</div>\n\n<div><br></div>\n\n<div><span>We are looking for our new Team Leader for our Core Interface team ! At AB Tasty, a squad is an agile and autonomous team, of about 6 people, with all the necessary skills for the development of new functionalities: front-end developers (JavaScript / React), back-developer (PHP Symfony), UX Designer, Product Manager, QA Engineer.</span></div>\n\n<div><br></div>\n\n<div><span>The Core Interface team is responsible for the quality of the interface layers of Client Side and Server-side &amp; Rollout Platform, as well as designing the next interface that merges all features from all our products.</span></div>\n\n<div><br></div>\n\n<div><span>The Team Leader of Core Interface team refers to the Head of Core Platform.</span></div>\n\n<p><strong>Contract &amp; Location</strong><ul><li>Permanent full-time contract</li><li>Paris or Nantes Office</li><li>Smooth remote work policy (up to 3 days a week)</li></ul></p>\n<p><strong>A few examples of your responsibilities:</strong><ul><li>Manage a team of data and backend engineers, both on-site and remotely.</li><li>Be responsible for the team's project management (scrum mastering, planning, follow-up).</li><li>Represent the team to other members of the company.</li><li>Collaborate with internal teams and help them define their needs.</li><li>Guarantee the stability and quality of projects for which the team is responsible.</li><li>Communicate successes and problems encountered to management and internal teams </li><li>Participate in feature development and bug resolution</li></ul></p>\n<p><strong>What we offer:</strong><ul><li><b>Huge impact. </b>AB Tasty is only as great as our team. By directly developing the publicly accessible SaaS platform used by all our clients, you’ll have a direct impact on the company’s success.</li><li><b>The opportunity to unleash your creativity.</b> You’ll be free to contribute to the processes, the tools and the organisation of the team, according the agile principles.</li><li><b>No micromanaging.</b> Be the owner of your effort - you’ll be one of the team and fully  trusted to take responsibility for your tasks. You’ll have every  incentive to make a real impact.</li><li><b>International reach.</b> Our audience is wildly international, and our team is too. Although our HQ is located in France, our company language is English.</li><li><b>Continuous education. </b>We offer many opportunities for each employee to learn and grow from a mix of professional and non professional topics.</li><li><b>Unique career opportunity. </b>By joining a fast-growing company that’s making waves in the tech industry, you’ll have a wonderful chance to enhance your learning and advance in your career faster than you ever thought possible.</li><li><b>Lots. Of. Fun. </b>Our incredible magic makers organize awesome events, such as team games, drinks, yoga classes, parties, and a company-wide retreat every year with employees from all countries gathering for 2 days of fun.</li><li><b>Remote working, flexible schedule. </b>This isn’t a “clock in, clock out” company. We care about your productivity,  not tracking every minute you’re on site. It’s up to you to always be responsible for your work, no matter where you are or what schedule you’re keeping.</li><li><b>Time for yourself.</b> After a year within AB Tasty, we offer you a day off during which we simply ask you to think  about your career expectations with us. It's not always easy to find time for introspection and to envision what path can lead us to a happy career so we offer a Retreat Day as an opportunity to reflect on that. We not only aim to succeed, but also to make you succeed.</li></ul></p>\n<p><strong>What we're looking for:</strong><ul><li>You are able to think \"outside the box\" while identifying problems and developing creative and innovative solutions</li><li>You have at least 3 years of experience as Front-End and / or Backend developper.</li><li>You have management experience even on a small scale in your previous experience(s)</li><li>You are sensitive to clients feedback, user experience, and you are aligned with one our main value “client satisfaction”</li><li>You have a good level of English (spoken and written)</li></ul></p>", "name": "Technical Team Leader - Core Team", "type": "external", "publication_date": "2024-01-15T23:04:50Z", "short_name": "technical-team-leader-core-team", "model_type": "jobs", "id": 13681803, "locations": [{"name": "Paris, France"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/abtasty/technical-team-leader-core-team"}, "company": {"id": 11719, "short_name": "abtasty", "name": "AB Tasty"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $18.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-08T12:08:00Z", "short_name": "shift-supervisor-trainee-33f48e", "model_type": "jobs", "id": 13800309, "locations": [{"name": "Long Branch, TX"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-33f48e"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Operations Manager is a member of the Store Management team, and as such, fulfills the company purpose of helping people on their path to better health by driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. Under the supervision of the Store Manager, the Operations Manager will maintain an engaged, productive store team through strong leadership, demonstrating initiative and leading by example.<br><br>The Operations Manager is responsible for supporting the Store Manager in the total leadership and strategic operation of a CVS/pharmacy store including:<ul><li>Overall store management, supervision, and policy implementation</li><li>Sales and inventory management</li><li>Employee staffing, training, and development</li><li>Financial management</li><li>Customer service leadership</li></ul>Unlike the Store Manager in Training position, the Operations Manager position is not part of the CVS/pharmacy Retail Management Development Program. Operations Managers are not eligible for direct promotion to Store Manager. Candidates with a short-term goal of becoming a CVS Store Manager should instead apply for Store Manager in Training openings.<br><br>Essential Functions:<br><br>1. Management<br><br>Lead others and work effectively with store crews<br><br>Supervise, assign and direct activities of the store's crew<br><br>Effectively communicate information to store crew and supervisors in an open and timely manner<br><br>Support Store Manager with actions plans for operational and service improvement<br><br>2. Customer Service<br><br>Assist customers with their questions, problems and complaints<br><br>Promote CVS customer service culture (greet, offer help, and thank)<br><br><b>Required Qualifications</b><ul><li>Deductive reasoning ability, advanced analytical skills and computer skills.</li><li>Advanced communication skills, leadership, supervision, and influencing skill</li><li>Ability to work a full-time flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed, and to respond to urgent issues at the store when they arise</li></ul><b>Preferred Qualifications</b><ul><li>Experience as a retail manager or supervisor</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$17.00 - $25.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Operations Manager", "type": "external", "publication_date": "2024-03-08T12:01:41Z", "short_name": "operations-manager-bf323b", "model_type": "jobs", "id": 14102702, "locations": [{"name": "O'Fallon, MO"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/operations-manager-bf323b"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Art der Anstellung: </strong>Befristet; 15-20h /Woche<br> <br><strong>Deine Extraportion Praxis.</strong><br><br>Wie werden wir uns übermorgen fortbewegen, miteinander kommunizieren, Energien nutzen? Lass uns gemeinsam an den Antworten arbeiten. Wir suchen dafür kluge Köpfe, die Theorie in Praxis umwandeln und clever mitdenken. Kurz: Menschen, die ihre und unsere Fragen in neue Ausrufezeichen verwandeln wollen! Als Werkstudent*in stehen dir bei uns viele Türen offen, um dich einzubringen: Ergreife die Chance und werde Teil unseres weltweiten Netzwerks, knüpfe wichtige Kontakte und lege so den Grundstein für deine berufliche und persönliche Zukunft. Unsere Teams freuen sich auf dich.<br><br>CF F Trade Finance Advisory (TFA) hat als Governance Owner für Trade Finance innerhalb von Siemens die Aufgabe, einen effektiven und effizienten Risikorahmen für das Trade Finance Geschäft von Siemens zu schaffen und die mit Garantien, Akkreditiven und Treuhandkonten verbundenen Risiken zu verwalten.<br><br>TFA Global Coordination and Development (GCD) analysiert und optimiert kontinuierlich das globale Trade Finance Setup, alle Prozesse und die dazugehörige IT-Landschaft mit einem starken Fokus auf Prozesseffizienz, Standardisierung, Automatisierung und Digitalisierung. GCD unterstützt den Global Head of TFA bei der Entwicklung und Umsetzung einer globalen TFA-Strategie sowie bei der Konzeption und Umsetzung von strategischen Projekten. GCD ist außerdem für die Koordination der globalen Trade Finance Organisation und die Konzeption und Umsetzung eines Kommunikationskonzepts für die internen und externen Stakeholder von TFA verantwortlich.<br> <br><strong>Wir setzen um, worauf es ankommt. Das ist dein Beitrag.</strong><br><br><ul><li>Du unterstützt den Bereich Trade Finance bei der Entwicklung und Umsetzung eines internen als auch externen Kommunikationskonzeptes</li><li>Du übernimmst IT-Administrationsaufgaben für Chatbots</li><li>Du pflegst bestehende und neue Intranetseiten (Sharepoint)</li><li>Du hilfst uns, indem du Texte für interne und externe Kanäle, u.a. für unsere Social Media Auftritte oder Online-Nachrichten schreibst</li><li>Du unterstützt uns der bei Recherche und Dokumentation verschiedener Themen im Bereich Trade Finance und Digitalisierung</li><li>Du arbeitest bei der Erstellung und Aktualisierung von Präsentationen, Templates, Learning Videos, Tutorials, etc. mit</li><li>Du unterstützt bei der Entwicklung von Konzepten für interne und externe Events und erstellst aussagekräftige Präsentationen</li></ul><br><strong>Wir suchen keine Superhelden. Sondern super helle Köpfe.</strong><br><br><ul><li>Du studierst an einer Hochschule in der Fachrichtung Betriebswirtschaftslehre, Medien- oder Kommunikationswissenschaft oder eine vergleichbare Studienrichtung mit dem Schwerpunkt Kommunikation oder Finanzierung und stehst uns in Erlangen oder München für 15 - 20 h / Woche zur Verfügung</li><li>Außerdem begeisterst du dich für die Themen Finanzen, Kommunikation und Digitalisierung</li><li>Idealerweise konntest du schon erste Erfahrungen im redaktionellen Umfeld oder in den Bereichen Kommunikation, Internet, Intranet, Social Media, Analytics und Erstellung von Medien (z.B. Videos, Infografiken) sammeln</li><li>Du hast Spaß daran, Veranstaltungen zu organisieren und bringst Organisations- und Kommunikationsgeschick mit</li><li>Du punktest mit Praxiserfahrung in den MS-Office-Anwendungen, Newsletter-Tools und / oder Analytics Anwendungen</li><li>Erfahrungen mit Film-Bearbeitungs-Software wie Camtasia o.ä. sind ein Plus</li><li>Deine fließenden Deutsch- und Englischkenntnisse wendest du auch im internationalen Kontext souverän an</li></ul><br><strong>Gesucht: Mitgestalter von morgen.</strong><br> <br><strong>www.siemens.de</strong><br><br>wenn du vor deiner Bewerbung mehr über Siemens erfahren möchtest.<br><br>Du hast Fragen zur Bewerbung? <strong>Hier</strong> findest du Antworten auf häufig gestellte Fragen.<br><br>Wenn du darüber hinaus noch Fragen hast, wende dich gerne an uns: www.siemens.de/fragenzurbewerbung<br><strong>www.siemens.de/karriere</strong><br>wenn du mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchtest.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br><b>Organization:</b> Controlling and Finance<br><br><b>Company:</b> Siemens AG<br><br><b>Experience Level:</b> Student (Not Yet Graduated)<br><br><b>Full / Part time:</b> Part-time</p>", "name": "Werkstudent*in (w/m/d) im Bereich Finance - Strategic Development and Communication - Trade Finance", "type": "external", "publication_date": "2022-12-16T23:39:03Z", "short_name": "werkstudentin-wmd-im-bereich-finance-strategic-development-and-communication-trade-finance-e0c555", "model_type": "jobs", "id": 10591478, "locations": [{"name": "Erlangen, Germany"}], "categories": [{"name": "Accounting and Finance"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/werkstudentin-wmd-im-bereich-finance-strategic-development-and-communication-trade-finance-e0c555"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-08T12:20:25Z", "short_name": "pharmacy-technician-ca640c", "model_type": "jobs", "id": 12383011, "locations": [{"name": "Richmond, VA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-ca640c"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary:<br>Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions.<br>As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management<br><br>A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li></li><li><b>Required Qualifications</b><br>Minimum Required Qualifications</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (e.g., APhA)</li><li>No pending felony charges or convictions for criminal offenses involving controlled substances</li><li></li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60.00 - $73.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Staff Pharmacist FT", "type": "external", "publication_date": "2024-03-08T11:57:54Z", "short_name": "staff-pharmacist-ft-9d6a2f", "model_type": "jobs", "id": 14101183, "locations": [{"name": "Sarasota, FL"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/staff-pharmacist-ft-9d6a2f"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Art der Anstellung: </strong>Befristet; 15-20 Stunden/Woche<br> <br><strong>Deine Extraportion Praxis.</strong><br><br>Wie werden wir uns übermorgen fortbewegen, miteinander kommunizieren, Energien nutzen? Lass uns gemeinsam an den Antworten arbeiten. Wir suchen dafür kluge Köpfe, die Theorie in Praxis umwandeln und clever mitdenken. Kurz: Menschen, die ihre und unsere Fragen in neue Ausrufezeichen verwandeln wollen! Als Werkstudent*in stehen dir bei uns viele Türen offen, um dich einzubringen: Ergreife die Chance und werde Teil unseres weltweiten Netzwerks, knüpfe wichtige Kontakte und lege so den Grundstein für deine berufliche und persönliche Zukunft. Unsere Teams freuen sich auf dich.<br><br><strong>Wir setzen um, worauf es ankommt. Das ist dein Beitrag.</strong><br><br><ul><li>Du unterstützt unser Innovation Excellence Expertenteam bei dem Aufbau und Pflege des Foresight Prozesses</li><li>Auch beim Trend Monitoring verlassen wir uns auf deine tatkräftige Mitarbeit</li><li>Darüber hinaus wirst du bei der Vor- und Nachbereitung von Experteninterviews und -Workshops eingebunden</li><li>Die Unterstützung bei der Vorbereitung von Strategieunterlagen und Zukunftsszenarien stellt ein weiteres spannendes Aufgabenfeld dar</li></ul><br><strong>Was du können solltest. Damit die Welt mehr kann.</strong><br><br><ul><li>Derzeit befindest du dich in einem fortgeschrittenen Bachelor- oder Masterstudium der Fachrichtung Wirtschaftsingenieurwesen o.Ä. und hast idealerweise deinen Schwerpunkt im Bereich Technologie- und Innovationsmanagement gewählt</li><li>Du konntest bereits erste praktische Erfahrungen mit Strategieprojekten (z.B. Portfolioanalyse, Marktsegmentierung, Foresighting) sammeln und bist motiviert, diese bei uns einzubringen und zu vertiefen</li><li>Kenntnisse und praktisches Know-how im Innovationsmanagement stechen in deinem Profil positiv hervor</li><li>An neue Themenfelder und Aufgabengebiete gehst du mit strategischem Denken, Kreativität und Lösungsorientierung heran</li><li>Ausgeprägte Kommunikations- und Teamfähigkeit sowie Planungs- und Organisationsgeschick zählen zu deinen Stärken</li><li>Du arbeitest eigenverantwortlich und strukturiert und punktest mit einer schnellen Auffassungsgabe</li><li>Fließende Deutsch- und Englischkenntnisse runden dein Profil ab</li></ul><br><strong>Wir wollen, dass du willst: Bewirb dich! </strong><br><br><strong>www.siemens.de</strong><br><br>wenn du vor deiner Bewerbung mehr über Siemens erfahren möchtest.<br><br>Du hast Fragen zur Bewerbung? <strong>Hier</strong> findest du Antworten auf häufig gestellte Fragen.<br><br>Wenn du darüber hinaus noch Fragen hast, wende dich gerne an uns: www.siemens.de/fragenzurbewerbung<br> <strong>www.siemens.de/karriere</strong><br> wenn du mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchtest.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens AG<br><br><b>Experience Level:</b> Student (Not Yet Graduated)<br><br><b>Full / Part time:</b> Part-time</p>", "name": "Werkstudent*in (w/m/d) Innovation Excellence mit Fokus auf Strategic Foresight", "type": "external", "publication_date": "2023-05-02T23:41:08Z", "short_name": "werkstudentin-wmd-innovation-excellence-mit-fokus-auf-strategic-foresight-079480", "model_type": "jobs", "id": 10767265, "locations": [{"name": "Nürnberg, Germany"}], "categories": [{"name": "Unknown"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/werkstudentin-wmd-innovation-excellence-mit-fokus-auf-strategic-foresight-079480"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Siemens Mobility are currently recruiting for a high calibre Senior Electrical Design Engineer for our Rail Electrification business. The Senior Design Engineer, with a wide range of experience in Low Voltage Railway Designs, will be responsible for the production, development, delivery and innovation of E&amp;P designs on exciting major UK projects.<br><br><strong>Your role and what you'll be doing:</strong><br><br>Based out of our offices in York and working with the Principal Engineer, the Senior Design Engineer will deliver consistent high-quality designs which safely implement rail low voltage distribution solutions to the customer's specifications, agreed timescales and budgets. In addition, the Senior Design Engineer will support the creation of the programmes of work for their respective projects, and will either be able to demonstrate working towards or have undertaken the role of the Contractors Responsible Engineer (CRE) role.<br><br>In the role you will be a main point of contact for our client / customers and shall use excellent communication skills to positively manage and influence their expectations. You will also be required to manage the design and collaborate with other teams, ensuring a coherent design approach whilst taking into account both the clients and Siemen's quality and safety policies.<br><br><strong>What will be my Responsibilities?</strong><br><br><ul><li>Responsible for advising design engineers on their works and supporting them in providing an outstanding service to the construction teams / clients.</li><li>Preparing, checking and delivering design documentation to timescales and authorised budgets.</li><li>Contribute to the development of tenders and offers, and the change management process on designated projects.</li><li>Maintain technical and safety standards in all aspects of design work in order that successful project implementation and future reliability is achieved.</li><li>Ensure that Siemens quality control processes are followed and that designs being presented to clients meet the safety policies, industry standards and best practices of both Siemens and the rail industry.</li><li>Manage inter-disciplinary designs (Civils, Signalling, HV, OLE, Telecoms etc.) for low voltage designs.</li><li>Identify, review and report on project-based risks, ensuring appropriate actions / mitigations are taken.</li><li>Undertake lessons learnt exercises, providing opportunities for innovation and value for money to our clients.</li><li>Maintain and develop own professional knowledge and competence, and that of both experienced and junior Engineers.</li><li>Provide support and guidance to Project Manager and Project Engineers on projects.</li><li>Create programmes, report on the progress of works in relation to timeline and budget and ensure that the development, design, construction and testing requirements are met.</li><li>Have a sound understanding and capability to discharge safety responsibilities in relation to CDM Regulations, Health and Safety legislation and follow Company procedures including development of the project Safety Plan.</li><li>Undertake the role of Contractors' Responsible Engineer on allocated projects as advised.</li><li>Support problem solving and site engineering when required.</li></ul><br><strong>What Skills, Qualifications and Experience do I need for this role?</strong><br><br><strong>Essential:</strong><br><br><ul><li>Demonstratable experience of at least 2 of the following: Signalling Power Supplies / E&amp;P / LV / Building Services designs for the Railway.</li><li>An Engineering Degree or HND/HNC (minimum) in a relevant subject area.</li><li>Member of the IET or other recognised Professional body.</li><li>A good working knowledge of appropriate Railway and associated discipline standards.</li><li>A wide variety of experience in the design and implementation of E&amp;P / LV / building services systems with a proven track record of delivering good quality designs.</li><li>Practical experience of the operational requirements of railway construction works.</li><li>Good knowledge of Project Safety requirements.</li><li>Demonstrable experience of interfacing directly with clients and in representing a company to external parties.</li><li>Understanding of task, time and people management.</li></ul><br><strong>Desirable:</strong><br><br><ul><li>Working towards a Professional Engineering status, Incorporated or Chartered Engineer.</li><li>Holder of Personal Track Safety card.</li><li>Experience of working with programmes such as Amtech / lighting design software / Bentley Microstation</li><li>Previous experience of applications for railway LV DNO supplies</li></ul><br><strong>Benefits include:</strong><br><br><ul><li>26 days holiday, increasing up to 29 days with length of service</li><li>Excellent pension, with Siemens matching contributions up to 10% of pensionable salary</li><li>Performance related bonus scheme</li><li>Flexible benefits to suit your personal needs</li><li>Flexible working policy</li><li>Investment in personal development and support to membership of professional institutions</li></ul><br>We are looking forward to receiving your online application. Please ensure you complete all areas, of the application form, to the best of your ability to help us review your suitability for the role. We will be in contact as soon as possible with an update on your application.<br><br><strong>About us</strong><br><br>We're Siemens. A collection of over 377,000 great minds who are all making the future and you could be one of them. We have offices across the UK, full of hardworking individuals helping us to challenge the today and work towards a brighter tomorrow.<br><br><strong>What else do you need to know?</strong><br><br>Our compensation package includes a competitive salary, holiday allowance, pension and other additional benefits. We celebrate the fact that our employees are individuals and have different wants and needs. With this in mind, we have a flexible benefits scheme where you can tailor your benefits package to suit you.<br><br>If we all thought the same, we would never think of anything new. That's why we recruit great minds from all walks of life. We recognise that building a diverse workforce is essential to the success of our business, therefore we encourage applications from a diverse talent pool. We are proud to announce that we have partnered with VERCIDA, the UK's largest diversity and inclusion focused careers site where all our vacancies are in an accessible format. We welcome the opportunity to discuss flexibility requirements with our applicants to encourage agile working and innovation. #LI-SM1<br><br><b>Organization:</b> Siemens Mobility<br><br><b>Company:</b> Siemens Mobility Limited<br><br><b>Experience Level:</b> not defined<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Senior Design Engineer (Low Voltage)", "type": "external", "publication_date": "2023-05-09T23:40:12Z", "short_name": "senior-design-engineer-low-voltage", "model_type": "jobs", "id": 11320952, "locations": [{"name": "York, United Kingdom"}], "categories": [{"name": "Science and Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/senior-design-engineer-low-voltage"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><b>Job Description:</b><br><br>At Bank of America, we're guided by a common purpose to help make financial lives better by connecting clients and communities to the resources they need to be successful. Make a difference where it counts by joining our industry-leading wealth management team at Bank of America and Merrill. We're looking for the next generation of financial advisors-those with a passion for people and drive to make clients' financial lives better. You'll advise and guide clients on how to achieve their financial goals. Additionally, you'll be equipped with the expertise to support them with personal investing tools and resources.<br><br>During this stage of your journey, the Merrill Financial Solutions Advisor (Merrill FSA) will help provide you with the necessary training and guidance through a defined path to become the financial advisor you want to be. You will have the opportunity to work with both affluent and high net worth clients, identifying needs, developing relationships, reviewing investment goals, and preparing investment recommendations that align with the goals of both existing and prospective clients. In this role you will develop the relationship management skills necessary to operate in an Elite Growth Practice (EGP). From marketing yourself to managing your own practice, we'll prepare you with everything you need as you develop within your role. The MFSA role provides experienced advisors the opportunity to pursue a career within Merrill Wealth Management. Once you have honed your skills and demonstrated success as a MFSA, you typically will progress into the next stage of training. Located in a Merrill branch.<br><br>This position is subject to SAFE Act registration requirements<b>. </b>Pursuant to the SAFE Act requirements, all employees engaged in residential loan mortgage originations must register with the federal registry system and remain in good standing. Your position requires SAFE Act registration and you'll be required to register and submit to the required SAFE Act background check and registration process. Failure to obtain and/or maintain SAFE Act registration may result in your immediate termination.<br><br><b>We'll help you</b><br><br><ul><li>Get training and one-on-one mentorship from managers who are invested in your success. You'll enroll in our Academy to develop as an advisor; the potential for growth is yours! </li><li>Build connections to grow your network and business. Starting at a Merrill branch, you'll interact with Merrill financial advisors, institutional retirement participants and higher net worth clients.</li><li>Deliver advice through client reviews/presentations with confidence, including reviews of financial goals, and recommend investment advisory strategies to help clients achieve their financial goals.</li><li>Learn about the full suite of financial solutions. Connect clients to solutions that are in their best interest, such as core Banking, Investment &amp; Life Priority™ solutions, through Bank of America and Merrill to meet their financial needs.</li></ul><br><b>As a Merrill FSA, you can look forward to</b><br><br><ul><li>A strong referral network from across the business to increase opportunities for affluent and high net worth client acquisition and provide access to partners who are specialists in their field.</li><li>Marketing strategies to reach wider audiences with greater appeal.</li><li>Ongoing professional development to deepen your skills and optimize your practice as the industry evolves.</li><li>Potential Opportunities for professional growth.</li><li>Leadership opportunities, including leading client and conference seminars.</li></ul><br><b>We're a culture that</b><br><br><ul><li>Is committed to building a workplace where every employee is welcomed and given the support and resources to build and advance their careers. Along with taking care of our clients, we want to be a great place for people to work, and we strive to create an environment where all employees have the opportunity to achieve their goals.</li><li>Believes diversity makes us stronger so we can reflect, connect to and meet the diverse needs of our clients around the world.</li><li>Provides continuous training and developmental opportunities to help employees achieve their goals, whatever their background or experience.</li><li>Is committed to advancing our tools, technology and ways of working. We always put our clients first to meet their evolving needs.</li><li>Believes in responsible growth and is dedicated to supporting communities around the world by connecting them to the lending, investing and giving they need to remain vibrant and vital.</li></ul><br><b>Required skills:</b><br><br><ul><li>Currently holds Series 7 &amp; 66 (63 &amp; 65 in lieu of 66) licenses.</li><li>Has two years' experience working in the financial service industry and/or a sales environment where goals were met or exceeded (including at least one year experience in the investments industry, including investment training and in-depth knowledge of investment products and services).</li><li>Is a self-starter who efficiently manages time and capacity.</li><li>Sets and accomplishes goals, achieving whatever you put your mind to.</li><li>Builds and nurtures strong relationships.</li><li>Collaborates effectively with others to get things done.</li><li>Communicates effectively and confidently and is comfortable engaging all clients.</li><li>Manages goals, navigates complexity, prioritizes tasks and executes in a fast-paced environment.</li><li>Likes to learn, adapts to new information and seeks the right solutions for clients.</li><li>Is thorough and thoughtful in incorporating relevant regulatory due diligence into daily activities and long-term strategies for clients.</li></ul><br><b>Desired skills:</b><br><br><ul><li>Proven ability to partner and promote lead generation.</li><li>Experience balancing investment management, sales activities and new client development.</li><li>Strong computer skills and the ability to multitask in a demanding environment.</li><li>A bachelor's degree, preferably in business-related field.</li><li>Achieved additional professional designations such as Certified Financial Planner (CFP) and/or Chartered Retirement Planning Counselor (CRPC).</li><li>Obtained insurance licenses.</li></ul><br>ADPJOB<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>", "name": "Merrill Financial Solutions Advisor - Alaska Market", "type": "external", "publication_date": "2024-01-27T23:43:37Z", "short_name": "merrill-financial-solutions-advisor-alaska-market-459502", "model_type": "jobs", "id": 13850116, "locations": [{"name": "Eagle River, AK"}, {"name": "Juneau, AK"}], "categories": [{"name": "Advertising and Marketing"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/bankofamerica/merrill-financial-solutions-advisor-alaska-market-459502"}, "company": {"id": 12145, "short_name": "bankofamerica", "name": "Bank of America"}}, {"contents": "<p><strong>Gemeinsam machen wir den Unterschied</strong><br><br><strong>Siemens Mobility</strong> ist ein eigenständig geführtes Unternehmen der Siemens AG und seit über 160 Jahren ein führender Anbieter im Bereich Mobilität. Zu unserem Kerngeschäft gehören Schienenfahrzeuge, Bahnautomatisierungs- und Elektrifizierungslösungen, schlüsselfertige Systeme sowie die dazugehörigen Serviceleistungen. Wir waren schon immer sehr innovativ, um Reisen schneller, sicherer und komfortabler zu machen. Heute brauchen wir neue Lösungen für neue Herausforderungen wie den Klimawandel und weltweit steigende Bevölkerungszahlen. Das ist es, was uns antreibt. Deshalb gestalten wir Mobilität mit Leidenschaft und sind immer einen Schritt voraus. Durch Digitalisierung machen wir Infrastrukturen intelligent und schaffen Möglichkeiten, die uns nachhaltig und nahtlos von A nach B bringen. Unsere 38.200 Mitarbeiter sind Pioniere im Mobilitätswesen, die dabei helfen, die Welt in Bewegung zu halten.#ServiceBahn<br><br><strong>Ihr neues Aufgabenfeld - herausfordernd und zukunftsorientiert</strong><br><br><ul><li>Sie helfen die Verfügbarkeit von Bahnanlagen sicher zu stellen, indem Sie Fahrleitungs- und Stromversorgungslangen montieren, warten und instand halten.</li><li>Nach einer umfassenden Einarbeitung führen Sie Montagearbeiten durch und stellen die Betriebsbereitschaft der montierten Anlagen sicher.</li><li>Ferner wirken sie an notwendigen Service- und Instandhaltungsarbeiten mit.</li><li>Sie erstellen die Leistungsberichte und kontrollieren die technischen Dokumentationen.</li><li>Je nach Bedarf werden Sie deutschlandweit in Projekten eingesetzt.</li></ul><br><strong>Ihre Qualifikationen - fundiert und adäquat</strong><br><br><ul><li>Sie haben eine Ausbildung zum Elektriker, Mechatroniker, Elektroniker, Schlosser, Freileitungsmonteur oder Fahrleitungsmonteur abgeschlossen.</li><li>Idealerweise bringen Sie bereits mehrjährige Erfahrungen in als Elektromonteur im Bahn- oder Industrieumfeld mit.</li><li>Erfahrungen im Bereich der Mittelspannung und im 15kV- Fahrleitungsbereich sind von Vorteil.</li><li>Idealerweise besitzen Sie einen Triebfahrzeugführerschein der Klasse 2 oder 3 für schwere Nebenfahrzeuge.</li><li>Zudem bringen Sie gute Deutschkenntnisse in Wort und Schrift</li></ul><br><strong>So treten Sie mit uns in Kontakt - einfach und direkt</strong><br><br><strong>www.siemens.de/mobility</strong><br>wenn Sie vor Ihrer Bewerbung mehr über Siemens erfahren möchten.<br><strong>+49 (9131) 17 52430</strong><br>wenn Sie erste Fragen gern persönlich mit unserem Recruiting Team klären möchten. Ansprechpartner für diese Stellenausschreibung ist Herr Martin Spandel.<br><strong>www.siemens.de/karriere</strong><br>wenn Sie mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchten.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br><b>Organisation:</b> Siemens Mobility<br><br><b>Unternehmen:</b> Siemens Mobility GmbH<br><br><b>Erfahrungsniveau:</b> Mid-level Professional<br><br><b>Voll-/Teilzeit:</b> Vollzeit</p>", "name": "Freileitungsmonteur (w/m/d) Fahrleitungs- und Stromversorgungsanlagen", "type": "external", "publication_date": "2023-01-24T00:42:10Z", "short_name": "freileitungsmonteur-wmd-fahrleitungs-und-stromversorgungsanlagen-c64550", "model_type": "jobs", "id": 10536487, "locations": [{"name": "Bad Mergentheim, Germany"}], "categories": [{"name": "Computer and IT"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/freileitungsmonteur-wmd-fahrleitungs-und-stromversorgungsanlagen-c64550"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>Mechanical Assembler</strong><br><br>Siemens is a global technology powerhouse that has stood for engineering excellence, innovation, quality, reliability, and internationality for more than 165 years. Siemens Smart Infrastructure is seeking an Mechanical Assembler for our Electrification and Automation (EA) Business Unit working with the Low Voltage Motor Control Center product.<br><br>As a Mechanical Assembler you will be responsible for the building, assembling, and wiring of Medium and Low Voltage Electrical Distribution Equipment, such as LV Motor Control Centers, MV breakers, MV switchgear and Motor Control Centers, DC Electrical Vehicle Chargers and Solar Inverters.<br><br><strong>Responsibilities</strong>:<br><br><ul><li>Assembly and wire LV MCC breakers, structures, sub-assemblies, parts kits, and aftermarket parts orders</li><li>Perform Sub assembly work including mechanical assembly of steel and components, control wiring, power cable work, and interconnection of control wires</li><li>Record appropriate job record transactions</li><li>Read BOM, follow layouts &amp; assembly drawings,</li><li>Perform some basic wiring per given instructions when requested</li><li>Set and correct use of Torque wrenches</li><li>Adhere to developed processes, methods and/or seek ways to improve</li><li>Must adhere to all safety rules and keep safety first for self and others</li><li>Perform miscellaneous other duties as assigned by Supervisor or Management</li></ul><br><strong>Requirements: knowledge/skills, education, and experience:</strong><br><br><ul><li>High School Diploma or GED</li><li>1+ years of experience performing mechanical assembly or experience in the mechanical field</li><li>1+ years' experience wiring in commercial or industrial applications</li><li>Must be able to lift parts or sub-assemblies that weigh up to 50 lbs. occasionally</li><li>Communicate in English (read, write &amp; speak fluently)</li><li>Must be able to Identify mechanical parts and electrical components</li><li>Experience with using a tape measure and other measuring devices</li><li>Must have extensive experience working with standard hand and power tools, both pneumatic and battery operated, 1 to 3 years</li><li>Must have knowledge of torque wrench and applied torque values</li><li>Must have a proven record in Quality and Productivity</li><li>Must be a strong team player</li><li>Conform with Environmental and Occupational Health and Safety policy and Management System and strive to continual improve the intended outcomes of the Management System.</li></ul><br><strong>Preferred </strong><strong>knowledge/skills, education, and experience</strong><br><br><ul><li>Forklift driver experience</li><li>SAP experience</li><li>Associates Degree or technical training in area of responsibility.</li></ul><br><strong>Benefits:</strong><br><br>In addition to the growth and development opportunities we continue to foster, we offer included benefits of PTO, a matching 401K plan, stock share match, health, life, vision and dental benefits, paid parental leave, and so much more.<br><br><strong>About Smart Infrastructure - Electrification &amp; Automation:</strong><br><br>The Electrification and Automation (EA) Business Unit offers the full range of energy distribution systems and solutions for all markets and through all sales channels. We provide reliable power distribution grids of today while investing into our Future Grids portfolio and applications to create the power distribution grid of the future. Our comprehensive portfolio meets the growing technical requirements of todays and tomorrow's power grid!<br><br>At Siemens, we live and foster an ownership culture, in which every employee takes personal responsibility for professional growth &amp; development and our company's success. We strive to transform the everyday for our customers, employees, and society by:<br><br><ul><li>Trusting and empowering our leaders to act as owners, directing their teams, and innovating to succeed.</li><li>Communicating openly and honestly to learn from our failures and celebrate our successes.</li><li>Recognizing individual and team achievements frequently</li><li>Our focus on investment in our team members, offering a wide variety of internal and external development opportunities.</li><li>Our commitment to diversity, equity, and inclusion</li></ul><br>Can <strong>you</strong> see yourself, learning, growing, and succeeding here? If so, we'd like to meet you! Apply today and learn how you can be a part of the Siemens family.<br><br>Qualified Applicants must be legally authorized for employment in the United States. Qualified Applicants will not require employer sponsored work authorization now or in the future for employment in the United States.<br><br>#LI-BJ1<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Mechanical Assembler - 1st Shift", "type": "external", "publication_date": "2023-04-26T23:41:35Z", "short_name": "mechanical-assembler-1st-shift-0a7d96", "model_type": "jobs", "id": 11259124, "locations": [{"name": "Clayton, NC"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/mechanical-assembler-1st-shift-0a7d96"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Store Manager In Training (SMIT) job is a development focused role that is crafted to prepare you for a CVS Store Manager position.<br><br>The SMIT program is designed to enhance your career as a future store leader. We support your development towards the store manager role by participating in a self-paced, collaborative training over the span of 16 weeks.<br><br>We provide both virtual and hands on learning experiences to develop you as a leader. Our team of people, that support your growth toward your leadership career include: your District Leader, Human Resources Business Partner, Training Store Manager, and your Store Manager coach.<br><br>Some of the skills needed for this role are:<br><br>•   Communicate well verbally and in writing to support and lead your team.<br><br>•   Perform customer care duties to provide high levels of service.<br><br>•   Execute merchandising strategies to support store sales growth.<br><br>•   Manage the store inventory and assets to maintain profitability.<br><br>We are invested in your growth and anticipate that you will be as well. We expect our SMIT's to:<br><br>•   Actively engage with your leader in Key Learning Experiences to support you on your path to promotion during the structured program.<br><br>•   Support your store as management team member and lead in a manner that is consistent with CVS values and policies.<br><br>•   Engage your colleagues in support of the company's purpose of \"helping people on their path to better health.\"<br><br>•   Be willing to accept promotion roles with the market that you work in.<br><br><b>Required Qualifications</b><br><br>Selection for the SMIT position does not guarantee promotion into a Store Manager position. Whether and when you are actually promoted to Store Manager is dependent on a variety of factors, including but not limited to performance and availability of openings.<br><br>•   Willingness to accept a promotion to Store Manager role at any location in the designated market.<br><br>•   Ability to transfer to other CVS Pharmacy stores located within the designated market.<br><br>•   Ability to work a schedule that may vary based on business needs.<br><br>•   High School diploma or GED<br><br>•   Bachelor's Degree<br><br>•   Retail management experience, or experience as a CVS Supervisor<br><br><b>Education</b><br><br>A high school diploma or GED is required.<br>A four year college degree is preferred, or relevant work experience may be considered in lieu of a college degree.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$18.50 - $30.64<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 04/28/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Manager in Training", "type": "external", "publication_date": "2024-03-08T11:57:53Z", "short_name": "store-manager-in-training-bdc2ca", "model_type": "jobs", "id": 14124243, "locations": [{"name": "New York, NY"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-manager-in-training-bdc2ca"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}], "aggregations": {}},{"page": 1, "page_count": 15677, "items_per_page": 20, "took": 42, "timed_out": false, "total": 313522, "results": [{"contents": "<p><strong>Who designs your future? You do.</strong><br><br>Are you looking for a career where you can showcase your technical aptitude and passion for problem solving to ensure your customers can work in a comfortable, safe, and energy-efficient environment? Then look to Siemens!<br>  <br><strong>Join our team!  Recognized by Fortune as World's Most Admired Companies 2022</strong><br><br><strong>Our Culture:  </strong><br><br>At Siemens, we live and foster an ownership culture, in which every employee takes personal responsibility for our company's success. We trust and empower our leaders to act as owners, direct their teams, and innovate to succeed. We communicate openly and honestly to learn from our failures and celebrate our successes. We recognize individual and team achievements frequently. We invest in our team members, offering a wide variety of internal and external development opportunities.<br>   <br><strong>What you will do for Siemens Smart Infrastructure: <br> </strong>This position participates in the installation, startup, and commissioning of building automation system equipment that has been newly installed. The objectives of building automation are improved occupant comfort, efficient operation of building systems, reduction in energy consumption and operating costs, and improved life cycle of utilities. You will support the verification of the system database and programming, ensuring consistency with the scope of work and sequence of operations.<br><br><strong>Responsibilities:</strong><br><br><ul><li>Network Technologies: Performs back-up from data servers and the creation of automated back-up procedures. Support troubleshooting and resolution of inconsistencies in the functions or sequence of operations. Performs the set-up and configuration of PC workstations and user interfaces. Confirms proper network performance.</li><li>Operational Testing, Verification, and Acceptance: Run reports to review system operation. Participate in final inspection and testing. Ensure customer acceptance. Provide customer training on system operations. Complete and submit written reports. Provide plans and control system documents to engineering for as-built drawings.</li><li>Project Site Communication and Coordination: Provide support in the scheduling of trade contractors to coordinate startup services.</li></ul><br><strong>Qualifications for Senior: </strong><br><br><ul><li>High school diploma or state-recognized GED; Associate degree preferred</li><li>Experience installing HVAC controls or DDC controls; 5+ years preferred</li><li>Experience in writing computer programs and software applications related to the HVAC industry</li><li>Extensive knowledge of a variety of electronic or digital controls systems, and ability to test and write modifications to system software in multiple languages</li><li>Skilled in programming, job start-up, checkout, and troubleshooting complex projects</li><li>Demonstrated experience in the integration of low-voltage building sub-systems using various industry protocols such as BACNet, N2, Modbus, etc.</li><li>Ability to work in a variety of circumstances, including climbing ladders, scaffolds, and high-lift equipment, working in ducts, crawl spaces, roofs, basements, above ceilings, and in outside/inside/heat/cold/day/night conditions</li><li>Must be able to use hand tools, laptop, email, smartphone, and tablet</li><li>Must be able to carry and move equipment and tools weighing up to 75 pounds unassisted</li><li>Ability to work in a team environment providing dedicated support to our customers</li><li>Proficient in Microsoft Office (Word, Excel and Outlook)</li><li>Good verbal and written communication skills in English</li><li>Applicants must be legally authorized for employment in the United States without need for current or future employer-sponsored work authorization.</li><li>Must be 21 years of age and possess a valid driver's license with limited violations</li></ul><br><strong>Benefits: </strong><br><br><ul><li>Competitive salary based on qualifications</li><li>Health, dental, and vision plans with options</li><li>Matching 401(k)</li><li>Competitive paid time off plan, holidays, and floating holidays</li><li>Paid parental leave</li><li>Company cell phone and laptop</li><li>Extensive product training and professional career development</li><li>Education and tuition reimbursement programs available</li><li>Overtime, on-call pay, and company uniform and vehicle for eligible positions</li></ul><br>Hvac controls, building controls, building automation, programming, field technician, heating, ventilation, air conditioning, direct digital control, apogee, desigo, modbus, tridium, controls, commissioning, lonworks, bacnet, ddc, bau, bms, building management, mechanical systems, system integration<br><br>#LI-KB1<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Sr. Systems Specialist - Smart Buildings / Automation - Cedar Rapids", "type": "external", "publication_date": "2023-05-03T23:45:16Z", "short_name": "sr-systems-specialist-smart-buildings-automation-cedar-rapids-8e652c", "model_type": "jobs", "id": 11034620, "locations": [{"name": "Waterloo, IA"}], "categories": [{"name": "Design and UX"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/sr-systems-specialist-smart-buildings-automation-cedar-rapids-8e652c"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Store Manager In Training (SMIT) job is a development focused role that is crafted to prepare you for a CVS Store Manager position.<br><br>The SMIT program is designed to enhance your career as a future store leader. We support your development towards the store manager role by participating in a self-paced, collaborative training over the span of 16 weeks.<br><br>We provide both virtual and hands on learning experiences to develop you as a leader. Our team of people, that support your growth toward your leadership career include: your District Leader, Human Resources Business Partner, Training Store Manager, and your Store Manager coach.<br><br>Some of the skills needed for this role are:<br><br>•   Communicate well verbally and in writing to support and lead your team.<br><br>•   Perform customer care duties to provide high levels of service.<br><br>•   Execute merchandising strategies to support store sales growth.<br><br>•   Manage the store inventory and assets to maintain profitability.<br><br>We are invested in your growth and anticipate that you will be as well. We expect our SMIT's to:<br><br>•   Actively engage with your leader in Key Learning Experiences to support you on your path to promotion during the structured program.<br><br>•   Support your store as management team member and lead in a manner that is consistent with CVS values and policies.<br><br>•   Engage your colleagues in support of the company's purpose of \"helping people on their path to better health.\"<br><br>•   Be willing to accept promotion roles with the market that you work in.<br><br><b>Required Qualifications</b><br><br>Selection for the SMIT position does not guarantee promotion into a Store Manager position. Whether and when you are actually promoted to Store Manager is dependent on a variety of factors, including but not limited to performance and availability of openings.<br><br>•   Willingness to accept a promotion to Store Manager role at any location in the designated market.<br><br>•   Ability to transfer to other CVS Pharmacy stores located within the designated market.<br><br>•   Ability to work a schedule that may vary based on business needs.<br><br>•   High School diploma or GED<br><br>•   Bachelor's Degree<br><br>•   Retail management experience, or experience as a CVS Supervisor<br><br><b>Education</b><br><br>A high school diploma or GED is required.<br>A four year college degree is preferred, or relevant work experience may be considered in lieu of a college degree.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$18.50 - $28.67<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Manager in Training", "type": "external", "publication_date": "2024-03-08T12:13:05Z", "short_name": "store-manager-in-training-62a878", "model_type": "jobs", "id": 13522962, "locations": [{"name": "Yonkers, NY"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-manager-in-training-62a878"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions. As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management<br><br>A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li><b>Required Qualifications</b><br>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Free of pending felony charges or convictions for criminal offenses involving controlled substances</li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60.00 - $73.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "District Support Pharmacist - PT", "type": "external", "publication_date": "2024-03-08T12:18:01Z", "short_name": "district-support-pharmacist-pt-042187", "model_type": "jobs", "id": 13053564, "locations": [{"name": "Boston, MA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/district-support-pharmacist-pt-042187"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br> o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br> o Actively look for ways to help people, and do so in a friendly manner<br> o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br> o Use and understand verbal and written communication to interact with customers and colleagues<br> o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br> o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br> o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br> o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br> o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-08T12:13:04Z", "short_name": "pharmacy-technician-47e5e8", "model_type": "jobs", "id": 13555160, "locations": [{"name": "Indianapolis, IN"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-47e5e8"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong><br><br><strong>Who designs your future? You do.</strong><br><br>Are you looking for a career where you can showcase your technical aptitude and passion for problem-solving to ensure your customers can work in a comfortable, safe, and energy-efficient environment? Then look to Siemens!<br><br><strong>Our Culture:  </strong> <br><br>At Siemens, we live and foster an ownership culture, in which every employee takes personal responsibility for our company's success. We trust and empower our leaders to act as owners, direct their teams, and innovate to succeed. We communicate openly and honestly to learn from our failures and celebrate our successes. We recognize individual and team achievements frequently. We invest in our team members, offering a wide variety of internal and external development opportunities.<br><br><strong>What you will do for Siemens Smart Infrastructure: </strong> <br><br>Service Specialists conduct preventive maintenance, repair, installation, commissioning, and general servicing of HVAC control systems (including detailed troubleshooting). You will be responsible for high levels of customer satisfaction through direct, onsite customer interaction, as well as for completing required project and service documentation. This position supports customers primarily in the Metro NYC area.<br><br><strong>Responsibilities:</strong><br><br><ul><li>Diagnose and repair complex electronic control system malfunctions</li><li>Provide sketches of field changes and discrepancies for engineering corrections and drawings</li><li>Communicate with customers upon arrival and before leaving the work site </li><li>Meet regularly with customers to become familiar with operating problems </li><li>Keep customers informed of the nature of service provided, outstanding issues, and recommended system enhancements, upgrades, and/or repairs</li><li>Promote the sale of add-on work</li><li>Manage assigned work to meet professional execution, time, and customer satisfaction standards </li><li>Report problems or changes to management immediately</li><li>Provides training to customers on electronic control systems operations</li><li>Deliver manuals and documentation to customers for training, as well as support the mechanical staff on complex, critical equipment</li><li>Compile job documentation, such as certificates of completion, customer training forms, training certificates, and punch lists</li></ul><br><strong>Qualifications:</strong><br><br><ul><li>High school diploma or state-recognized GED; Associate degree preferred   </li><li>Experience installing and servicing electronic control or HVAC equipment; 1+ years preferred (Candidates with related military or trade school experience will also be considered.)</li><li>Knowledge of a variety of electronic or digital controls systems, and ability to test and write modifications to systems software in multiple languages preferred</li><li>Demonstrated experience in the integration of low-voltage building sub-systems using various industry protocols, such as BACnet, N2, Modbus, etc. preferred</li><li>Ability to work in a variety of circumstances, including climbing ladders, scaffolds, and high-lift equipment; working in ducts, crawl spaces, roofs, basements, above ceilings, and in outside/inside/heat/cold/day/night conditions </li><li>Must be able to use hand tools, laptop, email, smartphone, and tablet </li><li>Must be able to carry and move equipment and tools weighing up to 75 pounds unassisted </li><li>Ability to work in a team environment providing dedicated support to our customers </li><li>Proficient with Microsoft Office (Word, Excel &amp; Outlook) </li><li>Good verbal and written communication skills in English </li><li>Qualified applicants must be legally authorized for employment in the United States without the need for employer-based sponsorship currently or in the future</li><li>Must be 18 years of age and possess a valid driver's license with limited violations </li><li>Must be able to pass background check and drug screen</li></ul><br>This position may support a Siemens customer who may require all employees and vendors to be fully vaccinated against COVID-19 where permitted by applicable law and in accordance with an accommodation based on legally protected reasons.<br><br><strong>Benefits: </strong><ul><li>Competitive salary based on qualifications</li><li>Health, dental, and vision plans with options</li><li>Matching 401(k), up to 6%</li><li>Competitive paid time off plan, holidays, and floating holidays</li><li>Paid parental leave</li><li>Company cell phone and laptop </li><li>Extensive product training and professional career development </li><li>Education and tuition reimbursement programs available </li><li>Overtime, on-call pay, and company uniform and vehicle for eligible positions</li></ul><br><strong>For Our Military/Veteran Applicants:</strong> <br><br>First and most importantly, thank you for your service. For the Automation Service Specialist role, Veterans (Air Force, Army, Coast Guard, Marines, Navy or Space Force) with these military careers are typically good fits: <br><br>Avionic ET, CE Careers (HVAC &amp; Electrical), Communication Techs, Electricians, ET/EM/MM NUC (Navy Nuke), Fire Control, Navaids, ATC Radar ET Techs, SATCOM, Submarine Electronics/Computer Field, and other Electronic/Electrical/Mechanical Career Fields <br><br>We highly encourage you to apply to <strong>any position</strong> you have interest in, not just the Automation Service Specialist. <br><br>#LI-DRR<br><br>#RSS<br><br>Keywords: Hvac controls, building controls,building automation, programming, field technician, heating, ventilation, airconditioning, direct digital control, apogee, desigo, modbus, tridium,controls, commissioning, lonworks, bacnet, ddc, bau, bms, building management,mechanical systems, system integration<br><br></strong><br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Service Specialist / Technician (HVAC Controls) - Building Automation - New York, NY (Metro NYC)", "type": "external", "publication_date": "2023-05-13T23:33:38Z", "short_name": "service-specialist-technician-hvac-controls-building-automation-new-york-ny-metro-nyc-8ee333", "model_type": "jobs", "id": 11371161, "locations": [{"name": "Union, NJ"}], "categories": [{"name": "Education"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/service-specialist-technician-hvac-controls-building-automation-new-york-ny-metro-nyc-8ee333"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li></li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $18.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-08T12:01:41Z", "short_name": "shift-supervisor-trainee-38204e", "model_type": "jobs", "id": 14103081, "locations": [{"name": "Mishawaka, IN"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-38204e"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-08T12:10:41Z", "short_name": "pharmacy-technician-9c00ec", "model_type": "jobs", "id": 13595149, "locations": [{"name": "New Orleans, LA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-9c00ec"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br><b>This is a hybrid position requiring working from the office 3 days a week. Applicants will need to reside within driving distance of an Aetna or CVS location.</b><br> The Lead Data Engineer will drive the design, implementation, and management of Medicare Data for use within our various business units.  As the lead, you will steer the development of scalable data pipelines, ensuring efficient data collection, cataloging and storage.  Your primary responsibilities will revolve around architecting and supervision the construction of robust data systems.<br><br><b>Required Qualifications</b><br><br>Minimum 10 years in application development/data engineering with a strong foundation in database design, ETL processing.<br><br>Technical: Proficiency in C#, SQL, T-SQL<br><br>Analytical: Strong analytical skills as well as the ability to understand and troubleshoot complex data related issues<br><br><b>Preferred Qualifications</b><br>Technical:  Experience with GCP, Azure, Python, MongoDB, Snowflake, Javascript Frameworks<br><br><b>Education</b><br><br>Bachelors' or Masters' Degree in Computer Science, Engineering or a related field<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$118,450.00 - $236,900.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above.  This position also includes an award target in the company's equity award program. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies. <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Lead Data Engineer", "type": "external", "publication_date": "2024-03-08T12:01:41Z", "short_name": "lead-data-engineer-e96810", "model_type": "jobs", "id": 14102814, "locations": [{"name": "Spring House, PA"}], "categories": [{"name": "Data and Analytics"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/lead-data-engineer-e96810"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br> o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br> o Actively look for ways to help people, and do so in a friendly manner<br> o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br> o Use and understand verbal and written communication to interact with customers and colleagues<br> o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br> o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br> o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br> o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br> o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-08T12:18:01Z", "short_name": "pharmacy-technician-5f5089", "model_type": "jobs", "id": 12938582, "locations": [{"name": "Minooka, IL"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-5f5089"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $18.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-08T11:53:24Z", "short_name": "store-associate-96eec6", "model_type": "jobs", "id": 14302176, "locations": [{"name": "Indianapolis, IN"}], "categories": [], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-96eec6"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li></li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-08T12:04:54Z", "short_name": "shift-supervisor-trainee-f37dc2", "model_type": "jobs", "id": 13882340, "locations": [{"name": "Kansas City, MO"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-f37dc2"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<div><p>SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars.</p></div>\n\n<p><strong>ELECTRICIAN (STARSHIP TEST) - LEVEL 4/5</strong></p>\n\n<p><strong>RESPONSIBILITIES:</strong></p>\n\n<ul>\n<li>Performs installation, maintenance, troubleshooting, and repair of industrial electrical systems, devices, equipment and components</li>\n<li>Performs installation, repair, and maintenance of motor control centers, motor circuits, overloads, and disconnects</li>\n<li>Performs installation, troubleshooting, and maintenance of generators, automatic transfer switches, and surge protection devices</li>\n<li>Installs, maintains, and repairs electrical and electronic components of machinery and equipment, including hydraulic and pneumatic devices</li>\n<li>Installs grounding and lightning protection systems</li>\n<li>Performs work from instructions using blueprints, wiring diagrams, and schematics</li>\n<li>Installs electrical components according to current NEC code</li>\n<li>Installs and troubleshoots commercial lighting, receptacles, panels, circuits, and controls</li>\n<li>Performs other related duties, as assigned, for the purpose of ensuring an efficient and effective work environment</li>\n</ul>\n\n<p><strong>BASIC QUALIFICATIONS:</strong></p>\n\n<ul>\n<li>High school diploma or equivalency certificate</li>\n<li>8+ years of experience working as an electrician</li>\n</ul>\n\n<p><strong>PREFERRED SKILLS AND EXPERIENCE:</strong></p>\n\n<ul>\n<li>Associate’s degree</li>\n<li>Knowledge and/or understanding of codes, rules, regulations and standards of electrical equipment</li>\n<li>Knowledge of 3Ø low and medium voltage power distribution systems</li>\n<li>Understanding of critical power and safety system design concepts</li>\n<li>Ability to identify and implement efficient paths of action to finish the assigned work</li>\n<li>Ability to exercise independent judgment</li>\n<li>Experience with common trade hand and power tools and multimeters</li>\n<li>Demonstrated ability to understand technical manuals, schematics and reports</li>\n<li>Ability to use precision measuring instruments</li>\n</ul>\n\n<p><strong>ADDITIONAL REQUIREMENTS:</strong></p>\n\n<ul>\n<li>Texas Journeyman or Master Electrician license</li>\n<li>Flight hardware typically is built in tight quarters, and physical dexterity is required</li>\n<li>Must be able to lift heavy objects, up to 25 lbs unassisted</li>\n<li>Valid driver’s license</li>\n<li>Ability to work at elevated heights, up to 200ft</li>\n<li>Typically exposed to work in extreme outdoor environments – heat, cold, rain</li>\n<li>Work performed in an environment requiring exposure to fumes, odors, and noise</li>\n<li>Must be available for overtime and weekends as the schedule varies depending on site operational needs; flexibility is required</li>\n</ul>\n\n<p><strong>COMPENSATION AND BENEFITS:              </strong>             </p>\n\n<p>Pay range:          <br>Level 4: $33.00/hour<br>Level 5: $38.00 - $48.00/hour<br><br>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.</p>\n\n<p>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short and long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation and will be eligible for 10 or more paid holidays per year.</p>\n\n<div><p><strong>ITAR REQUIREMENTS:</strong></p>\n<ul>\n<li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C. § 1157, or (iv) Asylee under 8 U.S.C. § 1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR <a href=\"https://www.pmddtc.state.gov/?id=ddtc_kb_article_page&amp;sys_id=24d528fddbfc930044f9ff621f961987\">here</a>.  </li>\n</ul>\n<p>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.</p>\n<p>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should notify the Human Resources Department at (310) 363-6000.</p></div>", "name": "Electrician (Starship Test) - Level 4/5", "type": "external", "publication_date": "2024-02-05T23:06:09Z", "short_name": "electrician-starship-test-level-45-0d849c", "model_type": "jobs", "id": 13928126, "locations": [{"name": "Brownsville, TX"}], "categories": [{"name": "Computer and IT"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/spacex/electrician-starship-test-level-45-0d849c"}, "company": {"id": 15000190, "short_name": "spacex", "name": "SpaceX"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Operations Manager is a member of the Store Management team, and as such, fulfills the company purpose of helping people on their path to better health by driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. Under the supervision of the Store Manager, the Operations Manager will maintain an engaged, productive store team through strong leadership, demonstrating initiative and leading by example.<br><br>The Operations Manager is responsible for supporting the Store Manager in the total leadership and strategic operation of a CVS/pharmacy store including:<ul><li>Overall store management, supervision, and policy implementation</li><li>Sales and inventory management</li><li>Employee staffing, training, and development</li><li>Financial management</li><li>Customer service leadership</li></ul>Unlike the Store Manager in Training position, the Operations Manager position is not part of the CVS/pharmacy Retail Management Development Program. Operations Managers are not eligible for direct promotion to Store Manager. Candidates with a short-term goal of becoming a CVS Store Manager should instead apply for Store Manager in Training openings.<br><br>Essential Functions:<br><br>1. Management<br><br>Lead others and work effectively with store crews<br><br>Supervise, assign and direct activities of the store's crew<br><br>Effectively communicate information to store crew and supervisors in an open and timely manner<br><br>Support Store Manager with actions plans for operational and service improvement<br><br>2. Customer Service<br><br>Assist customers with their questions, problems and complaints<br><br>Promote CVS customer service culture (greet, offer help, and thank)<br><br><b>Required Qualifications</b><ul><li>Deductive reasoning ability, advanced analytical skills and computer skills.</li><li>Advanced communication skills, leadership, supervision, and influencing skill</li><li>Ability to work a full-time flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed, and to respond to urgent issues at the store when they arise</li></ul><b>Preferred Qualifications</b><ul><li>Experience as a retail manager or supervisor</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$17.00 - $29.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Operations Manager", "type": "external", "publication_date": "2024-03-08T12:01:41Z", "short_name": "operations-manager-2bf3d2", "model_type": "jobs", "id": 14100200, "locations": [{"name": "Stafford, VA"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/operations-manager-2bf3d2"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br>Requisition Job Description<br><br><b>Position Summary</b><br><br>The Store Manager In Training (SMIT) job is a development focused role that is crafted to prepare you for a CVS Store Manager position.<br><br>The SMIT program is designed to enhance your career as a future store leader.   We support your development towards the store manager role by participating in a self-paced, collaborative training over the span of 16 weeks.<br><br>We provide both virtual and hands on learning experiences to develop you as a leader.   Our team of people, that support your growth toward your leadership career include:   your District Leader, Human Resources Business Partner, Training Store Manager, and your Store Manager coach.<br><br>Some of the skills needed for this role are:<br><br>•  Communicate well verbally and in writing to support and lead your team.<br>•  Perform customer care duties to provide high levels of service.<br>•  Execute merchandising strategies to support store sales growth.<br>•  Manage the store inventory and assets to maintain profitability.<br><br>We are invested in your growth and anticipate that you will be as well.   We expect our SMIT's to:<br><br>•  Actively engage with your leader in Key Learning Experiences to support you on your path to promotion during the structured program.<br>•  Support your store as management team member and lead in a manner that is consistent with CVS values and policies.<br>•  Engage your colleagues in support of the company's purpose of \"helping people on their path to better health.\"<br>•  Be willing to accept promotion roles with the market that you work in.<br><br>Selection for the SMIT position does not guarantee promotion into a Store Manager position.   Whether and when you are actually promoted to Store Manager is dependent on a variety of factors, including but not limited to performance and availability of openings.<br><br><b>Required Qualifications</b><br><br>•    Willingness to accept a promotion to Store Manager role at any location in the designated market.<br>•    Ability to transfer to other CVS Pharmacy stores located within the designated market.<br>•    Ability to work a schedule that may vary based on business needs.<br>•    High School diploma or GED<br><br> ability to work nights and weekends<br><br><b>Preferred Qualifications</b><br><br>•    Bachelor's Degree<br>•    Retail management experience, or experience as a CVS Supervisor<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$18.50 - $26.25<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Manager in Training - Valley Springs", "type": "external", "publication_date": "2024-03-08T12:13:05Z", "short_name": "store-manager-in-training-valley-springs-8ccbb2", "model_type": "jobs", "id": 13497658, "locations": [{"name": "Galt, CA"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-manager-in-training-valley-springs-8ccbb2"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions. As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li><b>Required Qualifications</b><br>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Free of pending felony charges or convictions for criminal offenses involving controlled substances</li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$65.00 - $78.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "CA District Support Pharmacist FT", "type": "external", "publication_date": "2024-03-08T12:07:59Z", "short_name": "ca-district-support-pharmacist-ft-d9c331", "model_type": "jobs", "id": 13811730, "locations": [{"name": "Oceanside, CA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/ca-district-support-pharmacist-ft-d9c331"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Are you looking for a company that empowers talent?</strong><br><br>Here at Siemens, we take pride in enabling sustainable progress through technology. We do this through empowering customers by combining the real and digital worlds. Improving how we live, work, and move today and for the next generation!<br><br>From Day 1, you are empowered to create an impact with your full potential and creativity to make a difference for tomorrow.<br><br>We truly have an inclusive and diverse team culture where you can be yourself.<br><br>Our extensive global presence offers a diverse range of career opportunities across various industries, nations, and job domains, empowering our workforce to continuously enhance their skills and stay competitive.<br><br>Create a better tomorrow with us!<br><br><strong>As the Dispatching Operator, you will: </strong><br><br>You will deliver timely and legally-compliant dispatch service handling for the economic benefit of the company and the customer.<br><br><ul><li>Creates or prepares all documents needed for dispatch considering laws and regulations (hazardous goods ordinance...), in order to ensure a timely and cost-efficient delivery.</li><li>DG advisor for outbound traffic solutions &amp; coordination, along with DG and Hazardous Goods management supporting BP &amp; RSS.</li><li>Assembles and prepares the goods in accordance with delivery priorities and agreements for dispatch, in order to design dispatch plans in the optimum way and meet customer requirements.</li><li>Commissions and distributes the transport services to (external) service providers considering laws and regulations (export business, customs), in order to guarantee a smooth and low-cost transport.</li><li>(Enters and) maintains processing logistics dangerous goods data mainly for EDR new item setup, in order to make the flow of goods and values secure and efficient.</li><li>Conducts DG general awareness training for warehouse and ensures team is maintaining DOT and IATA certifications as needed.</li><li>Actively contributes to cooperation with all others involved and with interface partners and passing on all the relevant information, in order to keep themselves and others informed and create an optimum logistics chain.</li><li>Schedules Packaging Material (EU-Pallets, cardboard packaging, sea-freight packaging, and filling material).</li><li>Forwards the information about transport damages and claims notifications to the respective contacts.</li><li>Prepares traffic related collect shipments including labeling of parcels and providing BOLs for truck shipments.</li><li>Assist with customer escalation or hot list orders.</li><li>Assist with projects or other assigned WHO related projects.</li></ul><br><strong>You will make impact if you have the following qualifications: </strong><br><br><ul><li>HS Diploma / GED</li><li>DOT Certification, IATA Certification</li><li>3-5 years experience working with dangerous goods (DG) products in domestic ground and air shipments</li><li>Able to interpret regulations and provide compliant solutions to co-workers and customers</li><li>Experience with Microsoft Office products</li></ul><br><strong>Preferred Qualifications: </strong><br><br><ul><li>IMDG Certification</li><li>5+ years of experience working with dangerous goods (DG) products in international ocean, ground and air shipments</li><li>Experience with administration of carrier setup and authorizations</li><li>Experience with loading carrier rate tables into SAP</li><li>Experience with training with dangerous goods (DG) general awareness</li></ul><br><strong>Benefits and Perks: </strong><br><br><ul><li>Competitive salary based on qualifications</li><li>Health, dental, and vision plans with options</li><li>Matching 401(k)</li><li>Competitive paid time off plan, holidays, and floating holidays</li><li>Paid parental leave</li><li>Wellness Program</li></ul><br>Click here to learn more about our extensive benefits offerings.<br><br><strong>Applicants must be legally authorized for employment in the United States without need for current or future employer-sponsored visa work authorization.</strong><br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Dispatching Operator", "type": "external", "publication_date": "2023-05-09T23:40:12Z", "short_name": "dispatching-operator", "model_type": "jobs", "id": 11321092, "locations": [{"name": "Buffalo Grove, IL"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/dispatching-operator"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary:<br>Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions.<br>As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management<br><br>A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li></li><li><b>Required Qualifications</b><br>Minimum Required Qualifications</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (e.g., APhA)</li><li>No pending felony charges or convictions for criminal offenses involving controlled substances</li><li></li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$57.00 - $70.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Staff Pharmacist FT", "type": "external", "publication_date": "2024-03-08T12:01:41Z", "short_name": "staff-pharmacist-ft-9f877c", "model_type": "jobs", "id": 14104710, "locations": [{"name": "Des Moines, IA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/staff-pharmacist-ft-9f877c"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health we are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we're helping people on their path to better health-from advising on prescriptions to helping manage chronic <br><br><b>Required Qualifications</b><br><br><b>Preferred Qualifications</b><br><br><b>Education</b><br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$65.00 - $81.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Manager", "type": "external", "publication_date": "2024-03-08T12:01:42Z", "short_name": "pharmacy-manager-66d6f1", "model_type": "jobs", "id": 14104865, "locations": [{"name": "Montgomery, AL"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-manager-66d6f1"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>About the Role</strong><br><br>Uber Eats is looking for an experienced e-commerce leader to manage the Merchant Operations in Germany. In this role you will partner closely with our commercial teams, as well regional and global functional teams, with the objective to make Uber Eats the preferred platform for Merchants in Germany, whether it is a Restaurant, Grocery or Retail store.<br><br>You will lead a team who optimizes the Merchant Experience among the entire lifecycle. Whether it is the onboarding of new merchants, supporting their growth through catalog optimisations, own our advertisement product, manage the performance of our commercial portfolio, improve the account management infrastructure, over the procurement of hardware or roll out of new software - your ultimate goal is to further scale and improve our Merchant experience.<br><br>We look for strong performers who can demonstrate advanced analytics, strategic thinking, project management, and team development while dealing with a wide range of stakeholders, such as Senior Leadership, Territory Managers, Finance or our Product Teams in San Francisco, New York or Amsterdam.<br><br>---- What the Candidate Will Do ----<br><br><ul><li><strong>Merchant Experience:</strong> Obsess about improving the experience of our Merchants and Account Managers. Design and scale our processes across the entire Merchant lifecycle.</li><li><strong>Merchant Growth</strong>: Own and drive strategy and scaled levers for our Merchant growth offerings, including catalogue &amp; photography, advertisements, and co-marketing campaigns.</li><li><strong>Develop a talented team:</strong> Build rockstars who are trained, motivated, and empowered by you to deliver towards our ambitous goals.</li><li><strong>Build Roadmaps:</strong> Work with the Head of Operations to set the direction and define the strategy and roadmap for Merchant Operations.</li><li><strong>Project &amp; Process Management:</strong> Whether it's a one-off project or an ongoing process, you're chasing operational efficiencies and build foundations that scale with our rapid business and merchant growth</li><li><strong>Stakeholder Management:</strong> Your will coordinate a variety of initiatives and projects across Account Management, Support, Procurement, Product, and other stakeholders.</li></ul><br>---- Basic Qualifications ----<br><br><ul><li>Minimum of 5 years of relevant experience within a similar position in a competitive e-commerce environment (Scale-ups, Start-ups)</li><li>Bachelor or advanced degree in Business Administration, Marketing, Economics, Engineering, Finance, or equivalent</li><li>Executional excellence, you've a strong attention to detail, plan and track your team's progress with OKRs</li><li>Excellent written and verbal communication skills, and demonstrated ability to influence and gain consensus with senior stakeholders</li><li>Strong analytical skills + proficient in using Excel</li><li>A minimum of 2 years of relevant experience in managing a team</li><li>Ideally, knowledge of SQL, experience in using Python to build automation and small applications</li><li>Experience in owning budgets and managing your own P&amp;L</li><li>Fluency in English. Fluency German is not required but a strong plus</li></ul><br>We welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and let's move the world forward, together.<br><br>Offices continue to be central to collaboration and Uber's cultural identity. Unless formally approved to work fully remotely, Uber expects employees to spend at least half of their work time in their assigned office. For certain roles, such as those based at green-light hubs, employees are expected to be in-office for 100% of their time. Please speak with your recruiter to better understand in-office expectations for this role.<br><br>*Accommodations may be available based on religious and/or medical conditions, or as required by applicable law. To request an accommodation, please reach out to accommodations@uber.com.</p>", "name": "Merchant Operations Lead, Uber Eats, Germany", "type": "external", "publication_date": "2024-03-01T00:25:23Z", "short_name": "merchant-operations-lead-uber-eats-germany", "model_type": "jobs", "id": 14082903, "locations": [{"name": "Berlin, Germany"}], "categories": [{"name": "Data and Analytics"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/uber/merchant-operations-lead-uber-eats-germany"}, "company": {"id": 61, "short_name": "uber", "name": "Uber"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li></li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.50 - $19.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "store associate", "type": "external", "publication_date": "2024-03-08T12:15:28Z", "short_name": "store-associate-322e0d", "model_type": "jobs", "id": 13185915, "locations": [{"name": "Lafayette, CA"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-322e0d"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}], "aggregations": {}}]
