{
  "contents": "<p><strong>Mechanical Assembler</strong><br><br>Siemens is a global technology powerhouse that has stood for engineering excellence, innovation, quality, reliability, and internationality for more than 165 years. Siemens Smart Infrastructure is seeking an Mechanical Assembler for our Electrification and Automation (EA) Business Unit working with the Low Voltage Motor Control Center product.<br><br>As a Mechanical Assembler you will be responsible for the building, assembling, and wiring of Medium and Low Voltage Electrical Distribution Equipment, such as LV Motor Control Centers, MV breakers, MV switchgear and Motor Control Centers, DC Electrical Vehicle Chargers and Solar Inverters.<br><br><strong>Responsibilities</strong>:<br><br><ul><li>Assembly and wire LV MCC breakers, structures, sub-assemblies, parts kits, and aftermarket parts orders</li><li>Perform Sub assembly work including mechanical assembly of steel and components, control wiring, power cable work, and interconnection of control wires</li><li>Record appropriate job record transactions</li><li>Read BOM, follow layouts &amp; assembly drawings,</li><li>Perform some basic wiring per given instructions when requested</li><li>Set and correct use of Torque wrenches</li><li>Adhere to developed processes, methods and/or seek ways to improve</li><li>Must adhere to all safety rules and keep safety first for self and others</li><li>Perform miscellaneous other duties as assigned by Supervisor or Management</li></ul><br><strong>Requirements: knowledge/skills, education, and experience:</strong><br><br><ul><li>High School Diploma or GED</li><li>1+ years of experience performing mechanical assembly or experience in the mechanical field</li><li>1+ years' experience wiring in commercial or industrial applications</li><li>Must be able to lift parts or sub-assemblies that weigh up to 50 lbs. occasionally</li><li>Communicate in English (read, write &amp; speak fluently)</li><li>Must be able to Identify mechanical parts and electrical components</li><li>Experience with using a tape measure and other measuring devices</li><li>Must have extensive experience working with standard hand and power tools, both pneumatic and battery operated, 1 to 3 years</li><li>Must have knowledge of torque wrench and applied torque values</li><li>Must have a proven record in Quality and Productivity</li><li>Must be a strong team player</li><li>Conform with Environmental and Occupational Health and Safety policy and Management System and strive to continual improve the intended outcomes of the Management System.</li></ul><br><strong>Preferred </strong><strong>knowledge/skills, education, and experience</strong><br><br><ul><li>Forklift driver experience</li><li>SAP experience</li><li>Associates Degree or technical training in area of responsibility.</li></ul><br><strong>Benefits:</strong><br><br>In addition to the growth and development opportunities we continue to foster, we offer included benefits of PTO, a matching 401K plan, stock share match, health, life, vision and dental benefits, paid parental leave, and so much more.<br><br><strong>About Smart Infrastructure - Electrification &amp; Automation:</strong><br><br>The Electrification and Automation (EA) Business Unit offers the full range of energy distribution systems and solutions for all markets and through all sales channels. We provide reliable power distribution grids of today while investing into our Future Grids portfolio and applications to create the power distribution grid of the future. Our comprehensive portfolio meets the growing technical requirements of todays and tomorrow's power grid!<br><br>At Siemens, we live and foster an ownership culture, in which every employee takes personal responsibility for professional growth &amp; development and our company's success. We strive to transform the everyday for our customers, employees, and society by:<br><br><ul><li>Trusting and empowering our leaders to act as owners, directing their teams, and innovating to succeed.</li><li>Communicating openly and honestly to learn from our failures and celebrate our successes.</li><li>Recognizing individual and team achievements frequently</li><li>Our focus on investment in our team members, offering a wide variety of internal and external development opportunities.</li><li>Our commitment to diversity, equity, and inclusion</li></ul><br>Can <strong>you</strong> see yourself, learning, growing, and succeeding here? If so, we'd like to meet you! Apply today and learn how you can be a part of the Siemens family.<br><br>Qualified Applicants must be legally authorized for employment in the United States. Qualified Applicants will not require employer sponsored work authorization now or in the future for employment in the United States.<br><br>#LI-BJ1<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>",
  "name": "Mechanical Assembler - 1st Shift",
  "type": "external",
  "publication_date": "2023-04-26T23:41:35Z",
  "short_name": "mechanical-assembler-1st-shift-0a7d96",
  "model_type": "jobs",
  "id": 11259124,
  "locations": [
    {
      "name": "Clayton, NC"
    }
  ],
  "categories": [
    {
      "name": "Software Engineering"
    }
  ],
  "levels": [
    {
      "name": "Senior Level",
      "short_name": "senior"
    }
  ],
  "tags": [],
  "refs": {
    "landing_page": "https://www.themuse.com/jobs/siemens/mechanical-assembler-1st-shift-0a7d96"
  },
  "company": {
    "id": 11913,
    "short_name": "siemens",
    "name": "Siemens"
  }
}
