{"page": 8, "page_count": 15774, "items_per_page": 20, "took": 14, "timed_out": false, "total": 315477, "results": [{"contents": "<p>Siemens Digital Industries Softwareis a leading provider of solutions for the design, simulation, and manufactureof products across many different industries. Formula 1 cars, skyscrapers,ships, space exploration vehicles, and many of the objects we see in our dailylives are being conceived and manufactured using our Product LifecycleManagement (PLM) software.<br><br>Act as part of a ProfessionalServices team, work productively with Consultants, Solution Architects, ProjectManagers, and other internal &amp; external interfaces to ensure that thecustomer succeeds in their objectives. As a specialist resource, responsiblefor consulting, advising, recommending, designing, and where appropriatedeploying, specific technical solutions based on own specialist productknowledge and best practices in the subject area, for standard projects incountry, in order for the Siemens PLM Software solution to be deliveredsuccessfully and provide value to the customer. In line with project processesand messaging, interact with the customer to support the management of customerexpectations and support customer adoption. Consult on moderate to complexprojects/assignments of diverse scope that require specialist expertise. Workunder self management within project and/ or task constraints and determinesolutions, methods and procedures on assignments/projects. Where required leadSolution Leadership elements of the PLM deployment framework Where required,act as project technical work stream lead for specific project work streams onsmall to medium projects requiring a full time specialist resource, and supportproject management activities such as estimating, work package breakdown andproject planning and monitoring, where required. Support larger and morecomplex projects on dedicated product related expert topics typically for alimited timeline. Provides guidance and mentoring on the design, configuration,development and deployment of single-domain technical solutions toImplementation Consultants and Associate Consultant's in a single productwithin the Country organization where appropriate. Actively participate inCountry Communities of Practice, in own area of specialist knowledge, andcontribute to the definition of new, and maintenance of existing, bestpractices and templates, providing experiences to support continualimprovement. Leverage relevant best practices and templates in the provision ofconsulting to Country project teams.<br><br><strong>Experience</strong> - 15+ Years <br><br>Have experience in leading timeframe estimates, work-package breakdown, capability definitions and quantity ofresources estimates required to successfully implement the project.<br><br>Worked on technical support for PoC&amp; demonstration/prototypes.<br><br>Led quality improvement initiativesmeasures.<br><br>Undertook solution design reviews,code reviews, configuration management and technical documentation for theproject.<br><br>Have created required architectureand designs for the solution.<br><br>Led and guide the creation ofrelevant functional and non-functional requirement specifications and SolutionOutlines/Technical Proposal<br><br>Used the Delivery Frameworkapplicable for the project and propagate throughout the project team tooptimize project execution.<br><br>Provided oversight of all requiredfunctional/non-functional/ integration and systems testing.<br><br>Led the interaction and act asescalation point for issues reported by customer.<br><br>Mentor others as authority for ownspecialist domain.<br><br><strong>Mandatory Skills</strong>:<br><br>Teamcenter Installation 2 Tier, 4Tier<br><br>Teamcenter - Active Workspaceexperience will add an advantage.<br><br>Prepare Deployment Package<br><br>ITK or RAC customization<br><br>BMIDE Configuration<br><br>Teamcenter Configuration, such asColumn Configuration, Stylesheets and Reports, Configuration of Workflowhandlers<br><br>Teamcenter Core Modules such asAccess Manager, Query Builder, Organization, Structure Manager, Workflow<br><br>Design of Workflow, ACLs inworkflows<br><br>PLMXML, Document Management, BOMManagement<br><br>Change Management, ScheduleManagement<br><br>Preparation of Functional and DesignDocuments<br><br>Preparation of Unit test plans<br><br>Estimates on various functionalities<br><br>Prepare and Present to stakeholders<br><br>Problem Solving Skills<br><br>Good Communication with rightAttitude<br><br>Learning<br><br>Proposals development<br><br><strong>Good to Have - </strong><br><br>Integrations<br><br>Java or C or C++ programming<br><br>Dispatcher knowledge<br><br>ITAR or ADA<br><br>Upgrade/Migration knowledge<br><br>Siemens Software Where today meets tomorrow<br><br>#DISW<br><br>#LI-PLM<br><br>#LI-Hybrid<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry Software (India) Private Limited<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Product Architect - Teamcenter", "type": "external", "publication_date": "2023-04-18T23:40:33Z", "short_name": "product-architect-teamcenter-46a5ee", "model_type": "jobs", "id": 9716419, "locations": [{"name": "Hyderabad, India"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/product-architect-teamcenter-46a5ee"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>AtSiemens Digital Industries Software, you will join a global team that's drivingthe future of marketing. We are looking for a dynamic and experienced Program Managerto lead, plan, manage, execute, and monitor our business wide Go-to-Market(GTM) strategic projects.<br><br>The GTMProgram Manager is a global team member that will lead a variety of significantand strategic programs as part of a cohesive unit. This position requires anindividual who has extensive marketing knowledge and a thorough understandingof marketing processes. This individual role is responsible for overseeing andidentifying the needs of our programs and can include direction for teammembers, organizing and managing projects, and implementing standardizedprocesses and programs around marketing campaign activities in the areas ofstrategy, management, reporting, and quality.<br><br>Must beable to work closely with management and executives to report on status, risks,and KPIs.<br><br>To besuccessful in this role, you should be able to ensure stakeholders'accountability to meet project deadlines and that program teams deliver againstall requirements.<br><br><strong>KeySkills and Responsibilities</strong><br><br><ul> <li>Manage     and drive significant Marketing programs across Siemens' businesses     supporting our Go-to-Market strategies</li> <li>Lead     program and project management processes consisting of project scope     documentation, planning risk management strategies, creating project     schedules and communication plans, holding performance conversations,     reporting project statuses, managing scope change, and documenting lessons     learned</li> <li>Exceptional     communication skills and the ability to work flexibly with international     and remote team members as well as internal stakeholders and management</li> <li>Owns     reporting and dashboard on status, risk, quality, and performance for     project or process managed</li> <li>Identifies     work for project team, provides feedback for reviews on performance and     progress against targets for team</li> <li>Works     with management to agree on KPIs as they affect the project or process,     discuss strategic approach and suggest areas for improvement</li> <li>Works     closely with internal customers, including product marketing, field/execution     marketing, marketing communications, and marketing service centers, to     facilitate deliverables and provide guidance on initiatives</li></ul><br><strong>RequiredQualifications</strong><br><br><ul> <li>Bachelor's     degree </li> <li>Extensive     Marketing experience (5+ years)</li> <li>Program     and/or project management experience</li></ul><br><strong>WorkingConditions/Physical Requirements</strong><br><br><ul> <li>Normal     office environment or working remotely</li><li>Minimaltravel required (less than 15%)</li></ul><br>At Siemens we are always challengingourselves to build a better future.  We need the most innovative anddiverse Digital Minds to develop tomorrow's reality.  Find out more aboutthe Digital world of Siemens here:  www.siemens.com/careers/digitalminds<br><br>#LI-PLM <br><br>#DISW<br><br>#LI-Remote<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry Software Limited<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Go-to-Market Program Manager", "type": "external", "publication_date": "2023-05-11T23:41:41Z", "short_name": "gotomarket-program-manager-245079", "model_type": "jobs", "id": 11336857, "locations": [{"name": "Flexible / Remote"}, {"name": "London, United Kingdom"}], "categories": [{"name": "Management"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/gotomarket-program-manager-245079"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>Specjalista/ka ds. Produktu</strong><br><br><strong>Lokalizacja: cała Polska</strong><br><br>Jako Siemens Healthineers wspieramy i pomagamy skutecznie sprostaćwyzwaniom współczesnej medycyny na całym świecie.  Wciąż poszukujemy nowych dróg i rozwiązań,aby wprowadzać pozytywne zmiany dla naszych klientów oraz zdrowia wielu ludzi.<br><br>Żeby sprostać temu wyzwaniu, inwestujemy nie tylkow rozwój technologii i tym samym w szerokie portfolio nowatorskich  produktów i usług medycznych - inwestujemyprzede wszystkim w 68 tys. osób pracujących w naszej organizacji. <br><br>Dołącz do zespołu Siemens Healthineers!<br><br><strong>Do Twoich głównych zadań będzie należeć:</strong><br><br><ul><li>Wsparcie zespołusprzedaży w zakresie produktów Siemens Healthineers (diagnostyka obrazowa,zabiegi małoinwazyjne),</li><li>Przeprowadzanieprezentacji u klientów,</li><li>Przygotowywanieanaliz i ofert dla klientów, </li><li>Prowadzenie  analiz przetargów i przygotowanie materiałówprzetargowych</li><li>Opracowywaniestrategii sprzedaży w  zakresieprzypisanych produktów,</li><li>Analiza rynku,konkurencji,</li><li>Budowanie irozwijanie dobrych relacji z współpracownikami oraz klientami.</li></ul><br><strong>Zaaplikuj na tostanowisko, jeżeli posiadasz:</strong><br><br><ul><li>Praktycznąznajomości rynku medycznego,</li><li>Znajomośćdiagnostyki obrazowej ze szczególnym uwzględnieniem obszaru systemówzabiegowych: angiografia, ramiona C śródoperacyjne, urządzenia wspomagające</li><li>Wykształceniewyższe techniczne lub medyczne,</li><li>Dobrą znajomościjęzyka angielskiego (min. B2), </li><li>Bardzo wysokorozwinięte zdolności komunikacyjne i łatwość budowania relacji z Klientami,</li><li>Dyspozycyjność doczęstych podróży służbowych na terenie Polski oraz czynne prawo jazdy kat. B</li><li>Samodzielność orazinicjatywę w działaniu,</li><li>Chęć do nauki,rozwoju i ciągłego pogłębiania wiedzy.</li></ul><br><strong>Oferujemy:</strong><br><br><ul><li>Umowę o pracę zmiędzynarodowej korporacji</li><li>Pakiet benefitów(m.in. kafeteria benefitów, opieka medyczna, karta Multisport, dodatkowe dniwolne)</li><li>Samochód służbowy zmożliwością użytku prywatnego </li><li>Szkoleniaproduktowe oraz dostęp do platformy z bogatą ofertą kursów e-learningowych</li><li>Dużą samodzielnośćw planowaniu i realizowaniu zadań</li></ul><br><strong>Osobyzainteresowane prosimy o składanie aplikacji przez przycisk \"Aplikuj\".</strong><br><br><strong>Nasza kultura:</strong><br><br>W Siemens Healthineers uwzględniamy różne perspektywy, jesteśmy otwarcina rozmowę, rzucamy wyzwanie konwencjom. Zmiana jest nieodłącznym elementemnaszej pracy. Dążymy tego, aby być liderem zmian w naszej branży, a nie tylkoreagować na nie. Dlatego zapraszamy Cię do podjęcia z nami nowych wyzwań,testowania swoich pomysłów i świętowania sukcesów. <br>Bardzo cenimy różnorodność, integrację i równe szanse, dlatego gorącozapraszamy wszystkie osoby, niezależnie od identyfikacji płciowej, do ubieganiasię o to stanowisko. Zachęcamy do aplikowania również osoby zniepełnosprawnością.  <br><br><strong>Chcesz dowiedzieć się więcej? Skontaktuj się znami.</strong><br><br>Pod adresem https://www.siemens-healthineers.com/pl/ znajdziesz dodatkowe informacje dotycząceobszaru naszej działalności. <br><br>Dbamy o prywatność Twoich danych i poważnie traktujemy działanie zgodne zRODO, a także innymi przepisami dotyczącymi ochrony danych osobowych. Z tegowzględu prosimy o nie wysyłanie nam CV ani innych dokumentów aplikacyjnyche-mailem. Zamiast tego prosimy o utworzenie swojego profilu na naszym portalu Karierahttps://jobs.siemens-healthineers.com/careers, który umożliwia przesłanie dokumentów izgłoszenie kandydatury na otwarte stanowiska oraz uzyskanie informacjidotyczących naszych ofert pracy i rozwoju kariery w firmie Siemens.<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Healthcare Sp. z o.o.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Specjalista/ka ds. Produktu", "type": "external", "publication_date": "2023-04-27T23:37:40Z", "short_name": "specjalistaka-ds-produktu-fb7a4b", "model_type": "jobs", "id": 11265188, "locations": [{"name": "Środa Wielkopolska, Poland"}], "categories": [{"name": "Unknown"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/specjalistaka-ds-produktu-fb7a4b"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>#GreatMindsDon'tThinkAlike</strong> At Uber, we take pride in our diversity and working environment that sees you as more than just a person that can do the job, but a unique individual that can level up our organization with a perspective only you can offer. Uber provides a truly open culture that encourages all to voice their thoughts. (Diversity Statement)<br><br><strong>About The Team</strong><br><br>Uber Advertising's vision is to offer the most marketplace-centric advertising to connect Uber's platform users (eaters, riders, and earners) with advertisers. Uber Advertising's platform brings together its mobility and delivery channels for performance and brand campaigns, enabling advertisers to engage with our consumers through the entire marketing funnel - from awareness through purchase to loyalty and advocacy for Uber users.<br><br><b>GoGetIt embodies the attitude and mindset of Delivery at Uber. We need to ensure that we are growing all sides of our marketplace (merchants, driver partners), so that we can provide the best customer experience possible for our consumers, as well as facilitating growth and earnings for our merchants and drivers.</b><br><br><strong>About The Role</strong><br><br>We have set up a new Uber Advertising division to spearhead the growth of our advertising business. By building a dedicated advertising organization and a suite of advertising products, Uber Advertising will enable merchants and brands to reach and convert its highly engaged user base across its Mobility and Delivery platforms in 32 markets.<br><br>As an Ads Partner Manager, you will work closely with our largest brand partners in Japan to drive Advertising campaign execution and success across our advertising platforms. You will be an Ads platform expert who can authoritatively speak to our marketing partners about Uber's Ads offerings and how our products can deliver on their marketing objectives. You will report to the Head of Ad Sales, Japan.<br><br><strong>Your Impact in Role:</strong><br><br><ul><li>Create long-term value for Uber's advertising partners through your sophisticated understanding of clients' marketing goals and challenges and proactively recommend solutions that support them</li><li>Increase campaign effectiveness by leading kick off calls to understand campaign specifications and discuss complex executions</li><li>Deliver advertiser ROI by providing exceptional data-driven campaign reporting to support advertisers as they quantify advertising investment impact on business outcomes</li><li>Unlock incremental wins for our clients, consulting on how to adjust tactics based on marketing goals and performance trends.</li><li>Uncover opportunities to lift campaign performance and increase investment by analyzing data and pitching these to the broader internal account team. Bringing your analytical A-game. Develop methodology to highlight trends and provide meaningful insights to partners, as well as track the impact of initiatives against your customer's goals</li><li>Help launch exciting new formats and capabilities and drive global impact initiatives. Expand product adoption. Clearly communicate the value of our newest products with a lens of creativity to differentiate our offerings</li></ul><br><strong>The Experience You'll Bring:</strong><br><br><ul><li>Experience managing and analyzing digital advertising campaigns for Enterprise level brands</li><li>Experience working with large, complex Enterprise brands and organizations</li><li>Ability to analyze, review results, and propose recommendations</li><li>Ambitious self-starter who enjoys being challenged and continuous learning</li><li>Sense of urgency, resourcefulness, and a go-getter mentality. You are comfortable working in a fast-paced environment, problem solving and navigating ambiguity</li></ul><br><strong>Basic Qualifications:</strong><br><br><ul><li>Ability to build and execute strategic sales plans that result in success for our partners and Uber</li><li>Creative storyteller with the ability to utilize data to quantify opportunities and influence decision makers</li><li>Strong leadership ability</li><li>Excellent listening, communication, and organizational skills</li><li>Speed, resourcefulness, and a go-getter mentality. You are comfortable working in a fast-paced environment and navigating ambiguity</li></ul><br>What's in it for you? Culture &amp; benefits<br><br>Uber's culture and values are at the core of everything we do, so that our employees can better understand who we are and what it's like to work at Uber today. We pride ourselves on the amazing team we've built. The driver behind all of our growth, our bold and disruptive brand, and the game changing technology we bring to life is the people that make Uber, #OneUber.<br><br>Doing your best work means being your best self. We offer a wide range of benefits and perks that are uniquely Uber to support your health and wellbeing. These benefits have been designed with #OneUber in mind, supporting the whole you and the way that you work best.<br><br>Unsure if this role is the right fit for you?<br><br>We encourage you to review the details of the job role and imagine how you can impact not only our organization but the world using your unique talents. We reimagine the way the world moves for the better. Even if you do not fit all of the criteria for the role, we welcome you to apply to explore opportunities within Uber.　||<br><br><strong>#GreatMindsDon'tThinkAlike</strong> Uberでは、社員が職場での多様性と労働環境に誇りを持って仕事をしています。それは社員が単に仕事のために働いているからではなく、彼らひとりひとりの持つユニークな視点を活かして会社をより高いレベルの組織に引き上げる環境があると考えているからです。<br><br><strong>#GoGetIt</strong> は、Uberにおけるデリバリーの姿勢と考え方を体現しています。私たちの提供するマーケットプレイスでは、消費者、加盟店、ドライバーパートナーを含むあらゆる側面での成長が必要です。そのためには消費者に最高のカスタマーエクスペリエンスを提供するとともに、加盟店とドライバーの成長と収益を促進する必要があります。<br><br><strong>Uber Advertisingチームについて</strong><br><br>Uber Advertisingが目指すのは、Uberのマーケットプレイスに最も則した広告手法で広告主とUberの利用者に最高の出会いを提供することです。そのためUber Advertisingは、モビリティとデリバリーのプラットフォームサービスを束ねることでブランド向けからパフォーマンス向けにUber独自の広告キャンペーンを設定・配信可能にしました。これにより、利用者からの認知獲得、購入促進、ロイヤリティ維持、ブランド支持に至るまでUberのプラットフォーム全体をマーケティング・ファネルと捉え、広告主と利用者のつながりの場を作れるようになりました。<br><br><strong>Partner Managerについて</strong><br><br>Uberはこれまでの広告サービスをより成長拡大させるために、新たにUber Advertising部門を立ち上げました。専門の広告組織と広告商品群を用意することで、Uber Advertisingは、国内外32の市場でモビリティとデリバリーサービスプラットフォーム上で広告展開をしています。これによりUber加盟店や広告主ブランドは、Uber上で高いエンゲージメントが見込まれるユーザーベースの発見・開発ができます。<br><br>Uber Advertisingのパートナーマネージャーとして、あなたは国内でも有数のブランドと密接に連携し、Uberのサービスプラットフォーム上での広告キャンペーンの実行とその成功を促進します。広告のエキスパートとして、Uberが提供する広告プロダクト・サービスがマーケティング目標にどのように貢献するのかを自信を持って提案していきます。今回募集のPartner Managerは日本の広告営業本部長の直属となります。<br><br><strong>Partner Managerがもたらすインパクト</strong><br><br><ul><li>広告主のマーケティング目標や課題を理解し、それをサポートするソリューションを積極的に提案することで、Uber Advertisingの広告主や広告パートナーに長期的な価値を生み出します。</li><li>キャンペーンブリーフィングの場をリードする役として、キャンペーンの詳細把握と実装方法について深く議論を行い、キャンペーンの効果を高めます。</li><li>Uberの独自データに基づくキャンペーンレポートを提供し、広告投資がビジネスに与える影響・成果を定量的に説明することで、広告主のROI目標を達成をサポートします。</li><li>マーケティング目標や広告パフォーマンスの傾向に基づいて打ち手を調整する方法をコンサルティングし、クライアントの期待を超える成果をもたらします。</li><li>データを分析し、社内のアカウントチームと連携しながら、キャンペーンのパフォーマンスを向上させ、投資を増やす機会を捉えます。重要な傾向を浮き彫りにして広告主やパートナーに有意義なインサイトを提供する手法を開発する、目標に対する広告活動のインパクトを追跡するなど、あなたの分析力を存分に発揮してください。</li><li>新しく開発される画期的な広告フォーマット・機能の導入を支援し、その利用を促進します。広告製品の特性が差別化につながるよう、その価値を明確かつ想像力を使って伝えます。</li></ul><br><strong>必須な能力</strong><br><br><ul><li>広告主、パートナー、Uberに成功をもたらす営業戦略を立案し、実行する能力を有すること。</li><li>ビジネス機会を定量的に捉え、データを活用して意思決定者を説得する能力を持つ論理的なストーリーテラーであること。</li><li>高い分析力と総合力を発揮できること 。</li><li>傾聴する姿勢をもち、コミュニケーション通して周りをとりまとめる力を発揮できること。</li><li>チーム環境で働くことを楽しみ、プロ意識の高いチーム文化を共に築けること。</li></ul><br><strong>関連する経験 ・実績</strong><br><br><ul><li>企業ブランドのデジタル広告キャンペーンの管理・分析経験。</li><li>大規模で複合的な企業ブランドや組織に対する営業経験。</li><li>分析、効果検証、提案の能力</li><li>自ら進んで動く、新しいことに挑戦する、継続的に学ぶ姿勢。</li><li>すぐ行動に移す、臨機応変に対応する、何事もやり抜こうとする気持ちと行動力。 変化の大きいビジネス環境の中で、恐れずに問題解決や意思決定をしていくこと。</li></ul><br><b>GreatMindsDon'tThinkAlike At Uber, we take pride in our diversity and working environment that sees you as more than just a person that can do the job, but a unique individual that can level up our organization with a perspective only you can offer. Uber provides a truly open culture that encourages all to voice their thoughts. (Diversity Statement)</b><br><br>About The Team<br><br>Uber Advertising's vision is to offer the most marketplace-centric advertising to connect Uber's platform users (eaters, riders, and earners) with advertisers. Uber Advertising's platform brings together its mobility and delivery channels for performance and brand campaigns, enabling advertisers to engage with our consumers through the entire marketing funnel - from awareness through purchase to loyalty and advocacy for Uber users.<br><br><b>GoGetIt embodies the attitude and mindset of Delivery at Uber. We need to ensure that we are growing all sides of our marketplace (merchants, driver partners), so that we can provide the best customer experience possible for our consumers, as well as facilitating growth and earnings for our merchants and drivers.</b><br><br>About the Role<br><br>We have set up a new Uber Advertising division to spearhead the growth of our advertising business. By building a dedicated advertising organization and a suite of advertising products, Uber Advertising will enable merchants and brands to reach and convert its highly engaged user base across its Mobility and Delivery platforms in 32 markets.<br><br>As an Ads Partner Manager, you will work closely with our largest brand partners in Japan to drive Advertising campaign execution and success across our advertising platforms. You will be an Ads platform expert who can authoritatively speak to our marketing partners about Uber's Ads offerings and how our products can deliver on their marketing objectives. You will report to the Head of Ad Sales, Japan.<br><br>Your Impact in Role:<br><br><ul><li>Create long-term value for Uber's advertising partners through your sophisticated understanding of clients' marketing goals and challenges and proactively recommend solutions that support them</li><li>Increase campaign effectiveness by leading kick off calls to understand campaign specifications and discuss complex executions</li><li>Deliver advertiser ROI by providing exceptional data-driven campaign reporting to support advertisers as they quantify advertising investment impact on business outcomes</li><li>Unlock incremental wins for our clients, consulting on how to adjust tactics based on marketing goals and performance trends.</li><li>Uncover opportunities to lift campaign performance and increase investment by analyzing data and pitching these to the broader internal account team. Bringing your analytical A-game. Develop methodology to highlight trends and provide meaningful insights to partners, as well as track the impact of initiatives against your customer's goals</li><li>Help launch exciting new formats and capabilities and drive global impact initiatives. Expand product adoption. Clearly communicate the value of our newest products with a lens of creativity to differentiate our offerings</li></ul><br>Basic Qualifications<br><br><ul><li>Perform the ability to build and execute strategic sales plans that result in success for our partners and Uber</li><li>Be the logical storyteller with the ability to utilize data to quantify opportunities and convince decision makers</li><li>Demonstrate strong analytical and synthesizing ability</li><li>Provide excellent listening, communication, and organizational skills</li><li>Enjoy working in a team environment and build professional team culture together</li></ul><br>The Experience You'll Bring:<br><br><ul><li>Experience managing and analyzing digital advertising campaigns for Enterprise level brands</li><li>Experience working with large, complex Enterprise brands and organizations</li><li>Ability to analyze, review results, and propose recommendations</li><li>Ambitious self-starter who enjoys being challenged and continuous learning</li><li>Sense of urgency, resourcefulness, and a go-getter mentality. You are comfortable working in a fast-paced environment, problem solving and navigating ambiguity</li></ul><br>We welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and let's move the world forward, together.<br><br>Offices continue to be central to collaboration and Uber's cultural identity. Unless formally approved to work fully remotely, Uber expects employees to spend at least half of their work time in their assigned office. For certain roles, such as those based at green-light hubs, employees are expected to be in-office for 100% of their time. Please speak with your recruiter to better understand in-office expectations for this role.<br><br>*Accommodations may be available based on religious and/or medical conditions, or as required by applicable law. To request an accommodation, please reach out to accommodations@uber.com.</p>", "name": "Partner Manager (Account Manager) , UberEats Enterprise, Advertising Japan", "type": "external", "publication_date": "2024-03-01T00:25:23Z", "short_name": "partner-manager-account-manager-ubereats-enterprise-advertising-japan-4fdf39", "model_type": "jobs", "id": 13534962, "locations": [{"name": "Tokyo, Japan"}], "categories": [{"name": "Account Management"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/uber/partner-manager-account-manager-ubereats-enterprise-advertising-japan-4fdf39"}, "company": {"id": 61, "short_name": "uber", "name": "Uber"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:32:17Z", "short_name": "pharmacy-technician-55dea2", "model_type": "jobs", "id": 13969458, "locations": [{"name": "Phoenix, AZ"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-55dea2"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:32:18Z", "short_name": "shift-supervisor-trainee-3320a7", "model_type": "jobs", "id": 13946723, "locations": [{"name": "Belleair Bluffs, FL"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-3320a7"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Operations Manager is a member of the Store Management team, and as such, fulfills the company purpose of helping people on their path to better health by driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. Under the supervision of the Store Manager, the Operations Manager will maintain an engaged, productive store team through strong leadership, demonstrating initiative and leading by example.<br><br>The Operations Manager is responsible for supporting the Store Manager in the total leadership and strategic operation of a CVS/pharmacy store including:<ul><li>Overall store management, supervision, and policy implementation</li><li>Sales and inventory management</li><li>Employee staffing, training, and development</li><li>Financial management</li><li>Customer service leadership</li></ul>Unlike the Store Manager in Training position, the Operations Manager position is not part of the CVS/pharmacy Retail Management Development Program. Operations Managers are not eligible for direct promotion to Store Manager. Candidates with a short-term goal of becoming a CVS Store Manager should instead apply for Store Manager in Training openings.<br><br>Essential Functions:<br><br>1. Management<br><br>Lead others and work effectively with store crews<br><br>Supervise, assign and direct activities of the store's crew<br><br>Effectively communicate information to store crew and supervisors in an open and timely manner<br><br>Support Store Manager with actions plans for operational and service improvement<br><br>2. Customer Service<br><br>Assist customers with their questions, problems and complaints<br><br>Promote CVS customer service culture (greet, offer help, and thank)<br><br><b>Required Qualifications</b><ul><li>Deductive reasoning ability, advanced analytical skills and computer skills.</li><li>Advanced communication skills, leadership, supervision, and influencing skill</li><li>Ability to work a full-time flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed, and to respond to urgent issues at the store when they arise</li></ul><b>Preferred Qualifications</b><ul><li>Experience as a retail manager or supervisor</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$17.00 - $25.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Operations Manager", "type": "external", "publication_date": "2024-03-17T12:42:26Z", "short_name": "operations-manager-8705c4", "model_type": "jobs", "id": 13555009, "locations": [{"name": "Manitowoc, WI"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/operations-manager-8705c4"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br> o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br> o Actively look for ways to help people, and do so in a friendly manner<br> o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br> o Use and understand verbal and written communication to interact with customers and colleagues<br> o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br> o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br> o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br> o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br> o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:45:18Z", "short_name": "pharmacy-technician-f8c9eb", "model_type": "jobs", "id": 13185835, "locations": [{"name": "Coppell, TX"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-f8c9eb"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:45:17Z", "short_name": "pharmacy-technician-3b0f1d", "model_type": "jobs", "id": 13340004, "locations": [{"name": "Allen, TX"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-3b0f1d"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Operations Manager is a member of the Store Management team, and as such, fulfills the company purpose of helping people on their path to better health by driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. Under the supervision of the Store Manager, the Operations Manager will maintain an engaged, productive store team through strong leadership, demonstrating initiative and leading by example.<br><br>The Operations Manager is responsible for supporting the Store Manager in the total leadership and strategic operation of a CVS/pharmacy store including:<ul><li>Overall store management, supervision, and policy implementation</li><li>Sales and inventory management</li><li>Employee staffing, training, and development</li><li>Financial management</li><li>Customer service leadership</li></ul>Unlike the Store Manager in Training position, the Operations Manager position is not part of the CVS/pharmacy Retail Management Development Program. Operations Managers are not eligible for direct promotion to Store Manager. Candidates with a short-term goal of becoming a CVS Store Manager should instead apply for Store Manager in Training openings.<br><br>Essential Functions:<br><br>1. Management<br><br>Lead others and work effectively with store crews<br><br>Supervise, assign and direct activities of the store's crew<br><br>Effectively communicate information to store crew and supervisors in an open and timely manner<br><br>Support Store Manager with actions plans for operational and service improvement<br><br>2. Customer Service<br><br>Assist customers with their questions, problems and complaints<br><br>Promote CVS customer service culture (greet, offer help, and thank)<br><br><b>Required Qualifications</b><br><br>Deductive reasoning ability, advanced analytical skills and computer skills.<br><br>Advanced communication skills, leadership, supervision, and influencing skill<br><br>Ability to work a full-time flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed, and to respond to urgent issues at the store when they arise<br><br><b>Preferred Qualifications</b><br><br>Experience as a retail manager or supervisor<br><br><b>Education</b><br><br>High school diploma or equivalent required<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$17.00 - $29.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Operations Manager-CA", "type": "external", "publication_date": "2024-03-17T12:47:57Z", "short_name": "operations-managerca-922f2a", "model_type": "jobs", "id": 12938665, "locations": [{"name": "Livermore, CA"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/operations-managerca-922f2a"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br> o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br> o Actively look for ways to help people, and do so in a friendly manner<br> o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br> o Use and understand verbal and written communication to interact with customers and colleagues<br> o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br> o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br> o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br> o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br> o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:36:11Z", "short_name": "pharmacy-technician-2964e9", "model_type": "jobs", "id": 13894245, "locations": [{"name": "Baytown, TX"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-2964e9"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:22:26Z", "short_name": "shift-supervisor-trainee-99db2e", "model_type": "jobs", "id": 14302025, "locations": [{"name": "Midland, TX"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-99db2e"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Standort: </strong>ERL R<br><strong>Fachabteilung</strong><strong>:</strong> SHS DI MR R&amp;D HW&amp;SYS BCTX<br><strong>Art der Anstellung:</strong> <br>Befristet / <br>15h/Woche<br><br>Willst du die Zukunft des Gesundheitswesens mitgestalten? Wir bei Siemens Healthineers setzen auf Menschen, die ihre Energie und Leidenschaft diesem Ziel widmen - das sagt schon unser Unternehmensname. Siemens Healthineers steht für Pioniergeist unserer Mitarbeitenden, gepaart mit unserer langen Tradition als weltweit führender Technologiekonzern in der stets dynamischen Gesundheitsbranche.<br>Wir bieten ein flexibles und dynamisches Umfeld voller Gelegenheiten, über sich hinaus zu wachsen, um sich persönlich und beruflich weiterzuentwickeln. Klingt das interessant für dich?<br><br><strong>Dann werde Teil unseres globalen Teams als Werkstudent<em>in (w/m/d) Entwicklung der MR-Hochfrequenz Sendekette.</strong><br><br><strong>Wähle den besten Ort für deine Arbeit </strong>- im Rahmen dieser Stelle ist es in Abstimmung mit deiner Führungskraft möglich, bis zu einem durchschnittlichen Volumen von 60% der jeweiligen Arbeitszeit mobil (innerhalb Deutschlands) zu arbeiten.<br><br><strong>Deine Aufgaben und Verantwortlichkeiten:</strong><br><br><ul><li>Du unterstützt uns bei der Bestückung von Leiterplatten</li><li>Du supportest uns bei der messtechnischen Charakterisierung unserer Baugruppen und wertest Messergebnisse eigenständig aus</li><li>Du wirkst bei der Entwicklung neuer elektronischer Baugruppen mit</li><li>Du unterstützt uns bei Messgeräteautomatisierung mittels Labview</li><li>Du unterstützt uns bei Systemsimulationen in Matlab/Simulink</li></ul><br>Mehr über dieses Geschäftsfeld erfährst du unter https://www.siemens-healthineers.com/de/products-services<br><br><strong>Deine Qualifikationen und Erfahrung:</strong><br><br><ul><li>Du studierst Elektrotechnik oder Nachrichtentechnik, mindestens im 2. Fachsemester</li><li>Du hast schon erste praktische Erfahrungen im Aufbau und der Charakterisierung von Elektronik-Baugruppen sammeln können</li></ul><br><strong><br>Dein Profil und deine Fähigkeiten:</strong><br><br><ul><li>Du sprichst fließend Deutsch und Englisch </li><li>Du besitzt eine sehr ausgeprägte Methodenkompetenz in Kombination mit schneller Auffassungsgabe und Problemlösungsfähigkeit</li><li>Du bist offen für neue Ideen und hast Interesse sowohl an selbstständigem Arbeiten als auch an der Arbeit im Team? Dann bewirb dich bei uns!</li></ul><br><strong>Unser globales Team:</strong><br><br>Siemens Healthineers ist ein weltweit führendes Medizintechnikunternehmen. Mit mehr als 68.000 engagierten Mitarbeitenden in über 70 Ländern gestalten wir die Zukunft des Gesundheitswesens. Jeden Tag profitieren etwa fünf Millionen Patient</em>innen weltweit von unseren innovativen Technologien und Dienstleistungen aus den Bereichen Diagnostik und therapeutische Bildgebung, Labordiagnostik und molekulare Medizin sowie von unseren digitalen Gesundheits- und Unternehmensdienstleistungen.<br><br><strong>Unsere Kultur:</strong><br><br>Unsere Unternehmenskultur schätzt verschiedene Blickwinkel, offene Diskussionen und den Willen, Konventionen in Frage zu stellen. Ständiger Wandel gehört zu unserem Arbeitsalltag. Wir wollen in unserer Branche Veränderungen vorantreiben, statt nur darauf zu reagieren. Deswegen laden wir dich ein, dich neuen Herausforderungen zu stellen, eigene Ideen auszutesten und Erfolge zu feiern. Besuche auch unsere Karriere-Seite unter https://www.siemens-healthineers.com/de/careers<br><br>Wir legen Wert auf Diversität und Chancengleichheit und freuen uns über Bewerbungen mit vielfältigen Hintergründen und insbesondere von Menschen mit Behinderung.<br><br>Du möchtest mehr erfahren und erste Fragen gern persönlich klären - Sprich uns an: <br><br>students.func@siemens-healthineers.com<br><br>.<br><br>Wir nehmen den Schutz deiner Daten und die Einhaltung der DSGVO und anderer Datenschutzgesetze ernst. Deshalb bitten wir dich, uns deinen Lebenslauf nicht per E-Mail zu schicken. Bitte lege dir ein Profil in unserer Talent Community an, um deinen Lebenslauf hochzuladen. Daran erkennen wir, dass du an Karrieremöglichkeiten bei uns interessiert bist und können dich zu relevanten Stellen benachrichtigen. Klicke hier, um ein Profil anzulegen.<br><br>Siemens Healthineers Deutschland wurde mit dem Zertifikat Great Place to Work® ausgezeichnet.<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Healthcare GmbH<br><br><b>Experience Level:</b> Student (Not Yet Graduated)<br><br><b>Full / Part time:</b> Part-time</p>", "name": "Werkstudent*in (w/m/d) Elektronikentwicklung für MRTs", "type": "external", "publication_date": "2023-05-25T00:16:26Z", "short_name": "werkstudentin-wmd-elektronikentwicklung-fur-mrts-72ed1d", "model_type": "jobs", "id": 11427685, "locations": [{"name": "Erlangen, Germany"}], "categories": [{"name": "Unknown"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/werkstudentin-wmd-elektronikentwicklung-fur-mrts-72ed1d"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:45:18Z", "short_name": "pharmacy-technician-1f7c3e", "model_type": "jobs", "id": 13185904, "locations": [{"name": "Mount Prospect, IL"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-1f7c3e"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Art der Anstellung: </strong>Befristet; 15-20 Std./Woche <br> <br><strong>Deine Extraportion Praxis.</strong><br> <br>Wie werden wir uns übermorgen fortbewegen, miteinander kommunizieren, Energien nutzen? Lass uns gemeinsam an den Antworten arbeiten. Wir suchen dafür kluge Köpfe, die Theorie in Praxis umwandeln und clever mitdenken. Kurz: Menschen, die ihre und unsere Fragen in neue Ausrufezeichen verwandeln wollen! Als Werkstudent (w/m/d) stehen dir bei uns viele Türen offen, um dich einzubringen: Ergreife die Chance und werde Teil unseres weltweiten Netzwerks, knüpfe wichtige Kontakte und lege so den Grundstein für deine berufliche und persönliche Zukunft. Unsere Teams freuen sich auf dich.<br> <br><strong>Wir setzen um, worauf es ankommt. Das ist dein Beitrag.</strong><br><br><ul><li>Interessierst du dich für Gebäudeautomation und Gebäudetechnik und möchtest praktische Erfahrungen sammeln? Dann bist du bei uns genau richtig!</li><li>Du unterstützt unser Engineering Team bei der Entwicklung von Smart Building Lösungen</li><li>Zudem hilfst du uns bei der Umsetzung von Tools die den Inbetriebnahme Prozess vereinfachen</li><li>Du arbeitest an der Schnittstelle zwischen Sales, Execution Management und der Planungsabteilung. Dadurch erhältst du einen umfassenden Einblick in die Tätigkeiten während der unterschiedlichen Projektphasen</li><li>Auch bei der Erstellung von Regelschemata, Feldgerätelisten etc. zählen wir auf deine Unterstützung</li><li>Weitere Einblicke in Kundentermine, Bausitzungen oder dem Inbetriebnahmeablauf gebäudetechnischer Anlagen können, je nach deinen Interessen, ermöglicht werden</li></ul><br><strong>Dein Profil für \"Zukunft möglich machen\".</strong><br><br><ul><li>Derzeit studierst du erfolgreich in einer technischen Fachrichtung, idealerweise Energie- und Gebäudetechnik, und stehst uns längerfristig zur Verfügung</li><li>Im Umgang mit MS Office bist du fit</li><li>Du bringst eine gewisse IT-Affinität mit </li><li>Du hast eine schnelle Auffassungsgabe und eine analytische sowie strukturierte Herangehensweise</li><li>Du bist ein Teamplayer und punktest mit guten Deutschkenntnissen in Wort und Schrift</li><li>Und zu guter Letzt: auf dich ist Verlass, weil du ergebnisorientiert arbeitest und dein Arbeitsstil von Sorgfalt und Selbständigkeit geprägt ist</li></ul><br><strong>Dein kleiner Schritt in Richtung großartiger Siemens-Welt.</strong><br> <br><strong>www.siemens.de</strong><br><br>wenn du vor deiner Bewerbung mehr über Siemens erfahren möchtest.<br><br>Du hast Fragen zur Bewerbung? <strong>Hier</strong> findest du Antworten auf häufig gestellte Fragen.<br><br>Wenn du darüber hinaus noch Fragen hast, wende dich gerne an uns: www.siemens.de/fragenzurbewerbung<br><br><strong>www.siemens.de/karriere</strong><br>wenn du mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchtest.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br><b>Organisation:</b> Smart Infrastructure<br><br><b>Unternehmen:</b> Siemens AG<br><br><b>Erfahrungsniveau:</b> Student / Schüler<br><br><b>Voll-/Teilzeit:</b> Teilzeit</p>", "name": "Werkstudent*In (w/m/d) Smart Buildings (Engineering)", "type": "external", "publication_date": "2023-03-04T23:40:05Z", "short_name": "werkstudentin-wmd-smart-buildings-engineering-05872b", "model_type": "jobs", "id": 10976662, "locations": [{"name": "Stuttgart, Germany"}], "categories": [{"name": "Science and Engineering"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/werkstudentin-wmd-smart-buildings-engineering-05872b"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>Who You'll Work With<br></strong> <br> Global CX Centers support the delivery of the full CX portfolio with a flawless customer experience at a global efficient operating scale. They include delivering technical assistance (TAC), centralized project delivery, centralized high-touch support, sourced support, managed services, and global logistics<br> <br> The Support Services(TAC), is a team of elite technical specialists whose primary focus is to help customers deploy and operate their networks effectively while delivering the best possible customer experience. Aligned to three geographic regions, and converging into one global, borderless TAC, we are the first to be confronted by challenges and issues with new equipment and tools in the field. We provide dedicated support to our customers, partners, account teams, and other CX engineers. With a technology runway that never ends, opportunities to develop your depth, breadth and diversity of technology expertise are second to none!<br><br><strong>What You will do</strong><br><br> * Provide technical support for Cisco Cloud Security Technology portfolio to customers, partners, account teams and other internal technical support teams<br><br><em> Continually develop working knowledge of networking products and protocols to provide first/second/third level technical support on a worldwide basis via phone, email, web and remote access in designated technology focus area<br><br></em> Experience in Cisco Security Technologies like Firewall , VPN , AAA and Firepower<br><br>* Expertise in trouble shooting complex Security related issues.<br><br> * Excellent knowledge of Cisco ASA ,Firepower, ISE<br><br> * Customer facing experience is mandatory.<br><br> * Good communication skills and ability to convince and build social relationship.<br><br> * Ability to work with a multi-functional and geographically diverse team is expected<br><br><strong>Who You Are</strong><br><br> * 5+ Years in Web security / Network Security / Firewall troubleshooting Experience<br><br> * Ability to creatively apply technology to solve customer problems<br><br> * Previous Technical support, installation and customer-facing experience in the technology industry.<br><br> * CCNA security/ CCIE Security / CCNP Security or other security certification is added advantage<br><br><strong> Why Cisco</strong><br> <br> #WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.<br> <br> We embrace digital, and help our customers implement change in their digital businesses. Some may think we're \"old\" (36 years strong) and only about hardware, but we're also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do - you can't put us in a box!<br> <br> But \"Digital Transformation\" is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)<br> <br> Day to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.<br> <br> So, you have colorful hair? Don't care. Tattoos? Show off your ink. Like polka dots? That's cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!<br><br>Please note this posting is to advertise potential job opportunities. This exact role may not be open today, but could open in the near future. When you apply, a Cisco representative may contact you directly if a relevant position opens.<br><br><strong>Message to applicants applying to work in the U.S.:</strong> <br> <br>When available, the salary range posted for this position reflects the projected hiring range for new hire, full-time salaries in U.S. locations, not including equity or benefits. For non-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.<br> <br>U.S. employees have <a href=\"https://www.cisco.com/c/en/us/about/careers/we-are-cisco/benefits-and-perks.html\">access</a> to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long-term disability coverage, basic life insurance and numerous wellbeing offerings. Employees receive up to twelve paid holidays per calendar year, which includes one floating holiday, plus a day off for their birthday. Employees accrue up to 20 days of Paid Time Off (PTO) each year and have access to paid time away to deal with critical or emergency issues without tapping into their PTO. We offer additional paid time to volunteer and give back to the community. Employees are also able to purchase company stock through our Employee Stock Purchase Program.<br> <br>Employees on sales plans earn performance-based incentive pay on top of their base salary, which is split between quota and non-quota components. For quota-based incentive pay, Cisco pays at the standard rate of 1% of incentive target for each 1% revenue attainment against the quota up to 100%. Once performance exceeds 100% quota attainment, incentive rates may increase up to five times the standard rate with no cap on incentive compensation. For non-quota-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.</p>", "name": "Technical Consulting Engineer- Security/Firewall/VPN with troubleshooting", "type": "external", "publication_date": "2023-06-23T10:14:11Z", "short_name": "technical-consulting-engineer-securityfirewallvpn-with-troubleshooting", "model_type": "jobs", "id": 11593610, "locations": [{"name": "Bangalore, India"}], "categories": [{"name": "Science and Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/ciscomeraki/technical-consulting-engineer-securityfirewallvpn-with-troubleshooting"}, "company": {"id": 11799, "short_name": "ciscomeraki", "name": "Cisco Meraki"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $18.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:32:17Z", "short_name": "store-associate-293820", "model_type": "jobs", "id": 14102085, "locations": [{"name": "Greenfield, IN"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-293820"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health -from advising on prescriptions to helping manage chronic and specialty conditions.   As Pharmacy Manager, you have one of the most significant roles in our company - delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to leading and directing your Pharmacy Staff, comprised of both staff Pharmacists and Pharmacy Technicians, you are accountable for the management, oversight and operation of all aspects within your pharmacy.   This includes: <br>•  Patient Safety <br>•  Pharmacy Professional Practice  <br>•  Regulatory Requirements <br>•  Quality Assurance <br>•  Customer Service  <br>•  Personnel Management  <br>•  Inventory Management <br>•  Financial Profitability  <br>•  Loss Prevention <br>•  Workflow Management <br>A key component of the Pharmacy Manager role is keeping your customers and patients healthy through adoption and management of patient care programs.   Additionally, you will: <br>•  Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team <br>•  Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps <br>•  Identify critical business opportunities and meaningful solutions to drive growth and improve performance in your pharmacy <br>•  Successfully implement those solutions by leading your team to achieve specified goals  <br>•  Adapt to change and adjust plans to thrive in a dynamic community healthcare setting  <br>•  Seek new ways to grow, collaborate with others and deliver better outcomes  <br>•  Align others around purpose to gain support and commitment  <br>•  Facilitate a 'team' culture that promotes caring, energy, enthusiasm and pride  <br>•  Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors  <br><em>The above represents a summary of the functions of a Pharmacy Manager. Additional functions and physical requirements are available on the full job description.<br><br><b>Required Qualifications</b><br>•  Active Pharmacy License in the state in which you are employed <br>•  Not on the DEA Excluded Parties List  <br>•  Immunization Certification through an accredited organization (i.e. APhA)</em> <br>•  Listed on the pharmacy state license as the 'pharmacist in charge' <br>•  Submission of required information/documents to your state PMP administrator to register for PMP access (in states with active PMP for pharmacist use).<br><br><b>Preferred Qualifications</b><br><br><b>Education</b><br><br>Bachelor of Science in Pharmacy or Pharm. D. degree<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$65.00 - $81.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Manager", "type": "external", "publication_date": "2024-03-17T12:36:14Z", "short_name": "pharmacy-manager-8679da", "model_type": "jobs", "id": 13812214, "locations": [{"name": "Scranton, PA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-manager-8679da"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.75 - $22.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:22:28Z", "short_name": "shift-supervisor-trainee-5f131c", "model_type": "jobs", "id": 14160332, "locations": [{"name": "Fallbrook, CA"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-5f131c"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health -from advising on prescriptions to helping manage chronic and specialty conditions. As Pharmacy Manager, you have one of the most significant roles in our company - delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to leading and directing your Pharmacy Staff, comprised of both staff Pharmacists and Pharmacy Technicians, you are accountable for the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management A key component of the Pharmacy Manager role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Facilitate a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Pharmacy Manager. Additional functions and physical requirements are available on the full job description.</li><li></li><li><b>Required Qualifications</b><br>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Listed on the pharmacy state license as the 'pharmacist in charge'</li><li>Submission of required information/documents to your state PMP administrator to register for PMP access (in states with active PMP for pharmacist use).</li><li></li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$70.00 - $87.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "CA Pharmacy Manager", "type": "external", "publication_date": "2024-03-17T12:36:13Z", "short_name": "ca-pharmacy-manager-9d99b8", "model_type": "jobs", "id": 13811748, "locations": [{"name": "Huntington Park, CA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/ca-pharmacy-manager-9d99b8"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}], "aggregations": {}}