{"page": 2, "page_count": 15640, "items_per_page": 20, "took": 17, "timed_out": false, "total": 312784, "results": [{"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:27:43Z", "short_name": "pharmacy-technician-314b93", "model_type": "jobs", "id": 14099713, "locations": [{"name": "Lake Charles, LA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-314b93"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>About the Role</strong><br><br>Uber Eats is looking for an experienced e-commerce leader to manage the Merchant Operations in Germany. In this role you will partner closely with our commercial teams, as well regional and global functional teams, with the objective to make Uber Eats the preferred platform for Merchants in Germany, whether it is a Restaurant, Grocery or Retail store.<br><br>You will lead a team who optimizes the Merchant Experience among the entire lifecycle. Whether it is the onboarding of new merchants, supporting their growth through catalog optimisations, own our advertisement product, manage the performance of our commercial portfolio, improve the account management infrastructure, over the procurement of hardware or roll out of new software - your ultimate goal is to further scale and improve our Merchant experience.<br><br>We look for strong performers who can demonstrate advanced analytics, strategic thinking, project management, and team development while dealing with a wide range of stakeholders, such as Senior Leadership, Territory Managers, Finance or our Product Teams in San Francisco, New York or Amsterdam.<br><br>---- What the Candidate Will Do ----<br><br><ul><li><strong>Merchant Experience:</strong> Obsess about improving the experience of our Merchants and Account Managers. Design and scale our processes across the entire Merchant lifecycle.</li><li><strong>Merchant Growth</strong>: Own and drive strategy and scaled levers for our Merchant growth offerings, including catalogue &amp; photography, advertisements, and co-marketing campaigns.</li><li><strong>Develop a talented team:</strong> Build rockstars who are trained, motivated, and empowered by you to deliver towards our ambitous goals.</li><li><strong>Build Roadmaps:</strong> Work with the Head of Operations to set the direction and define the strategy and roadmap for Merchant Operations.</li><li><strong>Project &amp; Process Management:</strong> Whether it's a one-off project or an ongoing process, you're chasing operational efficiencies and build foundations that scale with our rapid business and merchant growth</li><li><strong>Stakeholder Management:</strong> Your will coordinate a variety of initiatives and projects across Account Management, Support, Procurement, Product, and other stakeholders.</li></ul><br>---- Basic Qualifications ----<br><br><ul><li>Minimum of 5 years of relevant experience within a similar position in a competitive e-commerce environment (Scale-ups, Start-ups)</li><li>Bachelor or advanced degree in Business Administration, Marketing, Economics, Engineering, Finance, or equivalent</li><li>Executional excellence, you've a strong attention to detail, plan and track your team's progress with OKRs</li><li>Excellent written and verbal communication skills, and demonstrated ability to influence and gain consensus with senior stakeholders</li><li>Strong analytical skills + proficient in using Excel</li><li>A minimum of 2 years of relevant experience in managing a team</li><li>Ideally, knowledge of SQL, experience in using Python to build automation and small applications</li><li>Experience in owning budgets and managing your own P&amp;L</li><li>Fluency in English. Fluency German is not required but a strong plus</li></ul><br>We welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and let's move the world forward, together.<br><br>Offices continue to be central to collaboration and Uber's cultural identity. Unless formally approved to work fully remotely, Uber expects employees to spend at least half of their work time in their assigned office. For certain roles, such as those based at green-light hubs, employees are expected to be in-office for 100% of their time. Please speak with your recruiter to better understand in-office expectations for this role.<br><br>*Accommodations may be available based on religious and/or medical conditions, or as required by applicable law. To request an accommodation, please reach out to accommodations@uber.com.</p>", "name": "Merchant Operations Lead, Uber Eats, Germany", "type": "external", "publication_date": "2024-03-01T00:25:23Z", "short_name": "merchant-operations-lead-uber-eats-germany", "model_type": "jobs", "id": 14082903, "locations": [{"name": "Berlin, Germany"}], "categories": [{"name": "Data and Analytics"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/uber/merchant-operations-lead-uber-eats-germany"}, "company": {"id": 61, "short_name": "uber", "name": "Uber"}}, {"contents": "<p><strong>Gemeinsam machen wir den Unterschied</strong><br><br><strong>Siemens Mobility</strong> ist ein eigenständig geführtes Unternehmen der Siemens AG und seit über 160 Jahren ein führender Anbieter im Bereich Mobilität. Zu unserem Kerngeschäft gehören Schienenfahrzeuge, Bahnautomatisierungs- und Elektrifizierungslösungen, schlüsselfertige Systeme sowie die dazugehörigen Serviceleistungen. Wir waren schon immer sehr innovativ, um Reisen schneller, sicherer und komfortabler zu machen. Heute brauchen wir neue Lösungen für neue Herausforderungen wie den Klimawandel und weltweit steigende Bevölkerungszahlen. Das ist es, was uns antreibt. Deshalb gestalten wir Mobilität mit Leidenschaft und sind immer einen Schritt voraus. Durch Digitalisierung machen wir Infrastrukturen intelligent und schaffen Möglichkeiten, die uns nachhaltig und nahtlos von A nach B bringen. Unsere 38.200 Mitarbeiter sind Pioniere im Mobilitätswesen, die dabei helfen, die Welt in Bewegung zu halten.<br><br><strong>Ihr neues Aufgabenfeld - herausfordernd und zukunftsorientiert</strong><br><br>Unsere Züge sind weltweit auf der Schiene im Einsatz und bringen Fahrgäste schnell und umweltfreundlich an ihr Ziel - als Systemarchitekt (w/m/d) für Onboard-Zugsicherungssysteme (ETCS) tragen Sie dazu bei, dass die Fahrzeuge den erforderlichen Sicherheitsstandards entsprechen und die Gäste sicher im Zielbahnhof ankommen.<br><br><ul><li>Dazu erarbeiten Sie sich zunächst ein umfassendes Verständnis über das System und die Software des europäischen Zugsicherungssystems ETCS.</li><li>Sie analysieren eigenverantwortlich Anforderungen aus Ausschreibungen auf deren Umsetzbarkeit und definieren die notwendigen System- und Software-Anforderungen sowie die Systemarchitektur und ggf. die Integration neuer Funktionen in das bestehende Produkt. Hierfür stimmen Sie sich mit unseren Entwicklungsabteilungen ab.</li><li>Zudem definieren und überwachen Sie selbständig Zulieferungen wie Verifikations- und Validierungsberichte, Sicherheitsnachweise sowie Gutachten und berücksichtigen enthaltene Auflagen bei der Erstellung der Systemarchitektur.</li><li>Sie sind verantwortlich für die Einschätzung der notwendigen Aufwände für die geplanten Lösungen und für die Planung der Umsetzung. Hierbei arbeiten Sie eng mit unseren Entwicklerteams und dem jeweiligen Produktmanager zusammen.</li><li>Sie bringen die Entwicklung von Zukunftsthemen, wie z.B. die Analyse und Umsetzung aktueller Security-Richtlinien, die Definition von Schnittstellen zu neuen Fahrzeug-Generationen oder den Umstieg auf eine modernere und sicherere Hardware-Plattform entscheidend voran.</li></ul><br><strong>Ihre Qualifikationen - fundiert und adäquat</strong><br><br><ul><li>Sie haben Ihr Hochschulstudium in Informatik oder einem naturwissenschaftlich-technischen Studienfach (z. B. Physik, Mathematik oder Elektrotechnik) abgeschlossen.</li><li>Zudem konnten Sie bereits langjährige Erfahrungen in der System- bzw. Softwareentwicklung sammeln; Erfahrungen in der Entwicklung von sicherungstechnischen Systemen sind von Vorteil.</li><li>Sie überzeugen mit guten Kenntnissen in der Eisenbahnsicherungstechnik, insbesondere mit ETCS.</li><li>Auch Bewerber (w/m/d) aus einer Industrie mit hohen Sicherheitsstandards (z.B. Luftfahrt oder Kraftwerkstechnik) sind willkommen.</li><li>Ihre sehr guten Deutsch- und Englischkenntnisse runden Ihr Profil ab.</li></ul><br><strong>So treten Sie mit uns in Kontakt - einfach und direkt</strong><br><br><strong>www.siemens.de/mobility</strong><br>wenn Sie vor Ihrer Bewerbung mehr über Siemens erfahren möchten.<br><strong>+49 (9131) 17 52430</strong><br>wenn Sie erste Fragen gern persönlich mit unserem Recruiting Team klären möchten. Ansprechpartner für diese Stellenausschreibung ist Herr Martin Spandel.<br><strong>www.siemens.de/karriere</strong><br>wenn Sie mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchten.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br>#LI-MS1<br><br><b>Organization:</b> Siemens Mobility<br><br><b>Company:</b> Siemens Mobility GmbH<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Systemarchitekt (w/m/d) ETCS Onboard Units", "type": "external", "publication_date": "2023-03-09T23:53:15Z", "short_name": "systemarchitekt-wmd-etcs-onboard-units", "model_type": "jobs", "id": 10258131, "locations": [{"name": "Berlin, Germany"}], "categories": [{"name": "Unknown"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/systemarchitekt-wmd-etcs-onboard-units"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br> o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br> o Actively look for ways to help people, and do so in a friendly manner<br> o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br> o Use and understand verbal and written communication to interact with customers and colleagues<br> o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br> o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br> o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br> o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br> o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:22:29Z", "short_name": "pharmacy-technician-03bf66", "model_type": "jobs", "id": 14147465, "locations": [{"name": "Troy, NY"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-03bf66"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Let'smake the difference together!</strong><br><br>SiemensDigital Industries (DI) is an innovation leader in automation anddigitalization. Closely, collaborating with partners and customers, we careabout the digital transformation in the process and discrete industries. Withour Digital Enterprise portfolio, we provide and encourage companies of allsizes with an end-to-end set of products, solutions and services to integrateand digitalize the entire value chain. Meaningful optimization for the specificneeds of each industry, our outstanding portfolio supports customers to achievegreater efficiency and flexibility. We are constantly adding innovations to itsportfolio to integrate groundbreaking future technologies. We have our globalheadquarters in Nuremberg, Germany, and have around 75,000 employeesinternationally.<br><br>We offera role with responsibility, independence and the possibility to contributeproactive. We foster a teamwork culture with room for individual development<br><br>Pleasevisit https://www.siemens.com/plm.<br><br><strong>About therole / Segment</strong><br><br>It's anexciting time here at Siemens Digital Industries. To support our growthIndustry 4.0 portfolio in both discrete and process industries, the PortfolioDevelopment department in Mexico is looking for a Portfolio Developer for theAerospace Industry.<br><br>Theobjective of the Portfolio Development function is to ensure that our salesorganization achieves assigned revenue targets for each solution in ourPortfolio. The Portfolio development role achieves the objective by creatingand maintaining plans for their assigned product or solution domain withintheir defined territory, aligning those plans with collaborators across sales,the segments and industry strategy. Further, they drive the execution of thoseplans through the appropriate sales functions.<br><br><strong>Area ofresponsibility</strong><br><br><ul> <li>Build     and maintain a business plan for the specific portfolio elements that     supports and aligns with the Country Plan, while ensuring these plans are     aligned with marketing, sales, etc.</li> <li>Identify     and select the most appropriate global and local Campaigns for their     chosen portfolio.</li> <li>Use     market analysis tools to identify suspect accounts (portfolio suspects).</li> <li>Collaborate     with a sales orchestrator or a tele-prospector for mature contacts for the     suspects, and ultimately fill the pipeline with opportunities generated     from the suspects.</li> <li>Collaborate     with our Partners for their enablement on the selected Campaigns and the     development of suspect opportunities and, this way, boost their business     on assigned portfolio.</li> <li>Develop     and engage in multiple opportunities, primarily in the identify and     discover stage of the sales process.</li> <li>Provide     feedback and suggestions for improvements on specific local and global     Campaigns as well as additional needs of their territory to the zone or     global PfD.</li> <li>Ensure     adequate awareness and education for the entire chosen Portfolio within     the country organization.</li> <li>Working     together to optimize production processes within the Digital Enterprise,     focusing on improving efficiency, flexibility and time-to-market (more     information: https://new.siemens.com/global/en/company/about/businesses/digital-industries.html)</li></ul><br><strong>Your qualifications</strong><br><br>•       Bachelor/master's degree in industrial, aeronautical or other relevantengineering.<br><br>•       5+ years of proven experience in SW or engineering companies, preferablyin business development, presales or sales positions.<br><br>•       Understanding of PLM andindustrial software.<br><br>•       Proven background in Product Lifecycle Management software, preferablyincluding Siemens Industry Software products.<br><br>•       Knowledge of the Mexican Aerospace industrial landscape .<br><br>•       Strong customer orientation, communication, enthusiasm and persuasionskills.<br><br>•       Focused on results and quality, with strong decision-making ability andorganizational skills.<br><br><ul><li>Experience aligning with mid/upper level management and technical users.</li><li>Documented experience of owning and managing discovery phase withclients.</li><li>Collaborate and drive results with diverse teams across multipleinternal and external organizations.</li></ul><br>•       Knowledge driven behavior, analytical approach, flexible,internationally oriented.<br><br>•       Approximately 50% travel.<br><br>•       Fluent Spanish and English.<br><br><strong>Workingat Siemens Software</strong><br><br><strong>Why us?</strong><br><br>Workingat Siemens Software means flexibility - Choosing between working at home andthe office at other times is the norm here. We offer great benefits andrewards, as you'd expect from a world leader in industrial software.<br><br>We are anequal opportunity employer and value diversity at our company. We do not discriminateon the basis of race, religion, color, national origin, sex, gender, genderexpression, sexual orientation, age, marital status, veteran status, ordisability status.<br><br>AtSiemens, we are always challenging ourselves to build a better future. We needthe most innovative and diverse Digital Minds to develop tomorrow's reality.<br><br>SiemensIndustry Software is an equal opportunities employer and does not discriminateunlawfully on the grounds of age, disability, gender assignment, marriage, andcivil partnership, pregnancy and parental, race, religion or belief, sex,sexual orientation, or trade union membership.<br><br><strong>Siemens.Making real what matters</strong><br><br>If youwant to make a difference - make it with us!<br><br>At Siemens we are always challengingourselves to build a better future.  We need the most innovative anddiverse Digital Minds to develop tomorrow's reality.  Find out more aboutthe Digital world of Siemens here:  www.siemens.com/careers/digitalminds<br><br>#LI-PLM <br><br>#DISW<br><br>#LI-REMOTE<br><br>#LI-AL1<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry Software, S.A. de C.V.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Portfolio Development Executive (Aerospace Industry)", "type": "external", "publication_date": "2023-03-09T23:53:15Z", "short_name": "portfolio-development-executive-aerospace-industry-0379d0", "model_type": "jobs", "id": 10665736, "locations": [{"name": "Flexible / Remote"}, {"name": "Mexico City, Mexico"}], "categories": [{"name": "Sales"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/portfolio-development-executive-aerospace-industry-0379d0"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>SIGN-ON BONUS ELIGIBLE!</b><br><br>Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions.<br><br>As a <b>Community Pharmacist</b>, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy.<br><br>This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li></ul><b>Workflow Management</b><br><br>A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs.<br><br>Additionally, you will:<ul><li>Lead with Heart ΓÇô display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a ΓÇÿteam' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li></ul><b>Minimum Required Qualifications:</b><ul><li>Bachelor of Science in Pharmacy or Pharm. D. degree</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (e.g., APhA)</li><li>No pending felony charges or convictions for criminal offenses involving controlled substances.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60.00 - $73.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Community Pharmacist Full-time", "type": "external", "publication_date": "2024-03-17T12:36:11Z", "short_name": "community-pharmacist-fulltime-504917", "model_type": "jobs", "id": 13894008, "locations": [{"name": "Bethlehem, PA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/community-pharmacist-fulltime-504917"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Gemeinsam realisieren wir, worauf es ankommt</strong> <br><br>Smart Infrastructure verbindet auf intelligente Weise Energiesysteme, Gebäude und Industrien, um die Art, wie wir leben und arbeiten, weiterzuentwickeln und zu verbessern. Dabei stehen alle Arten von Gebäuden in unterschiedlichsten Märkten für uns im Fokus. Immer mit dem Anspruch, Infrastrukturen laufend zu verbessern. Dies machen wir unabhängig von der Gebäudegrösse, durch vernetzte, cloudbasierte digitale Angebote und Dienstleistungen sowie durch Produkte, Komponenten und Systeme. Von der intelligenten Stromnetzsteuerung, Gebäudeautomations- und Management Systemen, Brandschutz- und Sicherheitslösungen bis hin zu Schaltern, Ventilen und Sensoren. Siemens - für eine nachhaltige Entwicklung unserer Welt von morgen. Gestalte als Teil eines weltweiten Teams von rund 303 000 Mitarbeitenden mit uns die Zukunft.  <br><br>Sicherheitssysteme für smarte Gebäude faszinieren Dich? Dann weisst Du, dass Sicherheit einer der wichtigsten Faktoren für die Art und Weise ist, wie wir in einer globalisierten Welt leben und arbeiten. Mit intelligenten Sicherheitslösungen tragen wir im digitalen Zeitalter zum Erfolg der Unternehmen unserer Kundschaft bei. Hast Du Spass an Themen wie Intrusion, Videoüberwachung und Zutrittskontrolle? Dann bist Du bei uns richtig! Werde teil eines erfolgreichen und vielfältigen Teams und tauche ein in ein spannendes Aufgabengebiet!<br><br>Gewinne schon heute einen Einblick in Dein neues Arbeitsumfeld sowie einen Eindruck Deiner möglichen Kolleginnen und Kollegen: www.siemens.ch/EB-Video-ServicetechnikerInnen<br> <br><strong>Deine neues Aufgabenfeld</strong><br><br><ul><li>Selbständige Inbetriebsetzung von Einbruchmeldesystemen und Peripheriegeräten im Gebiet Stadt Zürich und linkes Zürichseeufer </li><li>Instruieren und Beraten von Sicherheitslösungen bei unserer Kundschaft vor Ort</li><li>Selbständige Behebung von Störungen an den Sicherheitsanlagen unserer Kundschaft</li><li>Durchführung von Wartungs- und Servicearbeiten</li><li>Verkaufsunterstützung bei Modernisierungen und Erweiterungen</li><li>Pikettdienst ausserhalb der üblichen Arbeitszeiten</li><li>Koordination und Organisation der zugeteilten Projekte</li><li>Selbständige Betreuung der Kundschaft</li></ul><br><strong>Deine Talente und Erfahrungen</strong><br><br><ul><li>Elektrotechnische Grundausbildung, abgeschlossene Berufslehre als Elektroinstallateur:in, Elektroniker:in/Telematiker:in/Automatiker:in</li><li>Erfahrung im Kundendienst</li><li>Gute PC- und Netzwerkkenntnisse sowie fundierte MS-Office-Anwenderkenntnisse</li><li>Bereitschaft zur stetigen Weiterbildung</li><li>Stilsichere Deutschkenntnisse in Wort und Schrift</li><li>Einwandfreier Leumund</li><li>Verantwortungsvolles Handeln sowie exaktes und selbständiges Arbeiten als Stärken</li><li>Gute Umgangsformen und gepflegtes Auftreten, Behalten von Ruhe und Überblick auch in hektischen Situationen</li><li>Gültiger Fahrausweis Kategorie B</li><li>Wohn- und Einsatzgebiet: Grossraum Zürich</li></ul><br><strong>Deine Bewerbung </strong>  <br><br>Siemens nimmt deine Privatsphäre sehr ernst und pflegt darum einen hohen Datenschutzstandard. Aus diesem Grund können wir deine Bewerbung ausschliesslich über unsere Bewerbungsplattform entgegennehmen (Button \"BEWERBEN\").  Antworten zu den häufigsten Fragen sowie ein Kontaktformular findest du unter siemens.ch/contact-hr. Wir freuen uns auf deine vollständige Bewerbung. <br><br>Siemens etabliert mobiles Arbeiten als Kernelement der \"neuen Normalität\". Wo immer möglich, ist \"Mobile Working\" unsere Arbeitskultur, die ortsunabhängiges und selbstständiges Arbeiten fördert.  <br><br>Siemens fördert die Chancengleichheit. Vielfalt bereichert unser Unternehmen und verschafft uns einen Wettbewerbsvorteil.  <br><br>Information für Personalvermittlungen: Siemens nimmt für diese Position keine Bewerbungen von Personalvermittlungen entgegen. Wir danken für Ihr Verständnis.<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Schweiz AG<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Servicetechniker:in für Sicherheitsanlagen 80-100%", "type": "external", "publication_date": "2023-04-07T23:37:19Z", "short_name": "servicetechnikerin-fur-sicherheitsanlagen-80100-1fd951", "model_type": "jobs", "id": 11155325, "locations": [{"name": "Zurich, Switzerland"}], "categories": [{"name": "Unknown"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/servicetechnikerin-fur-sicherheitsanlagen-80100-1fd951"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br><b>Job Description:</b><br>This job is responsible for serving as the first point of contact for financial center clients, helping to uncover personal banking needs of both individual and small business clients, offering appropriate solutions, and connecting clients to specialists. Key responsibilities include deepening client relationships through platform services, supporting clients with self-service or transactional activities, and providing exceptional client care. Job expectations include proactively connecting with clients through outbound calls and conducting consistent follow-up routines.<br><br><b>Responsibilities:</b><br><br><ul><li>Partners with teams to provide financial center clients with both consumer and small business solutions, services, and strategies when uncovering personal banking needs and helping clients navigate their unique life priorities</li><li>Assists, educates, and trains clients on conducting simple transactions through self-service technologies</li><li>Leverages available resources, technologies, and processes to optimize the client experience and deliver operational excellence and accuracy</li><li>Adheres to established processes, laws, and guidelines in performing day-to-day activities, such as opening accounts, account maintenance, and Digital Assisted Shopping</li><li>Manages client interactions by taking the best course of action for the bank and its clients and abiding by all regulatory requirements</li></ul><br><b>Skills:</b><br><br><ul><li>Active Listening</li><li>Business Acumen</li><li>Customer and Client Focus</li><li>Oral Communications</li><li>Problem Solving</li><li>Account Management</li><li>Client Experience Branding</li><li>Client Management</li><li>Client Solutions Advisory</li><li>Relationship Building</li><li>Business Development</li><li>Pipeline Management</li><li>Prospecting</li><li>Referral Identification</li><li>Referral Management</li></ul><br><b>Minimum Education Requirement: </b>Null<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>", "name": "Senior Banker", "type": "external", "publication_date": "2024-03-13T23:27:45Z", "short_name": "senior-banker-ceb5d2", "model_type": "jobs", "id": 14374702, "locations": [{"name": "Prescott Valley, AZ"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/bankofamerica/senior-banker-ceb5d2"}, "company": {"id": 12145, "short_name": "bankofamerica", "name": "Bank of America"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:47:59Z", "short_name": "shift-supervisor-trainee-a9bacf", "model_type": "jobs", "id": 12628746, "locations": [{"name": "Loganville, GA"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-a9bacf"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $19.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:48:00Z", "short_name": "store-associate-f83605", "model_type": "jobs", "id": 12560269, "locations": [{"name": "Miami, FL"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-f83605"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>POSITION SUMMARY</b>:<br><br><strong><em>This position follows a hybrid working schedule of three days onsite per week at our Hartford, CT location</em></strong><br><br>As Associate Counsel, you will provide legal guidance, interpretation, advice and recommendations to internal stake holders and senior/executive management, as well as to counsel and senior counsel covering myriad health insurance-related topics in support of Aetna's Northeast Region.  Your work will also include collaborating with others in the CVS Health enterprise on company- wide initiatives.  You will work closely with other attorneys within the CVS Health legal department including additional Regional Counsel, Compliance, and Governmental Affairs.  The type of work you will perform may range from researching laws, regulations and guidance, commenting on proposed rules, working with a business team, providing counsel on issues, reviewing communications, drafting and negotiating contracts, and supporting various other matters.  You will be assigned to specific areas of work for which you will serve as the subject matter expert (SME) and work closely with Counsel and Senior Counsel.<br><br>Over time, the attorney in this role will be expected to provide sound legal guidance including proactive legal counsel to the business areas they support and assist the business in meeting its goals by preventing and/or addressing regulatory issues.  You will identify business and legal risks and provide solutions which balance legal risks and business objectives. You will be expected to develop a keen understanding of all aspects of the business and keep that understanding at the forefront of all you do.<br><br><b>Responsibilities</b><br><br>-Research health insurance laws and regulations and memo guidance;<br><br>-Perform specific research relating to the business as requested;<br><br>-Provide legal analysis for your leadership and the business;<br><br>-Work collaboratively with other legal staff, Compliance, Government Affairs and business operations teams to implement new laws and regulations;<br><br>-Assist in the coordination of answers to regulatory questions;<br><br>-Provide legal review for select communications and marketing materials;<br><br> -Provide comments to proposed laws, and regulations working closely with Governmental Affairs and business staff and other enterprise staff; <br><br> - Advise clients with respect to the application of federal and state laws and regulations, contracting, and disputes; <br><br> - Identify and analyze statutes, regulations manuals, and guidance to determine applicability to business goals. <br><br>-Support the business in drafting documents including contracts, communications, memos and other sensitive and critical documents.<br><br>In order to be successful in this role you must exhibit the following:<br><br>Demonstrated business judgment and acumen required; <br><br> Superior oral and written communication skills required; <br><br> High level of interpersonal skills and ability to manage multiple responsibilities required;  and <br><br> Excellent legal acumen, research, drafting and analytical skills.<br><br><b>EDUCATION</b>:  Juris Doctorate<br><br><b>REQUIRED QUALIFICATIONS:  </b><ul><li>Bar admission in good standing;</li><li>2+ years legal experience;</li></ul><b>PREFERRED QUALIFICATIONS:</b><ul><li>4+ years or more legal experience;</li><li>Experience in health care law;</li><li>Experience supporting client issues preferred;</li><li>2 years' experience in a law firm health care practice, in-house experience at a managed care company or governmental position preferred.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$124,372.50 - $247,200.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above.  This position also includes an award target in the company's equity award program. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies. <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 05/03/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Associate Counsel", "type": "external", "publication_date": "2024-03-17T12:15:35Z", "short_name": "associate-counsel-178a2c", "model_type": "jobs", "id": 14393033, "locations": [{"name": "Hartford, CT"}], "categories": [{"name": "Advertising and Marketing"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/associate-counsel-178a2c"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li></li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $18.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "store associate", "type": "external", "publication_date": "2024-03-17T12:27:43Z", "short_name": "store-associate-8a2f92", "model_type": "jobs", "id": 14099780, "locations": [{"name": "Merrimack, NH"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-8a2f92"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $18.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:27:44Z", "short_name": "store-associate-12ab35", "model_type": "jobs", "id": 14102546, "locations": [{"name": "Tampa, FL"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-12ab35"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Vielseitige Taktgeber.</strong><br><br>Sie bestimmen maßgeblich den Rhythmus von Bauprojekten. Sie motivieren alle Beteiligten zu Bestleistungen und haben immer das große Ganze im Blick - inklusive aller Ressourcen. Innerhalb der lokalen baurechtlichen Normen und Standards haben sie dennoch genug Raum, jedem Projekt eine persönliche Note zu verleihen. Haben Sie Lust, Ihr Können in Projekten unter Beweis zu stellen? Dann lassen Sie uns darüber sprechen, wie wir gemeinsam das Leben von Menschen - durch die Umsetzung verschiedener Bauobjekte, wie etwa moderne Industrieanlagen, Umspannwerke, Kraftwerke oder Krankenhäuser - spürbar verbessern können.<br><br><strong>Verändern Sie mit uns die Welt von morgen.</strong><br><br><ul><li>Sie koordinieren und führen Montageaufträge für Nieder- und Mittelspannungsanlagen bis 36kV durch und stimmen sich mit Kunden, Behörden und anderen Gewerken ab</li><li>Sie nehmen an Baustelleneinweisungen und Baubesprechungen sowie deren Durchführung teil</li><li>Sie nehmen die Wünsche unserer Kunden entgegen, erkennen Mehrleistungen, melden diese an und wirken bei den Verhandlungen von Zusatzleistungen mit</li><li>Sie planen Ressourcen, Terminabläufen sowie Verfügbarkeiten und erstellen Aufmaße</li><li>Sie übernehmen die fachliche Führung von Monteuren und Auszubildenden</li><li>Sie stellen die Arbeitssicherheit auf der Baustelle sicher, indem Sie Gefahrenbeurteilungen erstellen und Unterweisung durchführen</li><li>Sie haben Kosten, Termine und Qualität im Blick und erstellen die entsprechenden Montagekalkulationen</li></ul><br><strong>Ihr Profil für \"Zukunft möglich machen\".</strong><br><br><ul><li>Sie besitzen eine technische Berufsausbildung zur Elektrofachkraft (w/m/d)</li><li>Sie haben mehrjährige Bauleitungserfahrung in der Primär- und Sekundärtechnik sowie Erfahrung in Primärtechnik von Mittelspannungsschaltanlagen und deren Nebenanlagen</li><li>Sie verfügen über fundierte Kenntnisse über Normen und Vorschriften, z.B. DIN, VDE und IEC</li><li>Sie sind sicher im Umgang mit MS Office und besitzen sehr gute Deutschkenntnisse und grundlegende Englischkenntnisse</li><li>Darüber hinaus punkten Sie mit einem kundenfreundlichen Auftreten, zukunftsorientierter Denkweise sowie mit einer kooperativen Zusammenarbeit im Team</li><li>Bereitschaft für Reisetätigkeiten im Südwestdeutschland, auch über längere Zeit (Heimfahrten am Wochenende), sowie ausgeprägte Kundenorientierung runden Ihr Profil ab</li></ul><br><strong>Wir wollen, dass Sie wollen: Bewerben Sie sich!</strong><br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br><strong>https://new.siemens.com/</strong> - wenn Sie mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchten.<br><br><strong>FAQ</strong> - wenn Sie eine Frage zum Thema Bewerbung bei Siemens haben.<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens AG<br><br><b>Experience Level:</b> Mid-level Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Bauleitung (w/m/d) für Nieder- und Mittelspannungsanlagen", "type": "external", "publication_date": "2023-05-25T23:39:12Z", "short_name": "bauleitung-wmd-fur-nieder-und-mittelspannungsanlagen-faede5", "model_type": "jobs", "id": 11434844, "locations": [{"name": "Freiburg, Germany"}], "categories": [{"name": "Arts"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/bauleitung-wmd-fur-nieder-und-mittelspannungsanlagen-faede5"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:36:15Z", "short_name": "store-associate-364035", "model_type": "jobs", "id": 13772507, "locations": [{"name": "San Clemente, CA"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-364035"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<div><p>SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars.</p></div>\n\n<div>\n<p><strong>SR. DSP COMMUNICATIONS SYSTEMS ENGINEER (SILICON ENGINEERING)</strong> </p>\n</div>\n\n<div>\n<p>At SpaceX we’re leveraging our experience in building rockets and spacecraft to deploy Starlink, the world’s most advanced broadband internet system. Starlink is the world’s largest satellite constellation and is providing fast, reliable internet to 2M+ users worldwide. We design, build, test, and operate all parts of the system – thousands of satellites, consumer receivers that allow users to connect within minutes of unboxing, and the software that brings it all together. We’ve only begun to scratch the surface of Starlink’s potential global impact and are looking for best-in-class engineers to help maximize Starlink’s utility for communities and businesses around the globe. </p>\n</div>\n\n<div>\n<p>The Starlink modem team is seeking motivated, proactive, and intellectually curious engineers who can work with world-class cross-disciplinary teams (firmware, architecture, design, validation, product engineering, ASIC implementation). In this role, you will develop system algorithms and silicon solutions for cutting-edge communication systems for deployment in space and ground infrastructures. These systems are enabling connectivity in places it has previously not been available, affordable or reliable. Your efforts will help deliver cutting-edge solutions that will expand the performance and capabilities of the Starlink network.     </p>\n</div>\n\n<div>\n<p><strong>RESPONSIBILITIES: </strong> </p>\n</div>\n\n<div>\n<ul>\n<li>System-level and link-level design in support of a robust satellite broadband communication system </li>\n<li>Work in close collaboration with ASIC/FPGA, RF/antenna, and software engineers to design and validate silicon-based systems </li>\n<li>Develop floating-point and fixed-point models and run simulations to analyze and validate overall system performance, including modem performance </li>\n<li>Support IC designers with bit-accurate and cycle-accurate vector generation for silicon verification </li>\n<li>Generate spacecraft and consumer equipment system specifications, requirements, and test procedures </li>\n<li>Support silicon bring up and validation by developing and implementing system test plans </li>\n</ul>\n</div>\n\n<div>\n<p><strong>BASIC QUALIFICATIONS:</strong></p>\n<ul>\n<li>Bachelor’s degree in computer science, physics, computer engineering or electrical engineering</li>\n<li>5+ years of experience in system-level modeling and/or digital signal processing</li>\n</ul>\n<p><strong>PREFERRED SKILLS AND EXPERIENCE:</strong></p>\n<ul>\n<li>Master’s degree in electrical engineering with emphasis in communication systems and/or digital signal processing</li>\n<li>5+ years of professional experience in system-level modeling</li>\n<li>5+ years of professional experience in working on aspects of multiple access schemes such as TDMA, CDMA and OFDMA</li>\n<li>5+ years of professional experience in design and verification of high data rate wireless modems</li>\n<li>Expertise in MATLAB, C/C++, and/or Python</li>\n<li>Expertise in wireless communication standards, such as LTE, WiFi, Bluetooth, etc.</li>\n<li>Expertise in designing and implementing system-level procedures and algorithms</li>\n<li>Expertise in building and using system-level simulators and performance analysis</li>\n<li>Expertise in various multiple access schemes including downlink and uplink scheduler designs and tradeoffs</li>\n<li>Understanding of system link budgets and analysis related to communication systems</li>\n<li>Understanding of modem designs, link-level algorithms and hardware architectures</li>\n<li>Understanding of ASIC and FPGA development concepts, methodologies, and procedures</li>\n<li>Experience working in the lab and using lab equipment</li>\n<li>Experience in Git version control system</li>\n<li>Experience in Atlassian collaboration and automation tools: JIRA, Confluence, Bitbucket, Bamboo, etc.</li>\n<li>Strong interpersonal/written/verbal communication skills and experience with cross-functional collaboration</li>\n<li>Strong teamwork skills combined with ability to work autonomously as an individual contributor</li>\n<li>High level of self-motivation and desire to be challenged and learn new skills</li>\n<li>Strong problem solving skills with high attention to detail</li>\n<li>Ability to work in a dynamic, fast-paced environment with changing needs and requirements</li>\n<li>Ability to meet tough goals under high pressure and manage time effectively</li>\n</ul>\n<p><strong>ADDITIONAL REQUIREMENTS:</strong></p>\n<ul>\n<li>Extended hours and weekend work may be required to support critical project and mission milestones</li>\n</ul>\n<p><strong>COMPENSATION AND BENEFITS:    </strong></p>\n<p>Pay range:    <br>DSP Systems Engineer/Senior: $160,000.00 - $220,000.00/per year    <br>    <br>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.</p>\n<p>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short &amp; long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation &amp; will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year.</p>\n</div>\n\n<div><p><strong>ITAR REQUIREMENTS:</strong></p>\n<ul>\n<li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C. § 1157, or (iv) Asylee under 8 U.S.C. § 1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR <a href=\"https://www.pmddtc.state.gov/?id=ddtc_kb_article_page&amp;sys_id=24d528fddbfc930044f9ff621f961987\">here</a>.  </li>\n</ul>\n<p>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.</p>\n<p>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should notify the Human Resources Department at (310) 363-6000.</p></div>", "name": "Sr. DSP Communication Systems Engineer (Silicon Engineering)", "type": "external", "publication_date": "2024-03-06T23:05:21Z", "short_name": "sr-dsp-communication-systems-engineer-silicon-engineering-1984fe", "model_type": "jobs", "id": 14305070, "locations": [{"name": "Redmond, WA"}], "categories": [], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/spacex/sr-dsp-communication-systems-engineer-silicon-engineering-1984fe"}, "company": {"id": 15000190, "short_name": "spacex", "name": "SpaceX"}}, {"contents": "<p><b><strong>About the Role</strong></b><br><br>A successful candidate needs to be a self-starter and able to navigate an ambiguous environment with a truth-seeking mentality.<br><br>You should have excellent written and verbal communication skills in both English and Japanese to make and deliver executive-level presentations and connect with the partners in APAC and Japan, as well as strong analytical skills to turn undefined problems into sound strategies with clear action plans. Most importantly, you should not be afraid to challenge the status quo and make improvement recommendations.<br><br><b><strong>Your Impact In Role</strong></b><br><br><ul><li>Program management: You will be responsible for owning the Spender support, setting the right priorities and assisting in timely re-prioritization as vital, making data-driven decisions</li><li>Cross-functional coordination: continuously find opportunities to improve cross-functional ways of working to align strategic goals, plan efficiently, and collaborate to best deliver impact</li><li>Team &amp; Stakeholder management: Tackle problems with multiple partners including the team members in the Community Support team. Building trust and partnerships will be the key to success</li><li>Agenda and storytelling: Drive strategic agenda development and executive storytelling across internal executive communication</li></ul><br><b><strong>The Experience You'll Bring</strong></b><br><br><ul><li>Proven track record and at least 2-3 years experience handling a team</li><li>Proficient in spoken and written English and Japanese</li><li>Strong multitasking and prioritization skills</li></ul><br><b><strong>Preferred Qualifications</strong></b><br><br><ul><li>Balance attention to detail with execution</li><li>Validated experience in leading sophisticated partner structure</li><li>Self-motivated with an affinity for partner management, problem solving and driving action through data-driven insight</li></ul><br>We welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and let's move the world forward, together.<br><br>Offices continue to be central to collaboration and Uber's cultural identity. Unless formally approved to work fully remotely, Uber expects employees to spend at least half of their work time in their assigned office. For certain roles, such as those based at green-light hubs, employees are expected to be in-office for 100% of their time. Please speak with your recruiter to better understand in-office expectations for this role.<br><br>*Accommodations may be available based on religious and/or medical conditions, or as required by applicable law. To request an accommodation, please reach out to accommodations@uber.com.</p>", "name": "Sr Customer Analytics Manager", "type": "external", "publication_date": "2023-12-16T00:45:18Z", "short_name": "sr-customer-analytics-manager", "model_type": "jobs", "id": 12521224, "locations": [{"name": "Tokyo, Japan"}], "categories": [{"name": "Data and Analytics"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/uber/sr-customer-analytics-manager"}, "company": {"id": 61, "short_name": "uber", "name": "Uber"}}, {"contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br>Job Description:<br><br>This job is responsible for engaging clients in the lobby to educate and assist with conducting transactions through self-service resources, such as mobile banking, online banking, or ATM. Key responsibilities include accurately and efficiently processing cash transactions for clients as needed. Job expectations include having deep conversations with clients to gain in-depth knowledge of the financial and life priorities and connecting clients to solutions that meet the financial goals.<br><br>Responsibilities:<br><br>•  Executes the bank's risk culture and strives for operational excellence<br><br>•  Builds relationships with clients to meet financial needs<br><br>•  Follows established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations<br><br>•  Grows business knowledge and network by partnering with experts in small business, lending, and investments<br><br>•  Manages financial center traffic, appointments, and outbound calls effectively<br><br>•  Drives the client experience<br><br>•  Manages cash responsibilities<br><br>Required Qualifications:<br><br>•  Is an enthusiastic, highly motivated self-starter with a strong work ethic and intense focus on results, acting in the best interest of the client.<br><br>•  Collaborates effectively to get things done, building and nurturing strong relationships.<br><br>•  Displays passion, commitment and drive to deliver an experience that improves our clients' financial lives.<br><br>•  Is confident in identifying solutions for new and existing clients based on their needs.<br><br>•  Communicates effectively and confidently, and is comfortable engaging all clients.<br><br>•  Has the ability to learn and adapt to new information and technology platforms.<br><br>•  Is confident in educating clients on how to conduct simple banking transactions through self-service technologies (for example, ATM, online banking, mobile banking).<br><br>•  Applies strong critical thinking and problem-solving skills to meet clients' needs.<br><br>•  Will follow established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations.<br><br>•  Efficiently manages time and capacity.<br><br>•  Focuses on results, while acting in the best interest of the client.<br><br>•  Can be flexible to work weekends and/or extended hours as needed.<br><br>Desired Qualifications:<br><br>•  Experience in financial services and knowledge of financial services industry, products and solutions.<br><br>•  One year of demonstrated successful sales experience in a salary plus incentive environment with individual sales goals.<br><br>•  Six months of cash handling experience.<br><br>•  Bachelor's degree or business relevant associate degree such as business management, business administration, or finance.<br><br>Skills:<br><br>•  Adaptability<br><br>•  Business Acumen<br><br>•  Customer and Client Focus<br><br>•  Oral Communications<br><br>•  Problem Solving<br><br>•  Account Management<br><br>•  Client Experience Branding<br><br>•  Client Management<br><br>•  Client Solutions Advisory<br><br>•  Relationship Building<br><br>•  Business Development<br><br>•  Pipeline Management<br><br>•  Prospecting<br><br>•  Referral Identification<br><br>•  Referral Management<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>", "name": "Relationship Banker - Olden Avenue Financial Center", "type": "external", "publication_date": "2024-03-12T23:28:43Z", "short_name": "relationship-banker-olden-avenue-financial-center-3d28f3", "model_type": "jobs", "id": 14362856, "locations": [{"name": "Trenton, NJ"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/bankofamerica/relationship-banker-olden-avenue-financial-center-3d28f3"}, "company": {"id": 12145, "short_name": "bankofamerica", "name": "Bank of America"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.75 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 06/13/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:15:35Z", "short_name": "pharmacy-technician-b24bfc", "model_type": "jobs", "id": 14382368, "locations": [{"name": "Southampton, NY"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-b24bfc"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br> o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br> o Actively look for ways to help people, and do so in a friendly manner<br> o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br> o Use and understand verbal and written communication to interact with customers and colleagues<br> o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br> o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br> o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br> o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br> o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:32:18Z", "short_name": "pharmacy-technician-d19738", "model_type": "jobs", "id": 13946473, "locations": [{"name": "Angleton, TX"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-d19738"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}], "aggregations": {}}