{"page": 3, "page_count": 15640, "items_per_page": 20, "took": 19, "timed_out": false, "total": 312784, "results": [{"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.75 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:22:27Z", "short_name": "pharmacy-technician-f791b7", "model_type": "jobs", "id": 14186756, "locations": [{"name": "Greenwich, CT"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-f791b7"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>TAKS:<br><br>1.Lead end to end quality improvement activities in supply chain. <br><br>2.Conduct quality check &amp; related test, including FAI, IQC, CTQ test, DOA and DPU case following up, etc.<br><br>3.Listen to customer, dynamicly adjust incoming inspection items, coordinate quality case analysis within SCM, drive and monitor the corrective and preventive actions to be implemented when needed in both supplier and SCM side. <br><br>4.Evaluate supplier performance, and develop supplier together with P &amp; Q. <br><br>5.Participate in supplier selection process by assessing its capability in the areas of engineering, process and quality control. Perform quality system audit and process audit before new supplier phase in.<br><br>6.Carry out process audit in SCM, play the role of process quality control. Continuously reduce the quality cost throughout the whole supply chain.<br><br>7.Work with supplier to continuously improve its quality and efficiency. Support and help supplier eliminate wastes.<br><br>8.Timely visualize quality performance of both SCM and suppliers. <br><br>9.Lead SCQE team, develop SCQE engineers.<br><br>10.Other tasks assigned by superior<br><br>REQUIREMENTS:<br><br>At least 3 years of working experience in supply chain quality &amp; process control and management areas.<br><br>Education<br><br>Bachlor degree in quality or technology fields.<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Shanghai Medical Equipment Ltd.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "SSME CT Supply Chain Quality Engineer", "type": "external", "publication_date": "2023-04-03T23:44:38Z", "short_name": "ssme-ct-supply-chain-quality-engineer-18adad", "model_type": "jobs", "id": 11126153, "locations": [{"name": "Shanghai, China"}], "categories": [{"name": "Science and Engineering"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/ssme-ct-supply-chain-quality-engineer-18adad"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>Art der Anstellung:</strong> Unbefristet; Vollzeit<br>  <br><strong>Wissen für die Welt von morgen.</strong><br><br>Wir entwickeln Netzwerke, die unsere Städte schlauer mit Licht und Wärme versorgen und kennen uns in Sachen Automatisierung und Digitalisierung in der Prozess- und Fertigungsindustrie bestens aus. Für Projekte in der Zukunft und viele weitere brauchen wir kluge Köpfe, die ihr Talent und ihre Kreativität einbringen. Menschen wie dich! Hilf uns dabei, die spannendsten Aufgaben gemeinsam anzugehen und umzusetzen, worauf es ankommt. Was wir dir bieten ist die Chance, wirklich etwas zu bewegen. Also worauf warten? Mache mit uns den nächsten Schritt in deiner Karriere.<br><br><strong>Verändere mit uns die Welt von morgen.</strong><br><br>Wir suchen<strong> mehrere Elektrofachkräfte </strong>in einem zukunftsorientierten Aufgabenfeld!<br><br><ul><li>Du bist zuständig für den mechanischen und elektrischen Aufbau von Industrieschaltschränken gemäß Schaltplänen, Zeichnungen und Stücklisten entsprechend unserer Fertigungsrichtlinien </li><li>Zu deinen Aufgaben gehört zudem die elektrische Prüfung (Sicht-, Apparate- und Leitungskontrolle) sowie die Funktionsprüfung </li><li>Du behältst deine Arbeitsabläufe im Blick und gibst deinen Beitrag zur Verbesserung der Dokumentation</li><li>Auftretende Fragen klärst du eigenverantwortlich mit den zuständigen Teamleiter<em>innen und den Kolleg</em>innen der technischen Abteilungen</li></ul><br><strong>Was du können solltest. Damit die Welt mehr kann.</strong><br><br>Deine Qualifikationen - fundiert und adäquat.<br><br><ul><li>Du verfügst über eine erfolgreich abgeschlossene Berufsausbildung als <strong>Elektriker<em>in, Elektroniker</em>in, Mechatroniker*in </strong>oder eine vergleichbare Qualifikation</li><li>Idealerweise konntest du bereits erste Berufserfahrung in der Fertigung im Anlagenbau sammeln</li><li>Umfangreiche Schaltpläne und Montagezeichnungen schrecken dich nicht ab</li><li>Die Begriffe \"Kontinuierlicher Verbesserungsprozess\" sowie \"7S\" für Ordnung und Struktur am Arbeitsplatz sind dir nicht fremd</li><li>Fundierte Anwenderkenntnisse im Umgang mit MS-Office bringst du mit, Grundkenntnisse in SAP sind von Vorteil</li><li>Du verfügst über gute Deutschkenntnisse in Wort und Schrift</li><li>Du bringst die Bereitschaft mit, im Schichtbetrieb zu arbeiten</li><li>Teamfähigkeit, Kundenorientierung sowie Qualitätsbewusstsein runden dein Profil ab</li></ul><br><strong>Was wir bieten.</strong><br><br><ul><li>Ansprechendes Vergütungspaket</li><li>Weiterbildungsmöglichkeiten sowohl für deine berufliche als auch persönliche Entwicklung</li><li>30 Tage Urlaub und ein persönliches Gleitzeitkonto</li><li>Zugang zu Aktienplänen für Mitarbeitende</li><li>Und viele weitere Benefits hier</li></ul><br><strong>Dein kleiner Schritt in Richtung großartiger Siemens-Welt.</strong><br><br><strong>www.siemens.de</strong><br><br>wenn du vor deiner Bewerbung mehr über Siemens erfahren möchtest.<br><br>Du hast Fragen zur Bewerbung? <strong>Hier</strong> findest du Antworten auf häufig gestellte Fragen.<br><br>Wenn du darüber hinaus noch Fragen hast, wende dich gerne an uns: www.siemens.de/fragenzurbewerbung<br><br><strong>www.siemens.de/karriere</strong><br><br>wenn du mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchtest.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens AG<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Elektrofachkräfte (w/m/d) im Schaltschrankbau", "type": "external", "publication_date": "2023-03-08T23:47:31Z", "short_name": "elektrofachkrafte-wmd-im-schaltschrankbau", "model_type": "jobs", "id": 10976639, "locations": [{"name": "Nürnberg, Germany"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/elektrofachkrafte-wmd-im-schaltschrankbau"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>SAP Training Specialist for the P58 Training Academy </strong><strong>(f/m/d)</strong><br><br><strong>Location: Poland </strong><br><br>We at Siemens Healthineers are committed to helping healthcare providersglobally to succeed in today's dynamic environment. We are inspired totransform the way things are done - because we want what is best for ourpeople, our customers and ultimately the health of mankind.<br><br>While we invest in engineeringexcellence - leading-edge medical technologies and services, we don't stopthere. We also deeply invest on our 68 000 people with the hearts of pioneers, highlycommitted and connected in this industry. And as we strive to shape the futureof healthcare, our overall success will depend on our ability to continuouslyreinvent ourselves.<br><br><strong>Your tasks and responsibilities:</strong><br><br><ul><li>You are responsible for conducting training (e.g. end-user, refresher,key user, \"Train the Trainer\" training) in the context of Siemens Healthineers'SAP-based ERP System P58 for one or several functional areas</li><li>You analyze and update the existing training material (courses,exercise guides, job aids, and assessments) by utilizing feedback from key users/ functional leads and new releases / enhancements</li><li>You create new training content and localize it according to theregional/local enhancements</li><li>You implement a respective project plan and agreed delivery items, suchas learning objectives and hands-on exercise guides, in collaboration with thedifferent subject matter experts (Template Governance)</li><li>You maintain the training material on the Siemens Healthineers LearningEco-System 'SkillUP'</li><li>You contribute to the design, configuration and testing of learningenvironments, including creation of simulated data, and replication of externalsystems, interfaces and assessment systems</li><li>The development of examples and case study material for use inpre-defined courses as well as the update and control of training records,including attainment of certificates and accreditations, is also one of yourtasks</li><li>You assist in the development of the best-in-class online trainingmethodology and create online training material for an efficient and timelyproject roll-out</li><li>You ensure smooth and successful training delivery to the target groupvia online, face-to-face or digital platforms and you oversee traineesperforming practical exercise, advise and assist where necessary and ensurethat maximum learning benefit is gained from the practical experience</li><li>You provide detailed instructions as necessary and respond towide-ranging and detailed questioning in own area(s) of specialization</li><li>You ensure that training programs</li></ul><br><strong>Your qualifications andexperience:</strong><br><br><ul><li>You hold a university degree in the field of education, psychology,marketing or communication</li><li>You have long years of professional experience in the design,development and delivery of business process transformation and functionalsystem training, enabled by SAP</li><li>You must have extensive working knowledge of Microsoft Office Productsand SAP</li><li>SAP project experience will be useful, especially having gone throughproject life cycles that include training strategy creation down to trainingmaterial development and delivery thereof</li><li>It would be of particular value if you have undergone the SAP businessprocess analysis lifecycle and change impact assessments</li><li>You have gained proven success in navigating through innovations inlearning strategies and technologies</li></ul><br><strong>Your attributes and skills:</strong><br><br><ul><li>You have extremely strong verbal and written English communicationskills geared to all levels of audience in an international trainingenvironment</li><li>Experience in SAP Enable now or similar products would be of greatbenefit</li><li>You have strong instructional design skills for live, virtual anddigital deliveries</li><li>You show familiarity with the in-vivo/in-vitro business as well as theability to perform at a very high level independently within a high-performanceteam environment, and you demonstrate the ability to collaborate on severalprojects and with several partners geographically</li><li>You have distinct expertise to decipher complex issues and to conveythese in training courses. Strong attention to detail and ability to deal withambiguity is a plus</li><li>You are capable of inspiring others with your ideas and skills to lead,coach and motivate trainees, peers and colleagues</li><li>\"A day without passion for healthcare is a lost day\": Youbring passion for working in a highly dynamic and multicultural environmentwith an agile culture and the willingness to travel internationally on aregular basis</li></ul><br><strong>Weoffer:</strong><br><br><ul><li>We are flexible regarding type ofcontract </li><li>We provide necessary tools </li></ul><br><strong>If you are interested use the\"Apply\" button.</strong><br><br><strong>Our culture:</strong><br><br>At Siemens Healthineers, we take into account different perspectives, areopen to dialogue and challenge conventions. Change is an integral part of ourwork. We strive to be a leader of change in our industry, not just to respondto them. We invite you to take on new challenges with us, test your ideas andcelebrate successes.<br><br>We highly value diversity, inclusion and equal opportunities, so wewarmly invite everyone, regardless of their gender identity, to apply for thisposition. We also encourage people with disabilities to apply.<br><br><strong>Do you want to know more? Contact us.</strong><br><br>At https://www.siemens-healthineers.com/pl/ you will find additional information about our areas of activities.<br><br>We care about data privacy and take it seriously in accordance with theGDPR and other regulations related to personal data protection. For thisreason, please do not send us your CV or other application documents by e-mail.Instead, please create your profile on our Career Portal https://jobs.siemens-healthineers.com/careers , which allows you to submit your documents, apply for open positions andto obtain information about our vacancies and career development at Siemens.<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Healthcare Sp. z o.o.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "SAP Training Specialist (m/f/d)", "type": "external", "publication_date": "2023-05-20T23:37:51Z", "short_name": "sap-training-specialist-mfd-01ca50", "model_type": "jobs", "id": 11410614, "locations": [{"name": "Łódź, Poland"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/sap-training-specialist-mfd-01ca50"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:50:29Z", "short_name": "pharmacy-technician-45a890", "model_type": "jobs", "id": 12373425, "locations": [{"name": "Leland, NC"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-45a890"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $18.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "shift supervisor trainee", "type": "external", "publication_date": "2024-03-17T12:36:14Z", "short_name": "shift-supervisor-trainee-943878", "model_type": "jobs", "id": 13812218, "locations": [{"name": "Austin, TX"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-943878"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Now's our time to inspire the future of healthcare together.</strong><br><br>Siemens Healthineers is a leading global medical technology company with over 170 years of experience and 18,000 patents. More than 48,000 dedicated colleagues in over 70 countries are driven to shape the future of healthcare. We stand with our customers around the world to support them in delivering high quality care to their patients. An estimated 5 million patients across the globe benefit every day from our innovative technologies and services in the areas of diagnostic and therapeutic imaging, laboratory diagnostics and molecular medicine, as well as digital health and enterprise services. This is what truly matters to us.<br><br>Join our team now at Siemens Healthineers as Nuclear Pharmacist<br><br>Please note that this is primarily a night shift role at the PETNET Solutions pharmacy; flexibility to work alternative shifts required.<br><br><strong>This is a role well suited to an ambitious professional, looking for the next step in their career. As a </strong><strong>Nuclear Pharmacist</strong><strong>, you will be responsible for</strong>:<br><br><ul><li>Production of radionuclides</li><li>Preparation and testing of radiopharmaceuticals.</li><li>Dispensing of radiopharmaceuticals.</li><li>Ensures compliance with all regulatory commitments including the cGMP, Radiation Safety, Pharmacy laws and corporate policies and procedures and other applicable Federal, State and Local authorities.</li><li>Responsible and accountable under State Pharmacy Law, for all actions of personnel working in the permitted pharmacy area, in the absence of the Pharmacy Manager (PIC).</li><li>Delivers and ensures performance of aseptic techniques, including sterility test and pyrogen testing per company standard operating procedures.</li><li>Ensures performance of QC procedures using analytical equipment and chemical tests per company standard operating procedures.</li><li>Maintains all applicable documents and records.</li><li>Prepares shipment of radioactive materials according to procedure and licensing authorities requirements.</li><li>Provides support in operation and maintenance of cyclotron, chemistry modules, QC equipment and associated software</li></ul><strong>This position may suit you best if you are familiar with </strong><strong>what is below, and would like to do develop your career with Healthineers</strong><ul><li>Nuclear Pharmacy</li><li>Chemistry</li><li>Quality Control</li></ul><br><strong>Required skills to have for the success of this role:</strong><br><br><ul><li>Pharmacy License</li><li>Bachelors Degree</li><li>Communicates effectively with a proven ability to interpret information and provide and/or follow complex instructions.</li><li>Ability to work independently and/or as part of a cross-functional team.</li><li>Strong customer relations skills.</li><li>Working knowledge of MS Windows applications. </li></ul><strong>Physical Demands: </strong><br><br><ul><li>Ability to handle 100 lb. packages</li></ul><strong>Supervisory Duties: </strong><br><br><ul><li>Leads multiple non-exempt</li></ul><br>At Siemens Healthineers, we value those who dedicate their energy and passion to a greater cause. Our people make us unique as an employer in the med-tech industry. What unites and motivates our global team is the inspiration of our common purpose:  To innovate for healthcare, building on our remarkable legacy of pioneering ideas that translate into even better healthcare products and services. We recognize that taking ownership of our work allows both us and the company to grow. We offer you a flexible and dynamic environment and the space to move beyond your comfort zone to grow both personally and professionally.<br><br><strong>If you want to join us in transforming the way healthcare is delivered, visit our career site at </strong>https://usa.healthcare.siemens.com/careers<strong>.</strong><br><br>If you wish to find out more about the specific before applying, please visit: https://usa.healthcare.siemens.com/about.<br><br>As an equal-opportunity employer we are happy to consider applications from individuals with disabilities.<br><br>#LI-AW1<br><br>PETNET<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Medical Solutions USA, Inc.<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Nuclear Pharmacist (Hackensack, NJ)", "type": "external", "publication_date": "2022-10-20T23:39:23Z", "short_name": "nuclear-pharmacist-hackensack-nj-716c0d", "model_type": "jobs", "id": 8594371, "locations": [{"name": "Hackensack, NJ"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/nuclear-pharmacist-hackensack-nj-716c0d"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>En Supply Chain Management, nuestroobjetivo es añadir valor para Siemens y sus clientes. Nuestras acciones sebasan sistemáticamente en la búsqueda de la innovación, la productividad, lacalidad y la disponibilidad. Junto con nuestros proveedores, apostamos por unacadena de suministro competitiva y transparente.<br><br>Actualmente tenemos una vacante <strong>temporal</strong> requerimos cubrir una <strong>bajalaboral </strong>como comprador estratégico de los servicios relacionados contraducciones, consultoría, formación, servicios legales, servicios deimpresión, servicios de trabajo temporal etc..<br><br><strong>Principales responsabilidades.</strong><br><br>Como comprador la tareas a realizar serán:<br><br><ul><li>Análisis de necesidades.</li><li>Análisis y mejora decontratos existentes </li><li>Elaboración de pliegosde condiciones. </li><li>Petición, análisis ycomparativa de ofertas. </li><li>Negociación y cierre decontratos, garantizando la implantación de los mismos. </li></ul><br><strong>Formación y habilidades.</strong><br><br><ul><li>Capacidad analítica, habilidades de gestión y negociación. </li><li>Capacidad de influencia y resolución de problemas.</li><li>Alto nivel de inglés y Office365 (PowerAutomate, PowerApps, PowerBI etc.)</li></ul><br>Siemens apuesta por la igualdad de oportunidadesentre mujeres y hombres, así como la diversidad como fuente de creatividad einnovación. Contar con diferentes tipos de talento y de experiencias nos haceser más competitivos y estar mejor preparados para responder con éxito a lasdemandas de la Sociedad. Por ello, valoramos a las candidatas y a loscandidatos que reflejen la Diversidad que disfrutamos en nuestra Compañía.<br><br>#LI-AMC #LI-Hybrid<br><br><b>Organization:</b> Supply Chain Management<br><br><b>Company:</b> Siemens S.A.<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Comprador/a Material Indirecto (Temporal) (m/f/d)", "type": "external", "publication_date": "2023-05-19T23:38:55Z", "short_name": "compradora-material-indirecto-temporal-mfd", "model_type": "jobs", "id": 11404163, "locations": [{"name": "Madrid, Spain"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/compradora-material-indirecto-temporal-mfd"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong> Rolling Stock Welder</strong><br><br>Join the growing team at our world-class train manufacturing facility in Sacramento, CA. Siemens Mobility, Rolling Stock Division is the North American market leader in the production of passenger locomotives and coaches, and light rail vehicles. See links below to learn more about Siemens Mobility:<br><br><strong>https://www.youtube.com/watch?v=h8nddK1NZSk</strong><br><br><strong>https://www.mobility.siemens.com/us/en/portfolio/rail/rolling-stock.html</strong><br><br>As a Fitter/Welder, you will support a broad range of activities in a dynamic, high energy production environment in the fabrication of carbon steel and stainless-steel car bodies for the best rail vehicles in the world.<br><br><strong>What we are offering</strong><br><br>Full time position<br><br>Starting pay - $21.00/hr. (plus shift premium - 10% for 2nd shift, 20% for 3rd shift)<br><br>11 paid holidays, 18 days PTO<br><br>401K - 6% company match<br><br>Medical, dental, vision, and life insurance<br><br>Tuition reimbursement<br><br><strong>What you will be doing</strong><br><br><ul><li>Weld carbon steel or stainless-steel assemblies for car bodies or bogies.</li><li>Fit, tack, and weld component parts into subassemblies and integrated final car bodies and bogies according to detail drawings with the aid of jigs and fixtures and state-of-the-art welding equipment.</li><li>Weld assemblies according to specified welding standards.</li><li>Ensure all dimensions comply with drawing specifications and tolerances.</li><li>Repair fabrication errors according to defined repair procedures.</li><li>Safely use hand, power, and welding tools.</li><li>Complete work order documentation, quality documents, and accurately clock labor hours.</li><li>Meet company standards for quality and workmanship</li><li>Meet production schedule, quality requirements, and budgeted labor hours with limited supervision.</li><li>•      Follow all safety requirements, including use of all required personal protective equipment (PPE). Contribute to and maintain conditions that ensure a healthy and safe work environment.</li></ul><br><strong>What you need to be successful</strong><br><br><ul><li>High school education or GED</li><li>2 years MIG welding experience or completion of accredited weld education program</li><li>General mechanical background.</li><li>Basic English skills - ability to read and understand written instructions and effectively communicate verbally.</li></ul><br><strong>We would be impressed if you have</strong><br><br><ul><li>AWS certification for welding carbon steel using GMAW 3G vertical up and 4F overhead</li><li>Working knowledge of GTAW welding</li></ul><br><strong>Additional Information</strong><br><br><ul><li>Upon offer of employment, candidates will be subject to a background check and drug screen, as well as Pulmonary Function Test and Respirator Fit Test.</li><li>The physical demands described here are representative of those necessary to successfully perform the essential job duties:<ul><li>Frequently walk, reach with hands and arms, stoop, kneel, crouch, or crawl.</li><li>Occasionally required to sit; use hands to finger, handle, or feel objects, tools or controls; climb, crawl in tight spaces or balance; talk and hear.</li><li>Lift and move no more than 40 pounds.</li><li>Specific vision abilities include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to focus.</li></ul></li><li>Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions.</li><li>Welders are required to wear a Powered Air Purifying Respirator (PAPR), and other required protective equipment.</li></ul><br><strong>Our Values</strong><br><br><strong>We stay at the forefront of the rail industry</strong>. We continuously improve, learning directly from those who are doing the work.<br><br><strong>We are optimistic about change and the possibilities it brings:</strong>  We welcome programmatic improvements and strategy shifts which will result in positive results for the world.<br><br><strong>We value our people, and we support their growth and development:</strong> Our people are at the center of our work, and we support their development by finding their level of potential development through problem-solving and in collaboration with peers.<br><br><strong>We mean what we say, and we commit to our promises: </strong>We follow through on our commitments with honesty and integrity<br><br><strong>We do more with less: </strong>We are a lean organization serving customers who are serving communities of people<strong>.</strong><br><br><strong>We are principles-based, not rules-based: </strong>We make decisions based on what we believe is best for our people and the communities we serve as opposed to adhering to a prescriptive set of immovable practices.<br><br><strong>We value diversity and strive to be inclusive in our work, both for our customer and our team members: </strong>We believe in the importance of investing in employees in alignment with our values and honoring every individual story and unique path.<br><br>#LI_CAS<br><br><b>Organization:</b> Siemens Mobility<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Welder, Rail Manufacturing", "type": "external", "publication_date": "2023-05-28T23:34:10Z", "short_name": "welder-rail-manufacturing", "model_type": "jobs", "id": 10820323, "locations": [{"name": "Sacramento, CA"}], "categories": [{"name": "Manufacturing and Warehouse"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/welder-rail-manufacturing"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>You've invested a lot of time and energy in your education. Now you want the chance to make your mark. We offer challenging opportunities for you to learn and grow professionally. In our programs, you'll be immersed in a culture of continuous improvement, with the goal of changing health care for the better.<br><br>As a Pharmacy Intern, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to progression and development through our ExperienceRx™ program, you will also be accountable for assisting the Pharmacy team in providing an excellent experience for your patients. This includes the following under the supervision of a Preceptor where legal by state law:<ul><li>Participates in all aspects of the prescription filling process</li><li>Providing Patient Counseling</li><li>Collaboration with all Healthcare Professionals to provide coordinated patient care</li><li>Offering Health Screenings and Immunizations when appropriate</li><li>Customer Service</li><li>Patient Safety</li><li>Assisting Pharmacy Patients and Front Store customers with questions</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Inventory Management</li></ul>A key component of the Pharmacy Intern's role is keeping your customers and patients healthy through adoption and participation of patient care programs. Additionally, you will:<ul><li>Display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, and inspire your Pharmacy Team by providing, supporting and recognizing excellent patient care</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Support implementation of solutions for your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Remain current on all new developments, initiatives, and training to help you provide the best experience for your patients</li><li>Seek new ways to grow, collaborate with others, and deliver better outcomes</li><li>Align others around purpose to gain support and commitment to help your patients receive the best patient care</li><li>Actively contribute to a team culture that promotes caring, energy, enthusiasm, and pride</li></ul><b>Required Qualifications:</b><ul><li>Active Pharmacy Intern License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>No pending felony charges or convictions for criminal offenses involving controlled substances</li></ul><b>Education:</b><br><br>Current enrollment in a School of Pharmacy<br><br><b>Pay Range:</b><br><br>The typical pay range for this role is:<br><br> $16.00 - $22.00 <br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including year in pharmacy school, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit   jobs.CVSHealth.com/benefits <br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated. <br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.<br><br>Whether in our pharmacies or through our health service offerings, we are pioneering a bold new approach to total health care. As health care innovators, we are making quality care affordable, accessible, simple and seamless. We await your fresh ideas, new perspectives, and the unique contributions you will make to our organization.<br><br>Whether in our pharmacies or through our health service offerings, we are pioneering a bold new approach to total health care. As health care innovators, we are making quality care affordable, accessible, simple and seamless. We await your fresh ideas, new perspectives, and the unique contributions you will make to our organization.<br><br>Whether in our pharmacies or through our health service offerings, we are pioneering a bold new approach to total health care. As health care innovators, we are making quality care affordable, accessible, simple and seamless. We await your fresh ideas, new perspectives, and the unique contributions you will make to our organization.</p>", "name": "Pharmacy Intern", "type": "external", "publication_date": "2024-03-17T12:36:12Z", "short_name": "pharmacy-intern-c7bd7e", "model_type": "jobs", "id": 13854691, "locations": [{"name": "Ontario, CA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Internship", "short_name": "internship"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-intern-c7bd7e"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b> Independently designs, developers and delivers application assets and may lead others in the development of cost effective application and program solutions. Leads as chief technical contributor to translation of business requirements to technical specifications.<br><br>Leads as technical contributor in the<br><br>design of new applications or enhancements including integration of<br><br> purchased solutions. C ollaborates with Enterprise Architect teams to implement appropriate solutions based on scope, budget, project goals and enterprise long-term strategic architecture.   Devises or modifies procedures to solve complex problems considering system capacity and limitations, operating time, and form of desired results.<br><br>Independently performs and assists other team<br><br>members in providing ongoing system maintenance, research, problem<br><br>resolution and on-call support tasks for existing systems. Is fully familiar<br><br>and compliant with the efficient utilization of DevOps and responsible for design compliance for all aligned resources. Oversees or<br><br>performs unit testing.   Will perform or assist with integration and system<br><br>testing, according to detailed test plans to ensure high-quality systems.<br><br>May assist business partners with User Acceptance Testing. With limited<br><br>direction, supports the implementation of systems into production, including<br><br>integration of purchased solutions. Responsible for Code Asset<br><br>Management for an application or set of applications. Supports and<br><br>promotes the reuse of assets across the organization. Will lead as a<br><br>subject matter expert for projects and/or service requests impacting an<br><br>application or set of applications. Serves as team leader to direct technical<br><br>activities, while also providing support for small and large highly complex<br><br>projects that require increased skill across multiple technical environments<br><br>and disciplines   Receives some supervision and direction as regards<br><br>prioritization of work but is competent to work independently and to offer<br><br>direction and oversight to assigned team.<br><br><b>Required Qualifications</b><br><br>8+ years of experience in programming language, development tools, and/or databases<br><br>8+ years' experience in application program development<br><br><b>Specific Technology Qualifications</b><br><br>Mastery of : Microsoft Technologies including .Net 6.0, .Net 4.8<br><br>Mastery of : C#, SQL Server, SQL Scripting, API Connectivity,<br><br>Competency in : React, CSS, J Script,<br><br>Competency in : DevOps Tooling &amp; Workflow - CI/CD (ie. Jenkins, GitHub, TeamCity)<br><br>Familiarity in : Cloud Tech (Azure, Google, AWS), Containerization, NoSQL<br><br><b>Education</b><br><br>Bachelor's in Computer Science or equivalent work experience required<br><br>Master's in Computer Science preferred<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$118,450.00 - $236,900.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above.  This position also includes an award target in the company's equity award program. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies. <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 04/30/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Sr. Application Development Engineer", "type": "external", "publication_date": "2024-03-17T12:32:18Z", "short_name": "sr-application-development-engineer", "model_type": "jobs", "id": 13946919, "locations": [{"name": "Scottsdale, AZ"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/sr-application-development-engineer"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li></li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $18.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:15:37Z", "short_name": "store-associate-baefca", "model_type": "jobs", "id": 14357487, "locations": [{"name": "Durham, NC"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-baefca"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Siemens Smart Infrastructure is searching for an Sr. Project Manager to support our growing EPS (Energy Performance Solutions) business.  In this role, you will be responsible for all projects activities for large performance contracting guaranteed energy savings projects within your area of responsibility.  This position can be based out of any of our branch locations. Work from home option is possible,<br><br><strong>Responsibilities:</strong><br><br>Knowledge of utility rebates and performance contracting legislation preferred but not required.<br><br>Strong mechanical and HVAC systems knowledge and experience is preferred.<br><br>Federal work experience is preferred but not required.<br><br>Responsibilities include estimating, design verification, knowledge of building codes, project scheduling, equipment start-up, commissioning, and project close out.<br><br>Generate written project scope work for sub contractors as reflected in the design intent or within existing plans and specifications. Complete responsibility for all project financials including cost management and monthly forecasting. Prepare customer progress billings accurately and on time. Approve payments to material suppliers and subcontractors.<br><br>Obtain contractor and materials bids for each project. Responsible for all coordination of customer project meeting and accurately provide and document meeting minutes. Responsibilities include defining project budgets and schedules in the project acquisition phase. <br><br>Qualified candidate shall be proficient in Excel, Word, MS Project or Primavera and Outlook. Excellent written and oral communication skills required. <br><br> Basic Function<br><br>Manages large, more complex jobs or multiple projects from pre-booking to customer acceptance.  Supervises, directs and motivates the project team during planning, estimating, design, installation, start-up, commissioning, turnover and warranty of assigned projects.  Ensures customer satisfaction during and at final project completion.<br><br>Strong knowledge of industry fundamentals and business operations; Excellent contracting skills; An understanding of job financial reports and the ability to apply these in managing assigned projects; Strong leadership, listening, verbal and written communication skills.   A Minimum of 5 years Previous project management experience.<br><br> Essential Duties<br><br>Participates in pre-bid reviews and sales to operations turnover meetings to evaluate accuracy of the sales estimate and job layout.  Analyzes plans, construction contract specifications and codes to determine project requirements.  Follows up with appropriate management to assure understanding and satisfaction of job scope.<br><br> Manages the development of project plans in advance of project activity assuring effective execution by the Project Team.  Monitors progress to assure compliance with the pre-determined execution plan.<br><br> Prepares or oversees preparation of engineering re-estimate reports.  Utilizes financial and monthly forecasting to manage and contain costs.  Utilizes financial and monthly forecasting tools and works with other team members to monitor, manage and control costs.  Prepares or oversees preparation of progress billings, pursues timely payments from the customer and authorizes payments to material suppliers and subcontractors.<br><br> Obtains bids and utilizes procurement to select subcontractors to provide wiring, device installation, special construction or other services.<br><br> Participates in job site final walk-thru and manages the completion of all close-out documentation such as As-Built drawings and system operating instructions; transfers or excess materials; billings, collections and payments; and all project records.<br><br>Drives project development to hit OI target and schedule.<br><br>- Strong knowledge of industry fundamentals and business operations; Excellent contracting skills; An understanding of job financial reports and the ability to apply these in managing assigned projects; Strong leadership, listening, verbal and written communication skills.<br><br>-  <strong>Qualifications:</strong><br><br> - Bachelor's or Associate's Degree in a technical field preferred, however, candidates with a minimum of a High School Diploma or GED equivalency, along with strong mechanical and HVAC experience will also be considered.<br><br>- Minimum of 5 years' experience managing large energy or mechanical commercial/industrial building projects (over $500K).<br><br>-Proficient in Excel, Word, MS Project or Primavera and Outlook. Excellent written and oral communication skills required. <br><br>- Qualified Applicants must be legally authorized for employment in the United States. Qualified Applicants will not require employer sponsored work authorization now or in the future for employment in the United States.<br><br>- Must be capable of up to 65% travel.<br><br> - Knowledge of utility rebates and performance contracting legislation preferred but not required.<br><br> - Strong mechanical and HVAC systems knowledge and experience is preferred.<br><br> - Federal and public jobs (with an understanding of prevailing wages) work experience is preferred but not required.<br><br> - Estimating, design verification, knowledge of building codes, project scheduling, equipment start-up, commissioning, and project close out.<br><br>-Individual must possess a legal drivers license<br><br>#RSS<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Mid-level Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Senior Project Manager EPS - Syracuse(NY)", "type": "external", "publication_date": "2023-01-14T23:33:54Z", "short_name": "senior-project-manager-eps-syracuseny", "model_type": "jobs", "id": 10369313, "locations": [{"name": "Syracuse, NY"}], "categories": [{"name": "Project Management"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/senior-project-manager-eps-syracuseny"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:27:41Z", "short_name": "pharmacy-technician-1a9817", "model_type": "jobs", "id": 14149046, "locations": [{"name": "Dallas, TX"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-1a9817"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Operations Manager is a member of the Store Management team, and as such, fulfills the company purpose of helping people on their path to better health by driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. Under the supervision of the Store Manager, the Operations Manager will maintain an engaged, productive store team through strong leadership, demonstrating initiative and leading by example.<br><br>The Operations Manager is responsible for supporting the Store Manager in the total leadership and strategic operation of a CVS/pharmacy store including:<ul><li>Overall store management, supervision, and policy implementation</li><li>Sales and inventory management</li><li>Employee staffing, training, and development</li><li>Financial management</li><li>Customer service leadership</li></ul>Unlike the Store Manager in Training position, the Operations Manager position is not part of the CVS/pharmacy Retail Management Development Program. Operations Managers are not eligible for direct promotion to Store Manager. Candidates with a short-term goal of becoming a CVS Store Manager should instead apply for Store Manager in Training openings.<br><br>Essential Functions:<br><br>1. Management<br><br>Lead others and work effectively with store crews<br><br>Supervise, assign and direct activities of the store's crew<br><br>Effectively communicate information to store crew and supervisors in an open and timely manner<br><br>Support Store Manager with actions plans for operational and service improvement<br><br>2. Customer Service<br><br>Assist customers with their questions, problems and complaints<br><br>Promote CVS customer service culture (greet, offer help, and thank)<br><br><b>Required Qualifications</b><ul><li>Deductive reasoning ability, advanced analytical skills and computer skills.</li><li>Advanced communication skills, leadership, supervision, and influencing skill</li><li>Ability to work a full-time flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed, and to respond to urgent issues at the store when they arise</li></ul><b>Preferred Qualifications</b><ul><li>Experience as a retail manager or supervisor</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$17.00 - $25.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Operations Manager", "type": "external", "publication_date": "2024-03-17T12:47:59Z", "short_name": "operations-manager-9087db", "model_type": "jobs", "id": 12629147, "locations": [{"name": "East Lansing, MI"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/operations-manager-9087db"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Art der Anstellung:</strong> Befristet<br> <br><strong>Dein Wissen als Sprungbrett.</strong><br><br>Wie wäre es: Willst du Seite an Seite mit Profis und Experten die cleverste Lösung finden? Dann fertige bei uns deine Bachelor- oder Masterarbeit an! Wir helfen dir dabei, Wissen zu bündeln, Zusammenhänge zu beleuchten, Thesen zu formulieren. Du erhältst mit uns Einblicke in vielfältige Bereiche und Prozesse. Eine Chance wie keine andere, um neue Wege in die Zukunft der Elektrifizierung, Automatisierung und Digitalisierung zu gehen. Ergreife sie jetzt!<br> <br><strong>Wir setzen um, worauf es ankommt. Das ist dein Beitrag.</strong><br><br>In der Digital Factory Division der Siemens AG arbeiten wir an den neuesten Technologien für die Zukunft der Industrie. Eines der wichtigsten Gebiete der Industrie der Zukunft ist das Themengebiet der industriellen Kommunikation. Daten sind der Rohstoff des 21. Jahrhunderts. Eine performante, jederzeit verfügbare und sichere Datenübertragung ist die Voraussetzung für die Digitalisierung. Das Expert House des Customer Service unterstützt dabei die aktuellen Entwicklungen der Industrie 4.0 mit bestem Know-How.<br><br><ul><li>Du erstellst deine Abschlussarbeit im Bereich der industriellen Kommunikation zu Security im industriellen Umfeld</li><li>Hierbei werden modernste Automatisierungssysteme und Softwareentwicklungswerkzeuge in einem praxisbezogenen Kontext angewendet</li><li>Deine Abschlussarbeit umfasst die Konzeption, Entwicklung und Validierung einer Anwendung für zukünftige industrielle Kommunikationslösungen im Cyber Security von Anlagen</li><li>Du profitierst von der Erfahrung und dem technischen Know-How erfahrener Teammitglieder</li><li>Basierend auf Schwachstellendetektion und Netzwerkanalyse entwickelst und evaluierst du neue Security Ansätze und Lösungen</li></ul><br><strong>Dein Profil für \"Zukunft möglich machen\".</strong><br><br><ul><li>Du studierst derzeit in der Fachrichtung Informatik, Elektro-, Automatisierungs-, Informationstechnik oder in einer ähnlichen Studienrichtung</li><li>Du bringst Kenntnisse der IT-Netzwerktechnik und deren Kommunikationsprotokolle mit</li><li>Idealerweise besitzt du Kenntnisse zu SIMATIC Programmierschnittstellen und Bausteinen </li><li>Du verfügst über Neugier, Lerneifer und eine gute Auffassungsgabe</li><li>Du hast Kenntnisse in den diversen aktuellen Programmiersprachen</li><li>Du besitzt sehr gute Deutsch und Englischkenntnisse</li><li>Dich zeichnet deine selbstständige, strukturierte und zielorientierte Arbeitsweise aus</li></ul><br><strong>Dein kleiner Schritt in Richtung großartiger Siemens-Welt.</strong><br> <br><strong>www.siemens.de/jobs/experthouse<br><br></strong>Wenn du darüber hinaus noch Fragen hast, wende dich gerne an uns: www.siemens.de/fragenzurbewerbung.<br><strong>www.siemens.de/karriere</strong><br>wenn du mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchtest.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br>#dicseh<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens AG<br><br><b>Experience Level:</b> Student (Not Yet Graduated)<br><br><b>Full / Part time:</b> Either</p>", "name": "Abschlussarbeit (Bachelor) im Bereich industrielle Kommunikation - OPC UA - strukturierte Daten bis in die Cloud", "type": "external", "publication_date": "2023-01-16T23:32:31Z", "short_name": "abschlussarbeit-bachelor-im-bereich-industrielle-kommunikation-opc-ua-strukturierte-daten-bis-in-die-cloud-079a1c", "model_type": "jobs", "id": 10619530, "locations": [{"name": "Erlangen, Germany"}], "categories": [{"name": "Unknown"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/abschlussarbeit-bachelor-im-bereich-industrielle-kommunikation-opc-ua-strukturierte-daten-bis-in-die-cloud-079a1c"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<div><p>We're Celonis, the global leader in Process Mining technology and one of the world's fastest-growing SaaS firms. We believe there is a massive opportunity to unlock productivity by placing data and intelligence at the core of business processes - and for that, we need you to join us.</p></div>\n\n<p>We are seeking a Tax Manager, reporting to a Sr. Manager, to prepare the global tax provision and assist in the management of our US income tax compliance.</p>\n\n<p>The preparation of the global tax provision will include developing and implementing global tax accounting workpapers and processes in order to efficiently prepare the interim and annual global tax provision.  The ideal candidate will have excellent communication and project management skills, the ability to work well with various business partners and functions and be highly organized with the ability to pay close attention to detail.  This role will also assist with US income tax compliance including designing and implementing tax efficient workpapers, managing third party service providers, and ensuring we are filing in all relevant jurisdictions.</p>\n\n<p><strong>Primary Responsibilities:</strong></p>\n\n<ul>\n<li>Preparation of the quarterly and annual tax provision under ASC 740 including financial statement disclosures</li>\n<li>Manage and oversee various aspects of corporate income tax compliance prepared by a third-party provider</li>\n<li>Prepare technical tax research and compliance memos and clearly communicate technical concepts to various users</li>\n<li>Develop, implement and maintain tax accounting controls and SOX 404 documentation</li>\n<li>Support process improvement initiatives to increase overall efficiency of the tax accounting process</li>\n<li>Research various income tax accounting matters and determine impact of new accounting standards and tax legislation on the tax provision calculation</li>\n<li>Support tax audits as necessary</li>\n<li>Assist with the day-to-day tax operations and the compliance obligations of our growing business</li>\n<li>Partner with business leaders, tax, finance, treasury, legal, and external advisers on various business initiatives and tax planning</li>\n</ul>\n\n<p> <strong>Knowledge and Skill Requirements:</strong></p>\n\n<ul>\n<li>5 yrs+ general tax experience with significant experience with the preparation of a global tax provision</li>\n<li>Strong technical knowledge and practical experience dealing with U.S. corporate income tax issues for a multinational corporation</li>\n<li>Strong understanding of ASC 740 Accounting for Income Taxes</li>\n<li>Preferred but not required – practical experience with international tax computations such as GILTI, Subpart, FTC, etc</li>\n<li>Preferred but not required – familiarity with transfer pricing concepts</li>\n<li>CPA License and/or Masters in Taxation</li>\n<li>Strong excel skills and some experience with provision or compliance software</li>\n<li>Detail oriented with ability to be flexible, learn new things, multi-task, prioritize, and meet deadlines</li>\n<li>Sound judgment and ability to provide recommendations regarding policy and strategy</li>\n<li>Strong accounting, analytical, and communication skills</li>\n</ul>\n\n<div><div><div><span>The base salary range below is for the role in the specified location, based on a Full Time Schedule. <br><br>Total compensation package will include base salary + bonus/commission + equity + benefits (health, dental, life, 401k, and paid time off). Please note that the base salary range is a guideline, and that the actual total compensation offer will be determined based on various factors, including, but not limited to, applicant's qualifications, skills, experiences, and location.</span></div><div>The base salary range below is for the role in New York, based on a Full Time Schedule.  </div><div><span>$100,000</span><span>—</span><span>$135,000 USD</span></div></div></div>\n\n<div><p><strong>What Celonis can offer you:</strong></p>\n<ul>\n<li>The unique opportunity to work with industry-leading process mining technology</li>\n<li>Investment in your personal growth and skill development (clear career paths, internal mobility opportunities, L&amp;D platform, mentorships, and more)</li>\n<li>Great compensation and benefits packages (equity (restricted stock units), life insurance, time off, generous leave for new parents from day one, and more)</li>\n<li>Physical and mental well-being support (subsidized gym membership, access to counseling, virtual events on well-being topics, and more)</li>\n<li>A global and growing team of Celonauts from diverse backgrounds to learn from and work with</li>\n<li>An open-minded culture with innovative, autonomous teams</li>\n<li>Business Resource Groups to help you feel connected, valued and seen (Black@Celonis, Women@Celonis, Parents@Celonis, Pride@Celonis, Resilience@Celonis, and more)</li>\n<li>A clear set of <a href=\"https://www.celonis.com/company/values/\">company values</a> that guide everything we do: Live for Customer Value, The Best Team Wins, We Own It, and Earth Is Our Future</li>\n</ul>\n<p><strong>About Us</strong></p>\n<p>Since 2011, Celonis has helped thousands of the world's largest and most valued companies deliver immediate cash impact, radically improve customer experience and reduce carbon emissions. Its Process Intelligence platform uses industry-leading process mining technology and AI to present companies with a living digital twin of their end-to-end processes. For the first time, everyone in an organisation has a common language about how the business works, visibility into where value is hidden and the ability to capture it. Celonis is headquartered in Munich (Germany) and New York (USA) and has more than 20 offices worldwide.</p>\n<p>Join us as we make processes work for people, companies and the planet.</p>\n<p><br>Celonis is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. <a href=\"https://www.celonis.com/careers/diversity/\">Different makes us better</a>.</p>\n<p><span><a href=\"https://www.celonis.com/careers/candidate-notices/\">Accessibility and Candidate Notices</a></span></p></div>", "name": "Manager, Tax", "type": "external", "publication_date": "2024-03-14T23:06:34Z", "short_name": "manager-tax", "model_type": "jobs", "id": 14305166, "locations": [{"name": "New York, NY"}], "categories": [{"name": "Accounting and Finance"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/celonis/manager-tax"}, "company": {"id": 15000205, "short_name": "celonis", "name": "Celonis"}}, {"contents": "<p><strong>DoD SkillBridge Internship - Technician/Specialist - Salt Lake City, UT</strong><br><br>This opportunity is unique to active-duty US Military Service members with formal approval to participate as a DoD SkillBridge Intern in collaboration with Vets2PM's authorized DoD SkillBridge program.<br><br><strong>Desired Military Experience, Backgrounds and/or Aptitude:</strong><br><br><ul><li>Civil Engineering (HVAC &amp; Electrician)</li><li>Mechanical/Electrical/Electronic/Computer Systems</li><li>Automation/Integration Technicians &amp; Specialists</li><li>Nuclear Engineering/Power/Energy</li><li>Satellite/Radar Systems</li><li>Comm Techs</li><li>Fire Control Navaids</li><li>Submarine Electronics/Computer Techs</li><li>Avionics Systems &amp; more!</li></ul><br><strong>About our Smart Buildings:</strong><br><br>Because we spend 90% of our lives in buildings, they should be perfect places for all we do. Smart buildings enhance the experience. Interacting with people, systems, and ambient elements, they learn from experience and real-time input. Using intelligent control, security, and energy management systems, we help factories and offices better support the industries they house. We help schools, hospitals, data centers, and military bases have a great impact - all while increasing comfort, efficiency, resilience, and safety. Our Smart Buildings help to create efficient, safe, responsive, and responsible environments. Our aim isn't just about improving buildings; it's about creating perfect places that improve peoples' lives.<br><br>&gt;&gt;Lean more about Siemens Smart Buildings<br><br><strong>Our Three Main Business Groups that you could be assigned to:</strong><br><br><ul><li>Building Automation: HVAC Controls, Lighting Controls, and Mechanical/Electrical Services</li><li>Fire/Life Safety: Fire Alarm, Mass/Emergency Communication, and Sprinkler/Suppression</li><li>Security: Integrated Surveillance and Access Controls</li></ul><br><strong>What Technicians/Specialists do for Siemens Smart Infrastructure: </strong> <br><br>Technicians/Specialists are the people that (for <strong>Service</strong>) gather data, troubleshoot, and carries-out critical maintenance and repairs; or (for <strong>Solutions</strong>) install new equipment, run start-up, and commission systems in our customers' HVAC/Building Automation, Fire/Life Safety, or Integrated Security systems in large commercial buildings such as hospitals, universities, and military bases. <strong>Why is this so important?</strong> The Technician/Specialist is the face of Siemens, and your expertise and regular interaction with the customer will help them save energy, money, and create a more sustainable future for our environment. <br><br><strong>Responsibilities:</strong><br><br><ul><li>Meet with the customers (for <strong>Service</strong>) to diagnose their HVAC/Building Automation, Fire/Life Safety, or Integrated Security electronic control system malfunctions and use your expertise to maintain, repair, or (for <strong>Solutions</strong>) install new equipment; commissioning if needed</li><li>Consult with our internal engineering and management team for discrepancies in our drawings or as problems arise</li><li>Interface with the customers: complete the service work documentation, assist them with training instructions needed for future ease-of-use, and (most importantly) recommend system enhancements providing a value-added partner relationship</li></ul><br><strong>Qualifications:</strong><br><br><ul><li><strong>U.S. Military experience as an E4 or above (Navy, Air Force, Army, Marines, Coast Guard, Space Force, National Guard, Reserves)</strong></li></ul><ul><li>High school diploma or state-recognized GED required; Associates degree preferred</li><li>Electro-mechanical aptitude/knowledge/skills</li><li>Knowledge of Building Automation Controls, Fire/Life Safety or Integrated Security systems preferred</li><li>For positions related to Fire/Life Safety: knowledge of NFPA codes and ability to obtain certification in NICET I is preferred</li><li>Computer and software skills</li><li>Microsoft Office and Microsoft Project experience preferred</li><li>Qualified applicants must be legally authorized for employment in the United States</li><li>Must be 21 years of age and possess a valid driver's license with limited violations</li><li>You must be able to read/understand design and construction documents; work in a variety of environments in and around mechanical equipment, including climbing ladders, scaffolds, and high-lift equipment, working in ducts, above ceilings, and in outside/inside/heat/cold/day/night conditions; use hand tools, laptop, email, smartphone, and tablet; carry and move equipment and tools weighing up to 50 pounds unassisted</li></ul><br>This position may support Siemens' customers who require all employees and vendors to be fully vaccinated against COVID-19 where permitted by applicable law and in accordance with an accommodation based on legally protected reasons. <br><br><strong>Why work for Siemens as a </strong><strong>SkillBridge Intern</strong><strong>?</strong><br><br>You will gain hands-on experience during your internship and will have the opportunity to join (upon successful completion of the internship) one of the world's largest and best-known companies as acknowledged in 2022 by:<br><br><strong>Fortune:</strong> World's Most Admired Companies<br><br><strong>Forbes:</strong> America's Best Large Employers, America's Best Employers for Diversity, and Best Employers for New Graduates<br><br><strong>Fast Company:</strong> Most Innovative Companies and World Changing Ideas Awards<br><br><strong>Corporate Equality Index:</strong> Best Places to Work for LGBTQ+ Equality<br><br>We offer our full-time employees (post-SkillBridge) an excellent benefits/compensation package, growth/learning/development opportunities, and a diverse/inclusive culture where everyone plays their part and makes an impact for our team and our customers.<br><br>#RSS<br><br>#DODSB<br><br>#LI-CR1<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-Time temporary<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "DoD SkillBridge Internship - Technician/Specialist - Salt Lake City, UT", "type": "external", "publication_date": "2023-05-13T23:33:38Z", "short_name": "dod-skillbridge-internship-technicianspecialist-salt-lake-city-ut-a6b8c0", "model_type": "jobs", "id": 11371281, "locations": [{"name": "Cadillac, MI"}], "categories": [{"name": "Data and Analytics"}], "levels": [{"name": "Internship", "short_name": "internship"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/dod-skillbridge-internship-technicianspecialist-salt-lake-city-ut-a6b8c0"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $19.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:47:58Z", "short_name": "store-associate-35f8b2", "model_type": "jobs", "id": 12829448, "locations": [{"name": "Norwood, MA"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-35f8b2"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li></li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $22.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:42:26Z", "short_name": "shift-supervisor-trainee-5defac", "model_type": "jobs", "id": 13539656, "locations": [{"name": "Manhattan, NY"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-5defac"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}], "aggregations": {}}