{
    "page": 20,
    "page_count": 15640,
    "items_per_page": 20,
    "took": 18,
    "timed_out": false,
    "total": 312784,
    "results": [
        {
            "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health -from advising on prescriptions to helping manage chronic and specialty conditions.   As Pharmacy Manager, you have one of the most significant roles in our company - delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to leading and directing your Pharmacy Staff, comprised of both staff Pharmacists and Pharmacy Technicians, you are accountable for the management, oversight and operation of all aspects within your pharmacy.   This includes: <br>•  Patient Safety <br>•  Pharmacy Professional Practice  <br>•  Regulatory Requirements <br>•  Quality Assurance <br>•  Customer Service  <br>•  Personnel Management  <br>•  Inventory Management <br>•  Financial Profitability  <br>•  Loss Prevention <br>•  Workflow Management <br>A key component of the Pharmacy Manager role is keeping your customers and patients healthy through adoption and management of patient care programs.   Additionally, you will: <br>•  Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team <br>•  Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps <br>•  Identify critical business opportunities and meaningful solutions to drive growth and improve performance in your pharmacy <br>•  Successfully implement those solutions by leading your team to achieve specified goals  <br>•  Adapt to change and adjust plans to thrive in a dynamic community healthcare setting  <br>•  Seek new ways to grow, collaborate with others and deliver better outcomes  <br>•  Align others around purpose to gain support and commitment  <br>•  Facilitate a 'team' culture that promotes caring, energy, enthusiasm and pride  <br>•  Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors  <br><em>The above represents a summary of the functions of a Pharmacy Manager. Additional functions and physical requirements are available on the full job description.<br><br><b>Required Qualifications</b><br>•  Active Pharmacy License in the state in which you are employed <br>•  Not on the DEA Excluded Parties List  <br>•  Immunization Certification through an accredited organization (i.e. APhA)</em> <br>•  Listed on the pharmacy state license as the 'pharmacist in charge' <br>•  Submission of required information/documents to your state PMP administrator to register for PMP access (in states with active PMP for pharmacist use).<br><br><b>Preferred Qualifications</b><br><br><b>Education</b><br><br>Bachelor of Science in Pharmacy or Pharm. D. degree<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$65.00 - $81.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Pharmacy Manager",
            "type": "external",
            "publication_date": "2024-03-17T12:39:34Z",
            "short_name": "pharmacy-manager-2e045c",
            "model_type": "jobs",
            "id": 13718272,
            "locations": [
                {
                    "name": "Owings Mills, MD"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-manager-2e045c"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Pharmacy Technician",
            "type": "external",
            "publication_date": "2024-03-17T12:36:11Z",
            "short_name": "pharmacy-technician-7715e1",
            "model_type": "jobs",
            "id": 13894447,
            "locations": [
                {
                    "name": "Colonial Heights, VA"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-7715e1"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p><b>Job Title</b><br>Senior Communications Manager, Sleep &amp; Respiratory Care US : Pittsburgh, PA and Cambridge, MA<br><br><b>Job Description</b><br><br><b>Senior Communications Manager, Sleep &amp; Respiratory Care US </b><br><br>Join a world-class communications team focused on delivering communications program for Philips' Sleep &amp; Respiratory Care Business. You have the opportunity and responsibility to deliver high quality internal/ external communication services to the leadership and its global employee base, including employee engagement, customer experience, thought leadership and transformation programs.<br><br>The Global Business Communications team, which is part of Global Communications and Brand department, delivers high quality communication and brand services to Philips' leadership and Business Units. Our shared mission is to drive our culture and reputation to create a loved brand that fulfils our purpose and creates value with sustainable impact. You will report io the Head of Communications for Sleep &amp; Respiratory Care.<br><br><b>Your role:</b><ul><li>Developing and managing internal and external communications programs that support the Sleep &amp; Respiratory Care communications plan. The program(s) may include preparation of content and execution of a range of a number of strategic and tactical elements, for example:<ul><li>Thought leadership content.</li><li>Internal/External speaking engagements.</li><li>Media and Social Media programs.</li><li>Crisis and Issues management.</li><li>Merger and Acquisition support.</li><li>Employee engagement and communications.</li><li>Company, customer and industry events.</li><li>Public Affairs and sustainability.</li></ul></li><li>Ensuring understanding, joint-ownership and support of communications programs with business leadership</li><li>Sharing programs and subject expertise with market (and other) communications colleagues for activation/amplification</li><li>Managing key Sleep &amp; Respiratory events, including key trade/ business events and global webcasts</li><li>Acting as a trusted advisor to various Business Unit leaders within Sleep &amp; Respiratory Care and supporting these leaders to reach employee engagement scores through the delivery of communications guidance and tools.</li><li>Measuring the success of the communications programs and ensuring they are delivered on-time, on-budget and meet or exceed agreed KPIs.</li><li>Continuously adapting and evolving your programs based on feedback and results.</li></ul><b>You're</b><b> the right fit if: </b><ul><li>University Degree-level education, with at least 7 years of experience in communications in an international matrixed/business environment.</li><li>Experience in developing and executing integrated communications plans.</li><li>Strong stakeholder management experience with multiple and diverse groups, including business leaders.</li><li>Experience briefing and manage a communications/PR agency.</li><li>Strong project management and analytical skills, and ability to juggle multiple projects simultaneously.</li><li>Proven experience using a variety of internal and external communications channels.</li><li>Native-level English (written and spoken); proven ability to write impactful speeches, presentations, blogs, opinion pieces; etc.</li><li>You must be able to successfully perform the following minimum Physical, Cognitive and Environmental job requirements with or without accommodation for this Office/Remote position.</li></ul><b>About Philips</b><br><br>We are a health technology company. We built our entire company around the belief that every human matters, and we won't stop until everybody everywhere has access to the quality healthcare that we all deserve. Do the work of your life to help improve the lives of others.<ul><li>Learn more about our business .</li><li>Discover our rich and exciting history. </li><li>Learn more about our purpose. </li><li>Read more about our employee benefits .</li></ul>If you're interested in this role and have many, but not all, of the experiences needed, we encourage you to apply. You may still be the right candidate for this or other opportunities at Philips. Learn more about our commitment to diversity and inclusion here .<br><br><b> Additional Information </b><br><br>US work authorization is a precondition of employment. The company will not consider candidates who require sponsorship for a work-authorized visa, now or in the future.<br><br>Company relocation benefits <b> will not </b> be provided for this position.  For this position, you must reside in <b> or </b> within commuting distance to <b>Pittsburgh, PA or Cambridge, MA . </b><br><br>Philips is an Equal Employment and Opportunity Employer/Disabled/Veteran and maintains a drug-free workplace.</p>",
            "name": "Senior Communications Manager, Sleep & Respiratory Care  US : Pittsburgh, PA and Cambridge, MA",
            "type": "external",
            "publication_date": "2024-02-03T12:41:08Z",
            "short_name": "senior-communications-manager-sleep-respiratory-care-us-pittsburgh-pa-and-cambridge-ma",
            "model_type": "jobs",
            "id": 13895541,
            "locations": [
                {
                    "name": "Pittsburgh, PA"
                }
            ],
            "categories": [
                {
                    "name": "Media, PR, and Communications"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/philips/senior-communications-manager-sleep-respiratory-care-us-pittsburgh-pa-and-cambridge-ma"
            },
            "company": {
                "id": 1103,
                "short_name": "philips",
                "name": "Philips"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.50 - $19.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Store Associate",
            "type": "external",
            "publication_date": "2024-03-17T12:50:30Z",
            "short_name": "store-associate-dfee72",
            "model_type": "jobs",
            "id": 12298844,
            "locations": [
                {
                    "name": "Huntington Park, CA"
                }
            ],
            "categories": [
                {
                    "name": "Retail"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-dfee72"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Pharmacy Technician",
            "type": "external",
            "publication_date": "2024-03-17T12:45:18Z",
            "short_name": "pharmacy-technician-a8b096",
            "model_type": "jobs",
            "id": 13227213,
            "locations": [
                {
                    "name": "Bridgeport, CT"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-a8b096"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Pharmacy Technician",
            "type": "external",
            "publication_date": "2024-03-17T12:27:42Z",
            "short_name": "pharmacy-technician-26d3b2",
            "model_type": "jobs",
            "id": 14100537,
            "locations": [
                {
                    "name": "West Chester, PA"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-26d3b2"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Pharmacy Technician",
            "type": "external",
            "publication_date": "2024-03-17T12:45:19Z",
            "short_name": "pharmacy-technician-4968c8",
            "model_type": "jobs",
            "id": 13190810,
            "locations": [
                {
                    "name": "Laurel, MD"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-4968c8"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p><b>Earn $2,000 in Kansas City when you give 170 rides in 30 days. New drivers only. Terms apply.</b><br><br>We're looking for a few good drivers. Lyft is excited to launch the highly requested Women+ Connect feature across the country which offers more choice, opportunity, and peace of mind for women and nonbinary drivers. We're making Lyft better for everyone.<br>Sign up today and all drivers of any gender are eligible to receive our new driver offer.<br><br><b>What is Lyft?</b><br> <br> Lyft is a flexible earning opportunity and a platform that connects drivers with individuals and organizations that need rides. Driving with Lyft is the perfect way to earn money on any schedule and is a great alternative to other types of earning opportunities. Drivers can cash out any time with Express Pay. <br> <br><b>Why Lyft?</b><br><br><ul>  <li><b>Boost Your Earnings:</b> With Upfront Pay you can view the fare for a ride before you accept it, giving you more control of your earnings. Plus, you keep 100% of your tips.</li><li><b>Peace of Mind:</b> In addition to a suite of products designed to make driving more comfortable, Women and nonbinary drivers can turn on Women+ Connect to increase their chances of matching with more women and nonbinary riders, offering more control over their driving experience.</li>  <li><b>Be Your Own Boss:</b> Set your own schedule and keep control over when you drive and earn</li>  </ul><br><b>Our Vision</b><br><br><ul>  <li><b>Making Rideshare Better:</b> Diverse communities are stronger, more interesting communities. Making Lyft better for everyone</li><li><b>Community Connections:</b> Good vibes. Conversations that turn into friendships. Comfortable silence. Our Women+ Connect is here to improve the ride experience for all drivers and riders</li>  </ul><br><b>Driver Requirements</b><br><br><ul>  <li>You're at least 25 years old</li>   <li>You own an iPhone or Android smartphone</li>   <li>You have a clean driving record and auto insurance</li>   <li>You have a 4-door from 2008 or newer </li><em>Car year may vary by region<br>  <br></em>Does not apply if you are renting a car through Express Drive program</ul></p>",
            "name": "Drive with Lyft - Earn on Your Own Schedule",
            "type": "external",
            "publication_date": "2024-03-14T15:30:38Z",
            "short_name": "drive-with-lyft-earn-on-your-own-schedule-501d1f",
            "model_type": "jobs",
            "id": 14276326,
            "locations": [
                {
                    "name": "Kansas City, MO"
                }
            ],
            "categories": [
                {
                    "name": "Software Engineering"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/lyft/drive-with-lyft-earn-on-your-own-schedule-501d1f"
            },
            "company": {
                "id": 11895,
                "short_name": "lyft",
                "name": "Lyft"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health - from advising on prescriptions to helping manage chronic and specialty conditions. As Pharmacy Manager, you have one of the most significant roles in our company -  delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to leading and directing your Pharmacy Staff, comprised of both staff Pharmacists and Pharmacy Technicians, you are accountable for the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management A key component of the Pharmacy Manager role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Facilitate a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li></ul>*The above represents a summary of the functions of a Pharmacy Manager. Additional functions and physical requirements are available on the full job description.<br><br>Required Qualifications<ul><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Listed on the pharmacy state license as the 'pharmacist in charge'</li><li>Submission of required information/documents to your state PMP administrator to register for PMP access (in states with active PMP for pharmacist use)..Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 05/17/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Pharmacy Manager",
            "type": "external",
            "publication_date": "2024-03-17T12:22:28Z",
            "short_name": "pharmacy-manager-7153ed",
            "model_type": "jobs",
            "id": 14177875,
            "locations": [
                {
                    "name": "Saint Paul, MN"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-manager-7153ed"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary:<br>Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions.<br>As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management<br><br>A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li></li><li><b>Required Qualifications</b><br>Minimum Required Qualifications</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (e.g., APhA)</li><li>No pending felony charges or convictions for criminal offenses involving controlled substances</li><li></li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60.00 - $73.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Staff Pharmacist FT",
            "type": "external",
            "publication_date": "2024-03-17T12:42:28Z",
            "short_name": "staff-pharmacist-ft-474c25",
            "model_type": "jobs",
            "id": 13400444,
            "locations": [
                {
                    "name": "Danvers, MA"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/staff-pharmacist-ft-474c25"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Pharmacy Technician",
            "type": "external",
            "publication_date": "2024-03-17T12:45:18Z",
            "short_name": "pharmacy-technician-9583ba",
            "model_type": "jobs",
            "id": 13234300,
            "locations": [
                {
                    "name": "Rahway, NJ"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-9583ba"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p><strong>Senior Quality Manager (m/f/d)</strong><br><br><strong>Location: Poland</strong><br><br>We at Siemens Healthineers are committed to helping healthcare providersglobally to succeed in today's dynamic environment. We are inspired totransform the way things are done - because we want what is best for ourpeople, our customers and ultimately the health of mankind.<br><br>While we invest in engineeringexcellence - leading-edge medical technologies and services, we don't stopthere. We also deeply invest on our 68 000 people with the hearts of pioneers, highlycommitted and connected in this industry. And as we strive to shape the futureof healthcare, our overall success will depend on our ability to continuouslyreinvent ourselves.<br><br><strong>Tasks &amp; Responsibilities</strong><strong>:</strong><br><br><ul><li>Elaborates,analyses and implements quality concepts, methods, tools and procedures as partof an effective Quality Management System.</li><li>Givesguidance that risks are identified, considered, and controlled throughout thedesign and the use of the Quality Management system.</li><li>Supportthe Project Manager and Application Manager in activities related to thedevelopment and/or implementation of the software-specific quality activitiesin projects or changes.</li><li>Supportthe QM team in implementation and compliance to ISO9001, ISO 13485 and 21 CFRPart 11 implementation for the assigned projects, applications and changes asdefined in ITSM (IT process framework).</li><li>Independentlyperform special assignments and provide reporting of the activities in theproject/application.</li><li>Anticipatepotential quality problems and provide effective solutions in reaction toapplication of concepts, techniques, knowledge, or processes.</li><li>Demonstrateability to advanced technologies, processes, and practices in quality management.Serve as the leading point of authority and/or source of process knowledge forarea of expertise (quality management).</li><li>Demonstrateextensive knowledge of organization's business practices and issues faced andcontributes to problem resolution of those issues.</li><li>Trainsemployees in a specific quality area in the quality management system.</li><li>AsQuality Manager collaborate well with the counterpart for BA/BL Quality, whereapplicable.</li><li>Coachthe project and application team members in Quality Management System andProcesses application.</li><li>Beingpart of the SHS IT ST QGC QS organization support in Project Quality topics,Application lifecycle and ISO certification program.</li><li>Coordinatea group of quality-related staff without leading the team.</li><li>Coordinatean assigned international/national quality network in a specific quality area.</li></ul><br><strong>Qualification &amp; Experience</strong><br><br><ul> <li>BS/BA in related discipline,     or advanced degree, where required, or equivalent combination of education     and experience. Certification may be required in some areas.</li> <li>More than 10 years of     successful experience in Quality Management and successful demonstration     of key responsibilities and knowledge as presented above. Advanced degree     may be substituted for experience, where applicable.</li> <li>You are characterized by     your knowledge of relevant QM requirements (ISO standards and laws), have     well-founded practical experience in auditing (ISO 9001 and preferably ISO     13485)</li> <li>Knowledge in CMMI for     Services (Capability Maturity Model Integrated) is highly preferred.</li> <li>Knowledge and experience in     Software Development Lifecycle (SDLC)</li> <li>Knowledge and experience in     methodologies of software Quality Assurance / software test automation</li> <li>An understanding of     foundational PM principles including management of scope, schedule,     budget, risk, resources, quality, communications, suppliers, stakeholders,     and team operations.</li> <li>Expert level of critical     thinking in applying principles, theories, and concepts on a wide range of     problems.</li> <li>Experience in continuous     improvement processes based on learnings from field issues</li> <li>Your business-fluent English     enables you to collaborate and communicate with colleagues in an     international environment.</li> <li>You are located in Poland     (or willing to relocate)</li> <li>You are open to occasional     business travels</li></ul><br><strong>Certificates:</strong><br><br>•         Agile or SAFe certification is a plus<br><br><strong>Weoffer:</strong><br><br><ul><li>We are flexible regarding type of contract</li><li>You can work remote/hybrid/in one of our regional offices</li><li>We provide necessary tools</li></ul><br><strong>If you are interested use the\"Apply\" button.</strong><br><br><strong>Our culture:</strong><br><br>At Siemens Healthineers, we take into account different perspectives, areopen to dialogue and challenge conventions. Change is an integral part of ourwork. We strive to be a leader of change in our industry, not just to respondto them. We invite you to take on new challenges with us, test your ideas andcelebrate successes.<br><br>We highly value diversity, inclusion and equal opportunities, so wewarmly invite everyone, regardless of their gender identity, to apply for thisposition. We also encourage people with disabilities to apply.<br><br><strong>Do you want to know more? Contact us.</strong><br><br>At https://www.siemens-healthineers.com/pl/ you will find additional information about our areas of activities.<br><br>We care about data privacy and take it seriously in accordance with theGDPR and other regulations related to personal data protection. For thisreason, please do not send us your CV or other application documents by e-mail.Instead, please create your profile on our Career Portal https://jobs.siemens.com/healthineers , which allows you to submit your documents, apply for open positions andto obtain information about our vacancies and career development at Siemens.<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Healthcare Sp. z o.o.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>",
            "name": "Senior Quality Manager (m/f/d)",
            "type": "external",
            "publication_date": "2023-05-29T23:37:21Z",
            "short_name": "senior-quality-manager-mfd-cdac78",
            "model_type": "jobs",
            "id": 11434705,
            "locations": [
                {
                    "name": "Myślenice, Poland"
                }
            ],
            "categories": [
                {
                    "name": "Business Operations"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/siemens/senior-quality-manager-mfd-cdac78"
            },
            "company": {
                "id": 11913,
                "short_name": "siemens",
                "name": "Siemens"
            }
        },
        {
            "contents": "<p><strong>If you really want to make a difference - make it with us! </strong><br><br><strong>We make solutions come true!</strong><br><br>At<strong> Global Business Services (GBS)</strong>, we shape the Shared Services landscape of the future by supporting companies in all sectors worldwide. When it comes to providing valuable and outstanding business services tailored to customer's needs, we are the Partner of Choice.<br><br>For our<strong> Business Solutions &amp; Services team</strong>, we are looking for a<strong> Management Assistant with German</strong> as a new member of our global family. <br><br>Are you ready to make your ambitions a reality?<br><br><strong>Your daily responsibilities will include the following:</strong><br><br><ul><li><strong>Supporting the manager and his team </strong>located in Siemens AG, Germany</li><li>Keeping the manager's Calendar in Outlook up to date and solving all possible calendar conflicts</li><li><strong>Scheduling and coordinating</strong> the manager's meetings, team workshops and preparing all necessary documents</li><li>Approving relevant invoices, creating team orders etc.</li><li><strong>Organizing</strong> business trips and <strong>expensing</strong> all business trip costs</li><li>Booking hotels, air tickets, travel visas, and conference rooms for meetings as well as organizing business diners, team Events etc.</li><li>Regularly communicating <strong>with colleagues and clients in German language</strong></li></ul><br><strong>We care about your wellbeing! Join us and enjoy our benefits:</strong><br><br><ul><li>Working in a<strong> hybrid mode </strong>as a new global standard </li><li><strong>Competitive remuneration package</strong></li><li><strong>Empowerment</strong> and <strong>opportunity</strong> for work-life balance</li><li>Support of personal development and professional growth</li><li><strong>Multisport card</strong></li><li><strong>Additional health coverage</strong> (medical and dental care)</li><li><strong>Additional pension insurance</strong></li><li><strong>Family allowances</strong></li><li><strong>Food vouchers - 200 BGN net </strong></li><li><strong>Friendly </strong>work environment </li></ul><br><strong>Already intrigued? Here's what you should bring to the table for a successful application:</strong><br><br><ul><li><strong>Customer and quality-oriented </strong>team player with a high level of loyalty and integrity. </li><li>Good knowledge of<strong> MS-Office</strong></li><li><strong>High flexibility </strong>as well as<strong> excellent organizational skills and a proactive, structured, and independent way of working.</strong></li><li>Fluency in <strong>German </strong>and <strong>English </strong>skills at a communicative level</li></ul><br>We are<strong> an equal opportunity employer </strong>and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status.<br><br><b>Organization:</b> Global Business Services<br><br><b>Company:</b> Siemens EOOD<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time</p>",
            "name": "Management Assistant with German",
            "type": "external",
            "publication_date": "2023-05-27T23:38:47Z",
            "short_name": "management-assistant-with-german-f3fd3d",
            "model_type": "jobs",
            "id": 11446552,
            "locations": [
                {
                    "name": "Plovdiv, Bulgaria"
                }
            ],
            "categories": [
                {
                    "name": "Management"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/siemens/management-assistant-with-german-f3fd3d"
            },
            "company": {
                "id": 11913,
                "short_name": "siemens",
                "name": "Siemens"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Work as part of the Pharmacy and Front Store Team to ensure that each customer has a positive shopping experience at CVS and to ensure customer satisfaction by serving each customer according to our company Values. Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><br><br>Must be at least 16 years of age Licensure requirements vary by state Must have the ability to perform the following tasks: Customer Service<ul><li>Greet each customer in a courteous and professional manner</li><li>Assist all pharmacy and front store customers with their questions and concerns</li><li>Request additional help when needed to maximize customer satisfaction</li><li>Maintain customer/patient confidentiality according to HIPAA and company standards</li><li>Answer telephone with appropriate greeting Operations</li><li>Comply with all federal and state laws, rules and regulations</li><li>Comply with CVS policy and procedures at all times</li><li>Adhere to CVS workflow and ensure quality assurance standards are maintained at all times</li><li>Maintain prescription prioritization throughout prescription processing</li><li>Process prescriptions</li><li>Including translation of SIG codes, product selection, counting and measuring drugs, capping and uncapping vials and bottles</li><li>labeling of prescriptions</li><li>Resolve Third Party rejections and complete any manual claim forms</li><li>Perform all register transactions, in adherence of CVS policy and procedures</li><li>This includes cash, check and charge transactions</li><li>Bag merchandise upon completion of sale</li><li>Perform all prescription pick-up procedures, in adherence of CVS policy and procedures; Complete Prescription Pick-Up Log, validate customer address, Make the Offer to Counsel and direct customer to Pharmacist or Intern (if applicable)</li><li>Communicate with all healthcare professionals when permissible and according to state law</li><li>Retrieve and file prescriptions appropriately according to State and Federal Law</li><li>Participate in all required store operational meetings</li><li>Maintain a clean, organized and professional pharmacy department, according to CVS standards</li><li>Access, input and retrieve information to/from the computer</li><li>Stand for extended periods of time</li><li>Assist front store operations when needed Inventory Management</li><li>Maintain in-stock by ensuring all inventory management policies and procedures are followed</li><li>Utilize appropriate report(s) to maintain replenishment</li><li>Pull outdated, damaged and recalled merchandise and prepare for return</li><li>Assist with putting away drug orders (except CIIs) as permitted by law</li><li><b>Preferred Qualifications</b><br>Required Qualifications continued: Front Store Activities</li><li>Operate a cash register including cash transactions, checks, charges</li><li>Follow company policies and procedures regarding cash register performance</li><li>Request additional help when needed to increase customer satisfaction</li><li>Greet each customer using the eye's, hi's and help at all times and assist customers with their questions, problems and complaints</li><li>Price merchandise utilizing price guns</li><li>Store cleanliness: break area and rest rooms; vacuum; dust/face; clean windows; rubbish removal; exterior maintenance; sweeping</li><li>Stock shelves</li><li>Complete price changes: document counts, utilize price guns</li><li>Answer the telephone using the appropriate greeting</li><li>Process photofinishing orders</li><li>Maintain check-out area: fill register supplies, bags; wipe counter tops;</li><li>Issue rainchecks when requested</li><li>React to potential shoplifters following company guidelines</li><li>Maintain customer/patient confidentiality</li><li>Maintain card department: order, stock, inventory, signing</li><li>Maintain cosmetic department/units: clean, stock, set displays, sign, prepare returns (UPP system)</li><li>Reset departments/end caps following POGs</li><li>Display and sign weekly, promotional and seasonal merchandise</li><li>Prepare damages: document counts and item numbers, seal trays</li><li>In-store signing, including: shelves, displays, dump baskets, windows, ceiling</li><li>Assist Pharmacy personnel when needed</li><li>Complete minor in-store repairs i.e., carriage poles, change light bulbs</li><li>Work out reserve stock</li><li>Assist customers with large purchases (taking out to vehicle)</li><li>Unload and load trays/cases - 35 pound maximum to a height of 4 feet</li><li>Move trays/cases from one location to another Human Resources</li><li>Support scheduling activities according to the needs of the business and workflow model</li><li>Complete all required training programs</li><li>Communicate with field management and corporate any required reporting</li><li><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "pharmacy tech",
            "type": "external",
            "publication_date": "2024-03-17T12:32:15Z",
            "short_name": "pharmacy-tech-32c24d",
            "model_type": "jobs",
            "id": 14102663,
            "locations": [
                {
                    "name": "Rohnert Park, CA"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-tech-32c24d"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions. As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li><b>Required Qualifications</b></li><li>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Free of pending felony charges or convictions for criminal offenses involving controlled substances</li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60.00 - $73.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 09/30/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "District Support Pharmacist-Full Time",
            "type": "external",
            "publication_date": "2024-03-17T12:22:29Z",
            "short_name": "district-support-pharmacistfull-time-5404a7",
            "model_type": "jobs",
            "id": 14147976,
            "locations": [
                {
                    "name": "Westchester, NY"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/district-support-pharmacistfull-time-5404a7"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<div><p>SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars.</p></div>\n\n<p><strong><span>FPGA ENGINEER (STARSHIELD)</span></strong><span> </span></p>\n\n<p><span>Starshield leverages SpaceX’s launch capability and Starlink technology to support national security efforts. While Starlink is designed for consumer and commercial use, Starshield is designed for government use, with an initial focus on earth observation, communications, and hosted payloads.</span><span> </span></p>\n\n<p><span>The satellite engineering team is hiring for satellite programs that are pushing the boundaries of in-space capabilities. Our missions support scientific research, classified national security space and commercial opportunities. Software engineering and innovation is at the core of these programs. </span><span> </span></p>\n\n<p><span>The satellite software team is building highly reliable in-space networks, designing secure systems to guarantee access to space, and creating autonomous satellite operation systems, and more. Aerospace experience is not required to be successful here - we want our engineers to bring fresh ideas from all areas, love solving problems, and seek to make an impact on an inspiring mission. As we expand this team, we're looking for versatile, driven, and collaborative engineers. </span><span> </span></p>\n\n<p><span>As an FPGA engineer on the satellite digital design team, you will be designing, developing, and testing FPGAs that supports safety critical logic, sensors, optical, and communications systems for SpaceX’s satellite constellation. You will engage with other SpaceX engineers to discover the needs of the missions and code highly reliable digital designs which turns the mission into reality. You will be responsible for the complete lifecycle of the FPGA designs you create, including development, testing, and support.</span><span> </span></p>\n\n<p><span>An active Top-Secret security clearance, or ability to obtain one, is desired but not required.  </span><span> </span></p>\n\n<p><strong><span>RESPONSIBILITIES:</span></strong><span> </span></p>\n\n<ul>\n<li><span>Deliver highly reliable firmware for SpaceX-designed hardware</span><span> </span></li>\n<li><span>Work with engineers across the department to develop new products, from prototype through production and flight</span><span> </span></li>\n<li><span>Take ownership of your firmware products, including verification testing and writing documentation</span></li>\n<li>Follow the SpaceX flight software development process and write great firmware for spaceflight</li>\n<li>Work in close collaboration with avionics, software, and platform engineers to design and validate FPGA designs<span> </span></li>\n</ul>\n\n<p><strong><span>BASIC QUALIFICATIONS:</span></strong><span> </span></p>\n\n<ul>\n<li><span>Bachelor’s degree in computer science, electrical engineering, math or other STEM discipline; OR 2+ years of professional software development experience in lieu of a degree</span></li>\n<li><span>Experience using Verilog, SystemVerilog, or VHDL</span><span> </span></li>\n</ul>\n\n<p><strong><span>PREFERRED SKILLS AND EXPERIENCE:</span></strong><span> </span></p>\n\n<ul>\n<li><span>Experience working with complex digital designs</span><span> </span></li>\n<li><span>Experience in different stages of FPGA development: RTL design, verification, synthesis, timing analysis, lab bring up/validation</span><span> </span></li>\n<li><span>Experience integrating logic onto SoC platforms and designing high-throughput PS/PL interfaces</span><span> </span></li>\n<li><span>Experience developing firmware for Xilinx FPGA platforms using the Xilinx toolchain</span></li>\n<li>Experience with high speed serial links, including GbE, PCI-E or similar</li>\n<li>Experience with networking protocols and packet processing (Ethernet 802.3, IPV4/IPV4, UDP, TCP)</li>\n<li>Experience developing and testing high reliability, safety critical, and fault tolerant systems</li>\n<li>Hardware debug experience, including familiarity with tools such as the oscilloscope, logic analyzer, protocol analyzer (SPI, CAN, Ethernet or similar)</li>\n<li>Experience developing software for embedded systems in C or C++, or significant experience in another software language</li>\n<li>Scripting skills (bash, Perl, Python)</li>\n<li>Familiar with common electronic components and comfortable reading circuit design schematics and contributing to hardware design discussions</li>\n<li>Excellent leadership, communication and teamwork skills<span> </span></li>\n</ul>\n\n<p><strong><span>ADDITIONAL REQUIREMENTS:</span></strong><span> </span></p>\n\n<ul>\n<li><span>Must be available to work extended hours and weekends as needed to meet critical deadlines </span><span> </span></li>\n</ul>\n\n<p><strong>COMPENSATION AND BENEFITS: </strong></p>\n\n<div>Pay Range:</div>\n\n<div>FPGA Engineer /Level I: $120,000.00 - $145,000.00/per year</div>\n\n<div>FPGA Engineer /Level II: $140,000.00 - $170,000.00/per year</div>\n\n<p>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.</p>\n\n<p>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short &amp; long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation &amp; will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year.</p>\n\n<div><p><strong>ITAR REQUIREMENTS:</strong></p>\n<ul>\n<li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C. § 1157, or (iv) Asylee under 8 U.S.C. § 1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR <a href=\"https://www.pmddtc.state.gov/?id=ddtc_kb_article_page&amp;sys_id=24d528fddbfc930044f9ff621f961987\">here</a>.  </li>\n</ul>\n<p>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.</p>\n<p>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should notify the Human Resources Department at (310) 363-6000.</p></div>",
            "name": "FPGA Engineer (Starshield)",
            "type": "external",
            "publication_date": "2024-02-07T23:06:33Z",
            "short_name": "fpga-engineer-starshield-90e377",
            "model_type": "jobs",
            "id": 13949050,
            "locations": [
                {
                    "name": "El Segundo, CA"
                }
            ],
            "categories": [
                {
                    "name": "Software Engineering"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/spacex/fpga-engineer-starshield-90e377"
            },
            "company": {
                "id": 15000190,
                "short_name": "spacex",
                "name": "SpaceX"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$0.00 - $0.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Store Associate",
            "type": "external",
            "publication_date": "2024-03-17T12:50:29Z",
            "short_name": "store-associate-aa1b71",
            "model_type": "jobs",
            "id": 12347657,
            "locations": [
                {
                    "name": "Van Nuys, CA"
                }
            ],
            "categories": [
                {
                    "name": "Retail"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-aa1b71"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br> o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br> o Actively look for ways to help people, and do so in a friendly manner<br> o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br> o Use and understand verbal and written communication to interact with customers and colleagues<br> o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br> o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br> o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br> o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br> o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Pharmacy Technician",
            "type": "external",
            "publication_date": "2024-03-17T12:50:31Z",
            "short_name": "pharmacy-technician-322688",
            "model_type": "jobs",
            "id": 12303054,
            "locations": [
                {
                    "name": "Lake Orion, MI"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-322688"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>",
            "name": "Pharmacy Technician",
            "type": "external",
            "publication_date": "2024-03-17T12:50:29Z",
            "short_name": "pharmacy-technician-ffa911",
            "model_type": "jobs",
            "id": 12373144,
            "locations": [
                {
                    "name": "Columbia, SC"
                }
            ],
            "categories": [
                {
                    "name": "Healthcare"
                }
            ],
            "levels": [
                {
                    "name": "Senior Level",
                    "short_name": "senior"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-ffa911"
            },
            "company": {
                "id": 12096,
                "short_name": "cvshealth",
                "name": "CVS Health"
            }
        },
        {
            "contents": "<p>Siemens Healthineers is a leading global medical technology company with over 170 years of experience and 18,000 patents. More than 48,000 dedicated colleagues in over 70 countries are driven to shape the future of healthcare. We stand with our customers around the world to support them in delivering high quality care to their patients. An estimated 5 million patients across the globe benefit every day from our innovative technologies and services in the areas of diagnostic and therapeutic imaging, laboratory diagnostics and molecular medicine, as well as digital health and enterprise services. This is what truly matters to us.<br><br>Join our team now at Siemens Healthineers as <strong>Product Manager, Radiography</strong><br><br>This is a role well suited to an ambitious professional, looking for the next step in their career. As a <strong>Product Manager</strong>, you will be responsible for:<br><br><ul><li>You will Define product segmentation (internal &amp; external), marketing requirements and sales strategies for the US Market </li><li>You will manage an on-going assessment of customer needs and create marketing collateral and/or sales programs to support</li><li>You will create, implement &amp; drive U.S product introductions and phase-out strategies</li><li>You will analyze competitive offerings, wins/loss data and develop sales strategies and tactics to enable differentiation in the US market </li><li>You will regularly develop and communicate attributes of business segmentation that differentiate and distinguish our organization and solutions </li><li>You will develop supporting marketing collaterals, case studies, customer testimonials and presentations to help drive and support necessary business</li><li>You will be the national ambassador for Siemens Healthineers radiographic portfolio in the United States and develop ongoing strategies to grow market share</li></ul><br>This position may suit you best if you are familiar with what is below, and would like to do develop your career with Healthineers<br><br><ul><li>You have knowledge of the organization and how to effectively motivate and push in the right direction.</li><li>You work effectively as a team, motivating colleagues and team members to produce the best</li><li>You demonstrate analytical skills for market intelligence management and targeted execution of measures.</li><li>You possess high level of critical thinking in bringing successful resolution to high-impact, complex, and/or cross functional problems. </li></ul><br>Required skills to have for the success of this role<br><br><ul><li>You have very good presentation skills in the customer environment, and you show team orientation, communication skills and customer orientation.</li><li>You work effectively as a team, motivating colleagues and team members to produce the best results.</li><li>You have excellent PC skills (MS Office software like Word, PowerPoint, Excel and Outlook)</li><li>Willingness to travel and flexibility, is expected.</li></ul><br>At Siemens Healthineers, we value those who dedicate their energy and passion to a greater cause. Our people make us unique as an employer in the med-tech industry. What unites and motivates our global team is the inspiration of our common purpose:  To innovate for healthcare, building on our remarkable legacy of pioneering ideas that translate into even better healthcare products and services. We recognize that taking ownership of our work allows both us and the company to grow. We offer you a flexible and dynamic environment and the space to move beyond your comfort zone to grow both personally and professionally.<br><br>If you want to join us in transforming the way healthcare is delivered, visit our career site at https://usa.healthcare.siemens.com/careers<br><br>If you wish to find out more about the specific before applying, please visit: https://usa.healthcare.siemens.com/about<br><br>As an equal-opportunity employer we are happy to consider applications from individuals with disabilities.<br><br>*LI-WC1<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Medical Solutions USA, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>",
            "name": "Product Manager, Radiography",
            "type": "external",
            "publication_date": "2023-04-29T23:35:09Z",
            "short_name": "product-manager-radiography-5a219a",
            "model_type": "jobs",
            "id": 11276468,
            "locations": [
                {
                    "name": "Malvern, PA"
                }
            ],
            "categories": [
                {
                    "name": "Product Management"
                }
            ],
            "levels": [
                {
                    "name": "Mid Level",
                    "short_name": "mid"
                }
            ],
            "tags": [],
            "refs": {
                "landing_page": "https://www.themuse.com/jobs/siemens/product-manager-radiography-5a219a"
            },
            "company": {
                "id": 11913,
                "short_name": "siemens",
                "name": "Siemens"
            }
        }
    ],
    "aggregations": {}
}