{"page": 7, "page_count": 15774, "items_per_page": 20, "took": 21, "timed_out": false, "total": 315477, "results": [{"contents": "<p>From digitalization to electrificationand automation, Siemens is changing the world you live in and the places youwork. Being part of our company lets you solve complex challenges, every day.Our people help to move the world forward. We are 311,000 innovators creating anew vision for the next generation.<br><br><strong>Position Overview:</strong><br><br>Siemens identified Metal fabrication asa strategic market with significant growth potential. Our Machine Tool Systems Segmentis searching for an Metal Fabrication Industry Business Developer for the USmarket. The main task is to identify and pursue opportunities with MachineBuilders who produce Plasma- / Laser cutting- / Wood working-/ Stone cuttingmachines utilizing CNC control capabilities for their machines. The goal isestablishing Siemens as a major player in this growing market and drivingpreference for Siemens CNC controls. <br><br>Reporting to the Business DevelopmentManager within the Siemens Machine Tool Business, we are looking for a highlymotivated, successful, future focused individual with diverse background in Metalfabrication, CNC machine tools, CNC control systems (hardware &amp; software)and Automation technology. <br><br>The ideal candidate has a strongtechnical background in above mentioned industries, is a true team player, hasexcellent communication skills, will be a curious, self-driven individual opento new ways of conducting business in a rapidly changing business environment.The long-term success of Siemens originates from hard work as a team across amatrix organization, passion for Siemens' advanced technology offerings anddeeply caring for our customers success. <br><br>This position has great exposure to ourmanagement in the US and to our headquarters in Europe, and thus providesexcellent opportunities for talents with career aspirations within Siemens domesticallyand globally. <br><br>Siemens has fully adopted to the newway of working. This position will provide a great balance of working remotelyand occasionally spending time in some of the Siemens' offices. Travel isestimated at 50%-60%. <br><br><strong>Responsibilities:</strong><br><br><ul><li>Define the Siemens Go-To Market strategy for theUS; then adjust as markets change.</li><li>Develop strategic account plans to ensureachievement of set business goals.</li><li>Promote Siemens technology to the targetedindustry. </li><li>Work together with the Siemens AccountManagement team in the US, and customers directly to identify opportunities.</li><li>Assist targeted machine tool builders throughoutthe project implementation.</li><li>Utilize synergies with other Business Developersin the team to maximize the share of wallet for Siemens.</li><li>Provide feedback to Product Management regardingtechnology requirements to help shape our future product portfolio.</li><li>Team up with other Siemens departments to ensurethe highest level of support for the customers.</li><li>Report business status to Siemens US Managementand Siemens headquarters</li></ul><br><strong>Required Knowledge, Skills, Education,and Experience:</strong><br><br><ul> <li>5+ years' experience gained     knowledge of metal fabrication machine systems and processes (e.g.     laser/plasma cutting, laser welding, tube bending/cutting, sheet metal     bending/punching)</li> <li>Strong technical background metal     fabrication control systems</li> <li>At least 2 years of business     development experience in Industrial Manufacturing, with track record of     successes and performance</li> <li>Strong network in US machine     building industry and metal fabrication community</li> <li>Great communication-, stakeholder     and relationship management skills</li> <li>Working in a matrix team     environment</li> <li>Entrepreneurial thinking and     follow through in developing new opportunities</li> <li>High level of self-driven decision-making     abilities guided by set business targets</li> <li>Technical / business degree or     equivalent experience</li> <li>Core Industrial automation     experience, especially motion control</li> <li>Individual must possess a valid     driver's license in good standing </li> <li>Travel: 50%-60% </li></ul><br><strong>Preferred Knowledge,Skills, Education, and Experience:</strong><br><br><ul> <li>3+ years' experience with key technologies leveraged by     metal fabrication machine systems (e.g. nesting, shopfloor programming,     motion control)</li></ul><ul><li>Strong network in US machine building industry</li><li>Direct experience running machines in metalfabrication shop</li><li>Executive Level Engagement</li></ul><ul> <li>Complex system selling / value selling </li></ul><br><strong>What you willreceive:</strong><br><br>•         Long-term career options!<br><br>•         Competitive base salary with incentivebonus plan based on a set of KPI's<br><br>•         New way of working: working remotelywhere applicable widely accepted across Siemens globally<br><br>•         Medical/Prescription/Dental/Vision/LifeInsurance<br><br>•         401K Retirement Savings Plan with 6%match<br><br>•         Short &amp; long-term disabilityinsurance<br><br>•         Six weeks paid parental leave forparents<br><br>•         Flexible paid time-off policy<br><br>#DI<br><br>#LI-VM1<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Business Developer - Metal Fabrication Industry", "type": "external", "publication_date": "2023-04-06T23:49:23Z", "short_name": "business-developer-metal-fabrication-industry", "model_type": "jobs", "id": 11139729, "locations": [{"name": "Chicago, IL"}], "categories": [{"name": "Sales"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/business-developer-metal-fabrication-industry"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 06/30/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "pharmacy technician", "type": "external", "publication_date": "2024-03-17T12:22:26Z", "short_name": "pharmacy-technician-3f2538", "model_type": "jobs", "id": 14302051, "locations": [{"name": "Exton, PA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-3f2538"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.69 - $19.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 05/26/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:27:41Z", "short_name": "store-associate-117d3f", "model_type": "jobs", "id": 14148301, "locations": [{"name": "Danbury, CT"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-117d3f"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:22:27Z", "short_name": "pharmacy-technician-e4a8d6", "model_type": "jobs", "id": 14186818, "locations": [{"name": "Round Rock, TX"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-e4a8d6"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $19.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:50:30Z", "short_name": "store-associate-246c00", "model_type": "jobs", "id": 12342718, "locations": [{"name": "Garden City, NY"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-246c00"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $17.25<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:50:30Z", "short_name": "store-associate-6e484a", "model_type": "jobs", "id": 12327605, "locations": [{"name": "Austin, TX"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-6e484a"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>You've invested a lot of time and energy in your education. Now you want the chance to make your mark. We offer challenging opportunities for you to learn and grow professionally. In our programs, you'll be immersed in a culture of continuous improvement, with the goal of changing health care for the better.<br><br><b>Position Summary:</b><br><br>As a Graduate Intern, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to learning how to support the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for learning how to support the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Quality Assurance</li><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management</li></ul>A key component of the Graduate Intern role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:<ul><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li></ul><b>Required Qualifications:</b><ul><li>Active Pharmacy Intern License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (e.g., APhA)</li><li>No pending felony charges or convictions for criminal offenses involving controlled substances</li></ul><b>Education:</b><br><br>Current enrollment in a School of Pharmacy in the 4th year, who will be graduating with a Pharm. D. degree in 2024<br><br>Whether in our pharmacies or through our health service offerings, we are pioneering a bold new approach to total health care. As health care innovators, we are making quality care affordable, accessible, simple and seamless. We await your fresh ideas, new perspectives, and the unique contributions you will make to our organization.</p>", "name": "Pharmacy Intern - Grad", "type": "external", "publication_date": "2024-03-17T12:45:19Z", "short_name": "pharmacy-intern-grad-6458b3", "model_type": "jobs", "id": 13188386, "locations": [{"name": "Sterling, VA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Internship", "short_name": "internship"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-intern-grad-6458b3"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions. As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management<br><br>A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li><b>Required Qualifications</b><br>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Free of pending felony charges or convictions for criminal offenses involving controlled substances</li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60.00 - $73.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Dist Suppt Pharmacist PT", "type": "external", "publication_date": "2024-03-17T12:39:35Z", "short_name": "dist-suppt-pharmacist-pt-655ad9", "model_type": "jobs", "id": 13668394, "locations": [{"name": "Doral, FL"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/dist-suppt-pharmacist-pt-655ad9"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>If you want to advance your career as a tester, or test automation specialist, you found the right job  We're looking for graduates who want to start their career in software development as testers, for junior testers, for enthusiasts in coding who want to grow.<br><br>As we're starting a new team, we're looking also for more experienced people, up to level of test architect, so if you want to apply and didn't find our other job posts, apply here<br><br>At Siemens Healthineers we develop a software for healthcare. Such software needs quality and the quality needs you and your passion for quality work, personal expertise and career growth. Join us today and if you want to refer your colleagues or friends, you have a unique opportunity to have a say with whom you would work<br><br><strong>Desired skills:</strong><br><br>• Basic Java, but wants to advance<br><br>• Basic experience with Selenium<br><br>• General understanding of HTML, CSS, DOM, JSON, XML, JS<br><br>• Ideally experience with Azure DevOps<br><br>• Experience with these or similar tools: IntelliJ, Gradle, PowerShell<br><br>• Good communication skills<br><br><strong>Language skills:</strong><br><br>• English - Upper intermediate (B2)<br><br><strong>We offer</strong><br><br>• Personal development plan, personal career plan, learning materials and platforms access<br><br>• Work-life balance and well-being focus<br><br>• Variable and Christmas bonus<br><br>• Hybrid type of work - combination of telework and work from office<br><br>• Flexible Working Hours<br><br>• Bridge days - free extra paid leave 6 days per year<br><br>• 3 sick days per year (no doctor's permit needed)<br><br>• In case of sickness 100% salary reimbursement 20 days/ year, this includes max. 10 days/ year for of family care<br><br>• Additional pension plan<br><br>• 300 EUR for regeneration of work force via cafeteria system<br><br>• Wellbeing program - Psychological, Legal and Financial Counselling<br><br>• Family care program (subsidy for newborns, maternity leave, kindergartens, summer camps)<br><br>• Retention program (work anniversary, life anniversary, employee loans)<br><br>• Training and development program (business and product trainings, e-learning, language courses, soft skills trainings...)<br><br>• Adjustable standing desk as a standard<br><br>• Participation on world famous IT conferences like Microsoft IGNITE for best employees<br><br>• Wide project portfolio in healthcare domain and job rotation within company (Cybersecurity, Artificial ---Intelligence, Healthcare IT services, ...)<br><br><strong>More about us</strong>: https://www.siemens-healthineers.com/sk/development-center <br><br><strong>More about me</strong>: https://www.linkedin.com/in/marekvisnovsky/ https://www.instagram.com/marek_visnovsky/<br><br><strong>Basic wagecomponent (gross) and other rewards</strong> :starting from 1600EUR brutto /month + VAR<em><br><br></em>We arerequired by law to disclose basic wage component (minimum salary) for theadvertised positions. We carefully consider your professional qualificationsand experience in our compensation package and/or when offering you otherpositions.<br><br>Our goal is topay our employee's fairly, with regard to the market situation and we are readyto welcome high-quality candidates in our team.<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Healthcare s.r.o.<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Junior Tester with Java", "type": "external", "publication_date": "2022-12-09T23:34:28Z", "short_name": "junior-tester-with-java", "model_type": "jobs", "id": 10548822, "locations": [{"name": "Žilina, Slovakia"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Entry Level", "short_name": "entry"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/junior-tester-with-java"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>Gemeinsam machen wir den Unterschied</strong><br><br><strong>Siemens Mobility</strong> ist ein eigenständig geführtes Unternehmen der Siemens AG und seit über 160 Jahren ein führender Anbieter im Bereich Mobilität. Zu unserem Kerngeschäft gehören Schienenfahrzeuge, Bahnautomatisierungs- und Elektrifizierungslösungen, schlüsselfertige Systeme sowie die dazugehörigen Serviceleistungen. Wir waren schon immer sehr innovativ, um Reisen schneller, sicherer und komfortabler zu machen. Heute brauchen wir neue Lösungen für neue Herausforderungen wie den Klimawandel und weltweit steigende Bevölkerungszahlen. Das ist es, was uns antreibt. Deshalb gestalten wir Mobilität mit Leidenschaft und sind immer einen Schritt voraus. Durch Digitalisierung machen wir Infrastrukturen intelligent und schaffen Möglichkeiten, die uns nachhaltig und nahtlos von A nach B bringen. Unsere 38.200 Mitarbeiter sind Pioniere im Mobilitätswesen, die dabei helfen, die Welt in Bewegung zu halten.<br><br><strong>Was tragen Sie bei?</strong><br><br><ul><li>In dieser Position unterstützen Sie bei der Betreuung der Mobility Railigent Applikationen und Services (Siemens interne und Partner-Applikationen) in der Rolle des IT Service Managers.</li><li>Dabei erstellen Sie Service Konzepte (inkl. Service Level Agreement, Operation Level Agreement und Support Modelle) für die Railigent Services mit.</li><li>Sie unterstützen bei der Erstellung von Service Angeboten und Rahmenverträgen mit Kunden und Partnern im Bereich Railigent.</li><li>Sie sind zuständig für das Kundenkommunikationsmanagement und Eskalationsmanagement im Bereich Railigent.</li><li>Außerdem begleiten Sie die Produktivierung neuer Railigent Applikationen sowie die Übergabe an das OPS-Team.</li><li>Die Durchführung von Service KPI-Monitoring und -Reporting gehört zu Ihren weiteren Aufgaben.</li><li>Sie unterstützen bei der Erstellung von Requirements und beim Application Lifecycle Management im Bereich Railigent.</li><li>Die Unterstützung bei der Erstellung von Projekt-Aufwandsschätzungen und Railigent OPS Service Kosten rundet Ihre Aufgaben ab.</li></ul><br><strong>Was bringen Sie mit?</strong><br><br><ul><li>Sie verfügen über ein abgeschlossenes Studium im Bereich Informationstechnologie oder eines vergleichbaren Studiengangs.</li><li>Mehrjährige Berufserfahrung im Bereich IT Service Management können Sie vorweisen.</li><li>Sie besitzen außerdem Erfahrung mit ITIL v4 und ITIL Best Practices.</li><li>Sie haben bereits mit Scrum, SAFe oder anderen agilen Methoden Erfahrung gesammelt.</li><li>Kenntnisse im Bereich Nearshoring und Offshoring sind wünschenswert.</li><li>Zudem sollten Sie über Erfahrungen im Bereich Cloud Services und Infrastrukturen verfügen.</li><li>Sie haben ein sicheres Auftreten und sind bereit für eine Änderung und Weiterentwicklung.</li><li>Sie besitzen große Motivation bei der Mitwirkung und Mitgestaltung.</li><li>Darüber hinaus bringen Sie sehr gute Englisch- und Deutschkenntnisse mit.</li></ul><br><strong>Was bieten wir Ihnen?</strong><br><br>Inklusion &amp; Vielfalt<br><br>Bei Siemens Mobility setzen wir uns gegen Ungerechtigkeit und Ungleichheit ein. Bei uns finden Sie ein Umfeld vor, in dem Sie Sie selbst sein können und dazugehören.<br><br>Purpose<br><br>Wir sind Pioniere der Mobilität. Bei uns tragen Sie in einem Zukunftsmarkt aktiv zu Verkehrswende und Klimaschutz bei, weil unsere Transportlösungen in aller Welt den CO2-Ausstoß verringern.<br><br>Weiterentwicklung<br><br>Wir bieten Ihnen umfassende Weiterbildungsmöglichkeiten für Ihre berufliche und persönliche Weiterentwicklung. Mit unserem Learning Campus verfügen wir über einen Inhouse-Dienstleister mit einem vielfältigen On- und Offline-Angebot.<br><br>Eine Übersicht über unsere Benefits finden Sie hier.<br><br><strong>Wie treten Sie mit uns in Kontakt?</strong><br><br><strong>www.siemens.de/mobility</strong><br>wenn Sie vor Ihrer Bewerbung mehr über Siemens erfahren möchten.<br><strong>+49 (9131) 17 52430</strong><br>wenn Sie erste Fragen gern persönlich mit unserem Recruiting Team klären möchten. Ansprechpartner für diese Stellenausschreibung ist Veronika Windmaier.<br><strong>www.siemens.com/mobility-jobs</strong><br>wenn Sie mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchten.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br><b>Organization:</b> Siemens Mobility<br><br><b>Company:</b> Siemens Mobility GmbH<br><br><b>Experience Level:</b> Mid-level Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "IT Service Manager (w/m/d) Cloud Services", "type": "external", "publication_date": "2023-05-25T23:39:12Z", "short_name": "it-service-manager-wmd-cloud-services-781266", "model_type": "jobs", "id": 11434751, "locations": [{"name": "Erlangen, Germany"}], "categories": [{"name": "Computer and IT"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/it-service-manager-wmd-cloud-services-781266"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>Wir suchen nach Menschen, die mit uns die Digitalisierung von Morgen gestalten. Denn - Wir machen digital.</strong><br><br>Wir sind Siemens Digital Industries Software. Wir sind kein Industrieunternehmen. Wir sind ein wachsendes Softwareunternehmen, das unseren Kunden schon heute die Technologien und Innovationen von morgen bietet. Mit den Chancen eines Großunternehmens sind Deine Möglichkeiten endlos. Die Stelle, auf die Du Dich heute bewirbst, ist nur der erste Schritt auf Deinem Weg bei Siemens.<br><br><strong>Du bist ein Organisationstalent und möchtest gemeinsam mit unseren Sales und PreSales Experten Digitalisierungsinitiativen für definierte Industrien in den Markt tragen?</strong><br><br>Dann werde jetzt Teil unseres Teams als <strong>Werkstudent<em>in - Business Development </strong>und gestalte die Welt von morgen mit.<br><br>Durch unser hybrides Arbeitsmodell kannst Du flexibel von zu Hause, unterwegs oder an einem unserer Standorte innerhalb Deutschlands arbeiten, bevorzugt in Hamburg, München oder Stuttgart.<br><br>Siemens Digital Industries Software ist die Software-Säule innerhalb der Siemens AG. Wir begeistern, unterstützen und beraten unsere Kunden in allen Fragestellungen rund um das Thema Industrie-Software. Auf Grundlage unserer Software-Lösungen erarbeiten wir für unsere Kunden Potentiale, um Geschäftsprozesse und Geschäftsmodelle, neu zu definieren.<br><br><strong>Welche Rolle wirst Du spielen?</strong><br><br>Deine Aufgabe als Werkstudent</em> im Vertriebs-Bereich Siemens, Strategic &amp; Emerging Industries besteht in der Unterstützung unserer Experten bei der Konzeption von Aktivitäten (z.B. Veranstaltungen oder Social Media Auftritten) und deren Durchführung, die darauf abzielen, unsere Softwarelösungen in der Industrie nachhaltig zu verankern.<br><br>Darüber hinaus trägst Du mit Aufbereitung bestehender PreSales Materialien, wie Lösungspräsentationen oder Demos, zur Qualität und Arbeitseffizienz aller Kolleg<em>innen bei.<br><br>Bei diesen Aufgaben arbeitest Du sehr eng mit unseren PreSales Experten zusammen, um die digitale Transformation unserer Kunden, v.a. in der Produktentwicklung, gestalten zu können. Dabei erhältst Du auch einen guten Einblick in den technischen Vertrieb von Softwareprodukten.<br><br>In der täglichen Zusammenarbeit nutzen wir moderne Kollaborationswerkzeuge, wie z.B. MS Teams, MS Office, LinkedIn, Yammer, etc.<br><br><ul><li>Du unterstützt bei der Erarbeitung von internen und externen Veranstaltungen</li><li>Du gestaltest Social Media Aktivitäten eigenständig (z.B. Schreiben von LinkedIn Posts)</li><li>Du wirkst bei der Ausarbeitung von Value-Propostion gemeinsam mit Sales &amp; Presales mit</li><li>Du unterstützt uns bei der Ausarbeitung und Durchführung von Webinaren für unsere Kunden</li></ul><br><strong>Wie wirst Du Teil unseres Teams? Mit viel Leidenschaft und Mut!</strong><br><br><ul><li>Du studierst im Bacherlor oder Master? Beides ist super und Deine Studienrichtung ist zweitranging</li><li>Du bist proaktiv in der Kommunikation und in deinem Handeln und bringst gerne neue Ideen ein</li><li>Du bringst erste Erfahrungen in einem unserer Industriebereichen, Transportation, Aerospace &amp; Defence, HighTech &amp; Medical Devices und Consumer Packaged Goods, Energy &amp; Utilities mit.</li><li>Du besitzt sehr gute Kommunikationsfähigkeiten in Deutsch und Englisch in Wort und Schrift</li><li>Microsoft Office, insbesondere Powerpoint sind Dir bestens bekannt</li></ul><br>Wir suchen Menschen mit Leidenschaft. Menschen, die sich und andere begeistern. Menschen, die Dinge angehen. Menschen die sich mit Freude und Neugier in Neues und Unbekanntes einarbeiten. Vor allem aber ein</em>e Teamplayer<em>in die/der engagiert und mit offenen Augen durch die Welt geht.<br><br>Wir bieten ein internationales Umfeld mit mehr als 140.000 Kunden in aller Welt, die heute schon auf unsere Kompetenz in der Digitalisierung setzen. Dabei bringen sich in Deutschland über 2.000 Kolleg</em>innen in spannende und abwechslungsreiche Kundenprojekte aus den Bereichen Luft- und Raumfahrt, Automobil- und Transportbranche, Konsumprodukte und Einzelhandel, Elektronik und Halbleiter, Energie- und Versorgungsindustrie, Industriemaschinen und Schwermaschinen, Maritime Industrie, sowie Medizinprodukte und Arzneimittel ein.<br><br>Bei uns findest Du ein teamorientiertes Arbeitsumfeld, umfassende Weiterbildungsoptionen in Form von diversen Schulungen oder LinkedIn Trainings sowie attraktiven Benefits. Des Weiteren bist Du herzlich eingeladen an internen Events teilzunehmen, z.B. dem \"Sporty Wednesday\" und darüber hinaus unsere Vernetzungsmöglichkeiten zu nutzen!<br><br><strong>Bist Du ein<em>e Ideengestalter</em>in? Dann werde jetzt Teil unseres Teams!</strong><br><br>Wenn Du erste Fragen mit unserem Recruiting Team klären möchtest, wende Dich gerne per Mail an: careers-DACH.sisw@siemens.com<br><br>Ansprechperson dieser Stellenausschreibung ist Frau Alessandra Heppting.<br><br>Du möchtest vor Deiner Bewerbung mehr über Siemens Digital Industries Software erfahren? <strong>Mission / Vision und unser Software Portfolio</strong> - oder besuche unsere <strong>Homepage</strong>.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über <strong>Bewerbungen von Menschen mit Behinderung</strong>.<br><br><strong>#DISW</strong><br><br><strong>#LI-PLM</strong><br><br><strong>#LI-AH1</strong><br><br><strong>#LI-Hybrid</strong><br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry Software GmbH<br><br><b>Experience Level:</b> Student (Not Yet Graduated)<br><br><b>Full / Part time:</b> Part-time</p>", "name": "Werkstudent*in - Business Development", "type": "external", "publication_date": "2023-04-14T23:42:19Z", "short_name": "werkstudentin-business-development-b51232", "model_type": "jobs", "id": 11135373, "locations": [{"name": "Hamburg, Germany"}], "categories": [{"name": "Sales"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/werkstudentin-business-development-b51232"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<div><p><span><strong>Who we are</strong></span></p>\n<p><span>Samsara (NYSE: IOT) is the pioneer of the Connected Operations™ Cloud, which is a platform that enables organizations that depend on physical operations to harness Internet of Things (IoT) data to develop actionable insights and improve their operations. At Samsara, we are helping improve the safety, efficiency and sustainability of the physical operations that power our global economy. Representing more than 40% of global GDP, these industries are the infrastructure of our planet, including agriculture, construction, field services, transportation, and manufacturing — and we are excited to help digitally transform their operations at scale.</span></p>\n<p><span>Working at Samsara means you’ll help define the future of physical operations and be on a team that’s shaping an exciting array of product solutions, including Video-Based Safety, Vehicle Telematics, Apps and Driver Workflows, Equipment Monitoring, and Site Visibility. As part of a recently public company, you’ll have the autonomy and support to make an impact as we build for the long term. </span></p>\n<p><span><strong>Recent awards we’ve won include:</strong></span></p>\n<p>Glassdoor's Best Places to Work 2024</p>\n<p>Best Places to Work by Built In 2024</p>\n<p>Great Place To Work Certified™ 2023</p>\n<p>Fast Company's Best Workplaces for Innovators 2023</p>\n<p>Financial Times The Americas’ Fastest Growing Companies 2023</p>\n<p><span>We see a profound opportunity for data to improve the safety, efficiency, and sustainability of operations, and hope you consider joining us on this exciting journey. </span></p></div>\n\n<p><strong>About the role:</strong></p>\n\n<p>As a Sales Engineer at Samsara, you’d be an integral part of a diverse team working to help modernize essential industries through the application of cutting-edge IoT solutions. Your work would directly contribute to a cleaner, more efficient, and more productive supply chain by creating safer roadways, reducing fuel consumption and emissions, and providing a consolidated platform for connecting operations. Our daily customer engagements include conversations around how IoT can positively impact logistics management, workplace safety programs, fleet maintenance strategies, global asset management, and regulatory compliance. This means a successful SE at Samsara will develop a thorough understanding of the application of IoT hardware and sensors, hands-on hardware installation strategies, managing data collection over carrier networks, presenting a robust cloud infrastructure, and building third-party system integrations (via our open API) to ensure the best technical solution is presented to Samsara customers.</p>\n\n<p><strong>You should apply if: </strong></p>\n\n<ul>\n<li><strong>You want to impact the industries that run our world: </strong>Your efforts will result in real-world impact—helping to keep the lights on, get food into grocery stores, and most importantly, ensure workers return home safely.</li>\n<li><strong>You have an innate curiosity about how businesses work: </strong>One day you’ll meet with someone in waste management and the next you may be learning about the inner workings of a food distribution center. Our top sales team members seek to learn the ins and outs of the businesses they support in order to make a larger impact. </li>\n<li><strong>You build genuine relationships with your customers:</strong> The industries we serve have relied on pen-and-paper solutions for years and haven’t been met with the type of technology we offer. Our customer's value earned trust and human relationships built over time.</li>\n<li><strong>You want to be with the best:</strong> Samsara’s high-performance culture means you’ll be surrounded by the best and challenged to go farther than you have before. </li>\n<li><strong>You are a team player:</strong> At Samsara, sales is a team sport. We help each other out by sharing best practices and focusing on winning as a team.</li>\n</ul>\n\n<p><a href=\"https://www.samsara.com/blog/what-we-value-at-samsara/\"><em>Click here</em></a><em> to learn about what we value at Samsara. </em></p>\n\n<h4><strong>In this role, you will:</strong><span> </span></h4>\n\n<ul>\n<li>Become an expert on Samsara products: where the rubber of cutting-edge tech (IoT, AI, computer vision) meets the road of driving digital transformation for physical operations.</li>\n<li>Articulate to prospects how businesses like theirs use Samsara today to solve obstacles common to their industry.</li>\n<li>Deliver the work products that get deals done.  Think discoveries, demonstrations, value assessments, proof of concept implementations, etc.</li>\n<li>Walk installers through any scenario, explaining best practices for installing Samsara products and helping build deployment plans.</li>\n<li>Write sample proof-of-concept scripts against our open API that solve real-world problems for companies that deliver essential services (for example), and document them for your fellow SE’s to use.</li>\n<li>Open the door for deeper entrenchment into accounts (integration, upsell, cross-sell) by becoming a consultant to your customers.</li>\n<li>Act as a liaison between Samsara’s product and sales teams, translating technical feedback and enrolling the right customers in our beta programs.</li>\n<li>Champion, role model, and embed Samsara’s cultural principles (Focus on Customer Success, Build for the Long Term, Adopt a Growth Mindset, Be Inclusive, Win as a Team) as we scale globally and across new offices.</li>\n</ul>\n\n<p><strong>Minimum requirements for the role:</strong></p>\n\n<ul>\n<li>BS in Electrical Engineering, Computer Science, Mechanical Engineering, Industrial Engineering, or a related discipline.</li>\n<li>3+ years experience working with customers in a pre-sales, customer success, or customer/product support capacity.</li>\n<li>Possess the attitude and aptitude for continuous growth and development.</li>\n<li>Ability to influence stakeholders based on your technical sales acumen and a solid understanding of business processes and change management.</li>\n<li>Ability to explain complex technical concepts to non-technical audiences.</li>\n<li>Previous experience managing hardware and/or software product evaluations.</li>\n<li>Basic understanding of electronics and electrical systems.</li>\n<li>Experience with the following concepts: technical consulting, cloud software, cloud-connected hardware, computer networking, business systems integration, automation and control systems.</li>\n<li>Must be available to travel 55%-60% percent</li>\n</ul>\n\n<p><strong>An ideal candidate also has:</strong></p>\n\n<ul>\n<li>5+ years of enterprise public sector field experience working with customers in a pre-sales environment.</li>\n<li>Understanding of vehicle diagnostic systems, including Controller Area Networks (CAN bus) and Power Take Off (PTO) applications.</li>\n<li>Skilled in the art of identifying customer value - identifying on delivering what is most important to the customer and tuning out the noise.</li>\n<li>Hobbyist interest in working with things driven by electronic systems (car audio installation/classic car restoration, home automation, building things with Raspberry Pi, Arduino, etc.).</li>\n<li>Consistent track record of success selling complex technical solutions through strategic sales cycles.</li>\n<li>Work experience in task automation scripting and transferring data between systems using Bash, Python, JavaScript, or equivalent language.</li>\n<li>Work experience building solutions leveraging open APIs.</li>\n</ul>\n\n<p><strong></strong></p>\n\n<div><div><div><p><span><span><strong>Samsara’s Compensation Philosophy:</strong> </span></span>Samsara’s compensation program is designed to deliver Total Direct Compensation (based on role, level, and geography) that is at or above market. We do this through our base salary + bonus/variable + restricted stock unit awards (RSUs) for eligible roles.  For eligible roles, a new hire RSU award may be awarded at the time of hire, and additional RSU refresh grants may be awarded annually. </p>\n<p>We pay for performance, and top performers in eligible roles may receive above-market equity refresh awards which allow employees to achieve higher market positioning.</p></div><div>The range of annual on-target earnings (OTE) range for full-time employees for this position is below. Please note that OTE pay may vary depending on factors including your city of residence, job-related knowledge, skills, and experience.</div><div><span>$190,315</span><span>—</span><span>$223,900 USD</span></div></div></div>\n\n<div><p>At Samsara, we welcome everyone regardless of their background. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, gender, gender identity, sexual orientation, protected veteran status, disability, age, and other characteristics protected by law. We depend on the unique approaches of our team members to help us solve complex problems. We are committed to increasing diversity across our team and ensuring that Samsara is a place where people from all backgrounds can make an impact.</p>\n<p><strong>Benefits</strong></p>\n<p>Full time employees receive a competitive total compensation package along with employee-led remote and flexible working, health benefits, Samsara for Good charity fund, and much, much more. Take a look at our <a href=\"https://www.samsara.com/company/careers/benefits\">Benefits</a> site to learn more.</p>\n<p><strong>Accommodations </strong></p>\n<p>Samsara is an inclusive work environment, and we are committed to ensuring equal opportunity in employment for qualified persons with disabilities. Please email <a href=\"mailto:accessibleinterviewing@samsara.com\">accessibleinterviewing@samsara.com</a> or <a href=\"https://form.asana.com/?k=dcecpJYeVpOJt1RCCU7Hdg&amp;d=182866037607514\"><strong>click here</strong></a><strong> </strong>if you require any reasonable accommodations throughout the recruiting process.</p>\n<p><strong>Flexible Working </strong></p>\n<p><span>At Samsara, we have </span><a href=\"https://www.samsara.com/blog/the-future-of-work-at-samsara/\"><span>adopted a flexible way of working</span></a><span>, enabling teams and individuals to do their best work, regardless of where they’re based. We value in-person collaboration and know a change of scenery and quiet space to work is welcomed from time to time, but also appreciate that the world of work has changed. Our offices remain open for those who prefer to collaborate or work in-office, but we also encourage fully remote applicants. </span><span>As most roles are not required to be in the office, we are able to hire remotely where Samsara has an established presence. If a role is required to be in a certain location and candidates do not have work authorization for that location, Samsara will conduct an immigration assessment. If the role is not required to be in a specific location, Samsara will move forward with the remote location that works best for the business. All offers of employment are contingent upon an individual’s ability to secure and maintain the legal right to work at the company. </span></p>\n<p><strong>Fraudulent Employment Offers</strong></p>\n<p>Samsara is aware of scams involving fake job interviews and offers. Please know we do not charge fees to applicants at any stage of the hiring process. Official communication about your application will only come from emails ending in ‘@samsara.com’ or ‘@us-greenhouse-mail.io’. For more information regarding fraudulent employment offers, please visit our <a href=\"https://samsara.com/blog/avoiding-fake-job-offers\">blog post here</a>.</p></div>", "name": "Public Sector Enterprise Sales Engineer ", "type": "external", "publication_date": "2024-03-14T23:06:54Z", "short_name": "public-sector-enterprise-sales-engineer-f400c0", "model_type": "jobs", "id": 14007825, "locations": [{"name": "Flexible / Remote"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/samsarainc/public-sector-enterprise-sales-engineer-f400c0"}, "company": {"id": 15000209, "short_name": "samsarainc", "name": "Samsara Inc."}}, {"contents": "<div><p>SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars.</p></div>\n\n<p><strong>GNC ENGINEER (STARSHIP)</strong></p>\n\n<p>As a GNC Engineer, you will be responsible for pushing the technical boundaries of flight control systems for the world’s most advanced rockets, including our next-generation Starship vehicle, a fully reusable spacecraft capable of carrying humans to Mars and beyond. You will work with a talented team of accomplished engineers to develop, analyze, and test vehicles and subsystems for highly reliable flight. You should thrive in fast-paced, dynamic environments where you adapt quickly and love to solve hard problems.</p>\n\n<p><strong>RESPONSIBILITIES:</strong></p>\n\n<ul>\n<li>Develop innovative guidance, navigation, and control systems for Starship</li>\n<li>Engage in multi-disciplinary vehicle systems investigations and design work that define the systems architecture</li>\n<li>Implement new software or algorithms to enable mission unique capabilities and leading edge launch vehicle performance</li>\n<li>Develop 6-DOF dynamics simulation models used for GNC systems analysis and validation</li>\n<li>Analyze launch vehicle trajectories, performance dispersions, and flight stability</li>\n<li>Conduct post flight data review and correlation with analyses for continued improvement of predictions</li>\n<li>Support launch and mission operations of vehicles that you enabled</li>\n<li>Perform testing of GNC software utilizing hardware-in-the-loop testing, Monte Carlo analysis, and algorithm unit testing</li>\n</ul>\n\n<p><strong>BASIC QUALIFICATIONS:</strong></p>\n\n<ul>\n<li>Bachelor's degree in physics or an engineering discipline</li>\n<li>Experience with control systems, orbital mechanics, classical dynamics, modeling, and simulation</li>\n<li>Experience with the software languages Python or C++</li>\n</ul>\n\n<p><strong>PREFERRED SKILLS AND EXPERIENCE:</strong></p>\n\n<ul>\n<li>Postgraduate degree in physics or an engineering discipline</li>\n<li>2+ years of professional experience in control systems, orbital mechanics, classical dynamics, aerodynamics, sensors and actuators, modeling and simulation, and the software languages C++ and Python</li>\n<li>Demonstrated project or professional experience in launch vehicle and/or spacecraft system</li>\n<li>Capable of solving complex problems with little to no supervision on schedule as an individual or as a member of an integrated team</li>\n<li>Passion for advancing the commercial space industry and human spaceflight</li>\n<li>Excellent communication skills both written and verbal</li>\n</ul>\n\n<p><strong>COMPENSATION AND BENEFITS:</strong></p>\n\n<p>Pay Range:<br>GNC Engineer/Level I: $120,000.00 - $145,000.00/per year<br>GNC Engineer/Level II: $140,000.00 - $170,000.00/per year</p>\n\n<p>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.</p>\n\n<p>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short &amp; long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation &amp; will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year. </p>\n\n<p> </p>\n\n<div><p><strong>ITAR REQUIREMENTS:</strong></p>\n<ul>\n<li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C. § 1157, or (iv) Asylee under 8 U.S.C. § 1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR <a href=\"https://www.pmddtc.state.gov/?id=ddtc_kb_article_page&amp;sys_id=24d528fddbfc930044f9ff621f961987\">here</a>.  </li>\n</ul>\n<p>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.</p>\n<p>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should notify the Human Resources Department at (310) 363-6000.</p></div>", "name": "GNC Engineer (Starship)", "type": "external", "publication_date": "2024-03-06T23:05:21Z", "short_name": "gnc-engineer-starship-bfbea5", "model_type": "jobs", "id": 14305063, "locations": [{"name": "Brownsville, TX"}], "categories": [], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/spacex/gnc-engineer-starship-bfbea5"}, "company": {"id": 15000190, "short_name": "spacex", "name": "SpaceX"}}, {"contents": "<p>We are seeking a professional SAP CS SD Techno Functional Expert with a proven track record of leading internal complex medium to large-scale projects in the healthcare services area. Knowledge and experience with customer services business processes &amp; Agile, ITIL V3.0 framework is important to drive multiple projects as part of project portfolio.<br><br>The role of SAP CS SD Techno Functional Expert is to plan, execute, and finalize projects according to scope, deadline and budget, as well as manage ongoing IT operations activities by following ITIL Based ITSM Processes. This includes directing resources in a matrixed organization and coordinating the efforts of team members to deliver projects according to plan. The expert individual will also define the project's objectives, participate in projects planning and oversee quality control throughout its life cycle.<br><br><strong>Responsibilities</strong><br><br><ul><li>Define project scope, goals and deliverables that support the business goals and requirements in collaboration with colleagues, senior management, and stakeholders from Customer Services team.</li><li>Facilitate Gap analysis and Business process mapping \"As Is\" vs \"To Be\" workshops with IT and Business Partners.</li><li>Help visualize big picture of End-to-End Service setup to provide technical design for project that requires strong technical knowledge of ERP SAP CS / SD module &amp; field services mobile solutions and other web-based solutions.</li><li>Own regional technical design specification following template governance model is created/reviewed and implemented in country rollout based on Global template model - SAP customer service design.</li><li>Proactively manage changes in project scope to maximize success and minimize risk to stakeholders and the company.</li><li>Meet with stakeholders to take detailed objectives and clarify specific requirements for the agreed scope of the project(s).</li><li>Develop complete project plans and/or contribute into Global Project plan</li><li>Liaise with project stakeholders on an ongoing basis.</li><li>Develop and deliver progress reports, proposals, requirements documentation, and presentations.</li><li>Identify and manage project dependencies and critical path to ensure timely delivery.</li><li>Report and escalate to IT management as needed.</li><li>Ability to work well under pressure and time driven management expectations</li><li>self-motivation , competitive, results-driven attitude , passion, dedication and focused individual </li><li>time-management skills and the ability to prioritize your workload</li><li>confident presentation skills &amp; ability to pay attention to detail</li></ul><br><strong>Requirements</strong><br><br><ul><li>10+ years of Techno Functional experience in Customer Services area preferably in SAP SD and/or SAP CS modules. Hands-on expertise in SAP SD and/or CS modules required.</li><li>Should have Multiple Years and Multiple Projects/Clients experience in configuration of SD and CS Module including Integration with Finance/Controlling, Material Management modules.</li><li>Should have experience with at least 2-3 large scale SAP migration or consolidation</li><li>Should have strong experience in functional design and technical design specification in area of user exits, Pricing requirements, RFCs, RRB, Revenue Recognition, Maintenance Service Contract etc.</li><li>Communicate with the business SMEs to understand the Customer Service processes and able to provide IT solutions.</li><li>Communicate with App developers and SAP development team on various issues, changes, and projects.  Strong knowledge for the interfaces from/to SAP applications to CRM, Mobile applications etc.</li><li>Participate in Release Management and Projects and write technical requirement specification documents to provide to UI App developers and SAP backend team.</li><li>Experience of managing small to medium scale projects/Changes in different technologies like SAP, ServiceNow, Mobile technologies</li><li>Documentation of Work specifications, co-ordinate and able to work with other IT departments for various projects or in resolving tickets/ issues.</li><li>Technical solution (Dev op,  SolMan), expertise is required</li><li>10% travel is required</li></ul><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Medical Solutions USA, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "SAP CS SD Techno Functional Expert", "type": "external", "publication_date": "2023-03-24T23:48:00Z", "short_name": "sap-cs-sd-techno-functional-expert-7ce90a", "model_type": "jobs", "id": 11082643, "locations": [{"name": "Cary, NC"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/sap-cs-sd-techno-functional-expert-7ce90a"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><b>Job Description:</b><br><br>Working at Bank of America believes in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grown and make an impact, along with the power to make a difference. Join us!<br><br>Bank of America Merrill Lynch Specialized Industries Banking Group is seeking a Commercial Associate for the For Profit Healthcare Group.  The FPHC Group is a specialized team within the Global Commercial Bank which serves public and private healthcare companies, generally with annual revenues of $50 million to $2 billion. The FPHC Group focuses on the middle market healthcare industry including traditional banking, capital raising and advisory services.  The For Profit Healthcare Group maintains a leadership position within the industry, manages numerous syndicated and capital markets-agented transactions, and maintains a close working relationship with Global Corporate &amp; Investment Banking.<br><br>The position offers a steep learning curve, is focused on enhancing business development skills and proficiency in the financial services / products which support our Healthcare Clients' objectives, and affords the opportunity to work with many product and enterprise partners throughout the organization.<br><br>Primary responsibilities of the Commercial Associate (CA) are focused on working with Relationship Managers and their client teams to help deliver the financial services/products and consultative advice that Bank of America delivers to our For Profit Healthcare clients. The CA role is a developmental role for future client-facing associates, specifically Relationship Managers. Position may be hired as a Commercial Associate I, II, or III dependent upon experience. This position can be located in Boston or New York.<br><br>This job is responsible for delivering analytical research and developing innovative strategies to support client/prospects' needs. Key responsibilities include working closely with various banking partners to help create client/prospect presentations and providing support throughout the course of the transaction. Job expectations include leveraging data to help tell stories, uncovering valuable insights such as economic updates, markets forecasts, new business reports, and industry valuations to inform important business decisions.<br><br><b>Responsibilities</b><br><br>Supports the analysis of market and industry data to uncover insights for client/prospect meetings, pitch books, and relationship reviews. Collaborates with Market Executives, Relationship Managers, and various team members across the bank to help prepare client presentations and support client deals. Observes and/or supports the credit approval process to gain knowledge of credit products and help provide clients with exposure to the bank's credit products. Observes and/or supports the treasury solutions packaging process to gain exposure to treasury products/services and their related approval processes. Supports the coordination of clients/prospects and partners from product and deal teams throughout the course of a transaction. Supports the delivery of new business analytics and monitors client activities as directed to aid with identifying/expanding relationships and maintaining and/or enhancing business opportunities.<br><br><b>Skills</b> Financial Analysis Financial Modeling Prospecting Business Development Relationship Building Referral Identification Critical Thinking Problem Solving Risk Management Market Analysis Data and Trend Analysis Data Visualization Continuous Improvement Client Management Project Management<br><br><b>Requirements</b><b>:</b><br><br><ul><li>Bachelor's Degree in Accounting, Finance, or related area</li><li>Completion of Commercial Credit Training Program</li><li>Minimum 3 - 5 years of previous business experience</li><li>Demonstrates initiative / self-motivation</li><li>Possesses strong interpersonal skills</li><li>Possesses strong analytical and modeling skills</li><li>Possesses understanding of corporate financial statements</li><li>Demonstrates strong critical thinking</li><li>Demonstrates the ability to independently make decisions</li><li>Knowledge and proficiency of internal/external programs such as Navigator, GUS, Cape, Pitch book, Fact set, Salesforce, etc</li></ul><br><b>Desired:</b><br><br><ul><li>Desire to work in Specialized Industries with an interest in the Healthcare Industry</li></ul><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>", "name": "Commercial Associate - For Profit Healthcare Group", "type": "external", "publication_date": "2024-02-09T23:31:46Z", "short_name": "commercial-associate-for-profit-healthcare-group-b857b0", "model_type": "jobs", "id": 13909941, "locations": [{"name": "Boston, MA"}, {"name": "New York, NY"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/bankofamerica/commercial-associate-for-profit-healthcare-group-b857b0"}, "company": {"id": 12145, "short_name": "bankofamerica", "name": "Bank of America"}}, {"contents": "<p><b>Job Description:</b><br><br>Merrill Wealth Management is a leading provider of comprehensive wealth management and investment products and services for individuals, companies, and institutions. Merrill Wealth Management is one of the largest businesses of its kind in the world specializing in goals-based wealth management, including planning for retirement, education, legacy, and other life goals through investment advice and guidance.<br><br>Merrill's Financial Advisors and Wealth Management Client Associates help clients pursue the life they envision through a personal relationship with their advisory team committed to their needs. We believe trust comes from transparency. Our trusted advisory teams are equipped with access to the investment insights of Merrill coupled with the banking convenience of Bank of America.<br><br>At Merrill, we empower you to bring your whole self to work. We value diversity in our thoughts, business, and within our employees and clients. Our Wealth Management team represents an array of different backgrounds and bring their unique perspectives, ideas, and experiences, helping to create a work community that is culture driven, resilient, results focused and effective<br><br><b>Position Overview:</b><br><br>The <b>Wealth Management Client Associate</b> role is a sales support position, typically providing dedicated operational and sales support to multiple Financial Advisors (FA). Incumbents may also on a regular basis, support office initiatives, in addition to the businesses of a particular Financial Advisor. For established clients, the CA will often serve as the most frequent point of contact with Merrill Wealth Management.<br><br><b>Specific responsibilities include, but are not limited to:</b><br><br><ul><li>Work with highly affluent clients </li><li>Lead end-to-end onboarding and maintenance activities for new and existing clients.</li><li>Provide products and services to each client, working with cross line of business partners</li><li>Use creativity to tackle complex problems; Manage client servicing requests and account maintenance; Use multiple communication methods to ensure a consistent and exceptional client service experience.</li><li>Act as a key team member leading our clients' digital experience with the firm</li><li>Create ease of access and interaction, while protecting their privacy and security </li><li>Find opportunities to innovate every day</li></ul><br><b>Key Qualifications for the role:</b><br><br><ul><li>2+ years post high school education and/or 4+ years of professional or relevant internship experience; Undergraduate degree a plus</li><li>Product Knowledge: Foundational knowledge of investment and banking products </li></ul><ul><li>Energetic individual that is self-motivated, coachable, and flexible in thought</li><li>Enjoys a fast-paced environment with changing and evolving responsibility</li><li>Detail oriented</li><li>Invested in personal development</li><li>Consistently pursues client experience excellence</li><li>Works quickly to fulfill client needs delivering complex solutions</li><li>Frequent communication, and an abundance of discretion with sensitive information</li><li>Microsoft Word, Excel, and PowerPoint experience with Salesforce a plus</li><li>Professional verbal and written communication</li></ul><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>37.5</p>", "name": "Wealth Management Client Associate", "type": "external", "publication_date": "2024-03-15T23:30:22Z", "short_name": "wealth-management-client-associate-bc89ac", "model_type": "jobs", "id": 14397361, "locations": [{"name": "Canton, OH"}], "categories": [{"name": "Management"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/bankofamerica/wealth-management-client-associate-bc89ac"}, "company": {"id": 12145, "short_name": "bankofamerica", "name": "Bank of America"}}, {"contents": "<p><strong>Wir suchen nach Menschen, die mit uns die Digitalisierung von Morgen gestalten. Denn - Wir machen digital.<br><br></strong>Wir sind Siemens Digital Industries Software. Wir sind kein Industrieunternehmen. Wir sind ein wachsendes Softwareunternehmen, das unseren Kund<em>innen schon heute die Technologien und Innovationen von morgen bietet. Mit den Chancen eines Großunternehmens sind Deine Möglichkeiten endlos. Die Stelle, auf die Du Dich heute bewirbst, ist nur der erste Schritt auf Deinem Weg zu Siemens.<br><br>Werde jetzt Teil unseres Teams als <strong>Solution Architect (w/m/d) </strong><strong>- OEM / Trucks &amp; Busses</strong> und gestalte die Welt von morgen mit!<br><br>Durch unser hybrides Arbeitsmodell kannst Du flexibel von zu Hause, unterwegs oder an einem unserer über 20 Standorte innerhalb Deutschlands arbeiten. Wir unterstützen Deine Mobilität mit einem Dienstwagen oder einer BahnCard 100.<br><br><strong>Wie gestaltest Du die Welt von morgen? Herausfordernd und zukunftsorientiert!</strong><br><br>Die Digitalisierung stellt viele Unternehmen vor große Herausforderungen und wird die Prozesse in den kommenden Jahren immens verändern, die Schlagworte sind in aller Munde (z.B. Closed Loop Manufacturing, Product Lifecycle Management oder Totally Integrated Automation, Digitaler Zwilling, Industrie 4.0). Auch unsere Kund</em>innen müssen sich, mit unserer Hilfe, diesen Aufgaben stellen, nicht zuletzt steht dabei deren Wettbewerbsfähigkeit auf dem Prüfstand.<br><br>Als PLM Solution Architect mit Fokus auf OEM Prozesse wirst Du diese Reise wesentlich mitgestalten und die Anforderungen unserer Kund<em>innen in Digitalisierungslösungen mit dem Siemens Xcelerator Software Portfolio verwandeln.<br><br>Wir suchen einen PLM-Profi, der</em>die diese Aufgabe annimmt und mit seinem großen Erfahrungsschatz und Enthusiasmus unseren Kund<em>innen bei der Transformation zum digitalen Unternehmen zur Seite steht.<br><br><ul><li>Als Solution Architect bringst Du die Anforderungen unserer Kund</em>innen und die im PreSales erarbeiteten Lösungsansätze zusammen. Du definierst konkrete Architekturen auf Basis der Bedürfnisse der Kund<em>innen, natürlich immer vor dem Hintergrund einer optimalen wirtschaftlichen Umsetzbarkeit</li><li>Fokus der Arbeit liegt auf dem Design, der Konzeption und Umsetzung von innovativen Lösungskonzepten rund um die Prozesse der Kund</em>innen.</li><li>Du arbeitest an Consulting- und Digitalisierungsprojekten und führst dabei Implementation und Technical Consultants in interdisziplinären Teams als Lead Architect.</li><li>Als \"Trusted Advisor\" führst Du die Kund<em>innen auch in schwierigen Situation und bist für die Umsetzung der technischen Lösungen verantwortlich</li><li>Die Zusammenarbeit mit dem Produktmanagement und der Entwicklung ist ein weiteres entscheidendes Element für den Erfolg unserer Arbeit.</li><li>Unterstützung des Presales/Engagement Team während der technischen Auswahl- oder Angebotsphasen eines Projekts</li><li>Du verantwortest die zielsichere Integration der Architekturen in die Gesamtsysteme unter Berücksichtigung bestehender IT-Systemlandschaften</li><li>Als technische/r Expert</em>in arbeitest Du aktiv an der Dokumentation und Weiterentwicklung von Best-Practices und dem weiteren Ausbau unserer Wissensdatenbank</li><li>Dein zukünftiges, kollegiales Umfeld zeichnet sich durch ein offenes und partnerschaftliches Miteinander aus, wobei das Team im Vordergrund steht</li></ul><br><strong>Wie wirst Du Teil unseres Teams? Mit viel Leidenschaft und Mut!</strong><br><br><ul><li>Abgeschlossenes Studium der Informatik, Fahrzeugtechnik, allg. Maschinenbau, Produktions- oder Fertigungstechnik o.ä.</li><li>Du hast mehrjährige Erfahrung in der Beratung und Konzepterstellung für PLM Prozesse</li><li>Du besitzt Prozesswissen aus der Automotive-Industrie im Umfeld der Produktentwicklung, Fertigung und Service</li><li>Du hast gute Kenntnisse über das Siemens PLM Produktportfolio</li><li>Du kennst die Vorteile der PLM Philosophie und verstehen die Rolle unserer Produkte</li><li>Grundkenntnisse in mindestens einem führenden CAD System, ERP Prozesse, MES/MOM, PLM übergreifende Prozesse</li><li>Du bist in der Lage den Kunden auf dem Weg zur Verwirklichung seiner individuellen PLM Bedürfnisse zu führen</li><li>Komplexe oder schwierige Situationen mit Kund<em>innen meisterst Du mit Routine, Weitblick und kühlem Verstand</li><li>Beratungs- und Führungskompetenz sowie hervorragende Kommunikationsfähigkeiten auch auf Management Ebene</li><li>Wir kommunizieren sowohl mit unseren Kund</em>innen als auch mit unseren nationalen und internationalen Geschäftspartner<em>innen auf Deutsch und auf Englisch.</li><li>Unser Team arbeitet deutschlandweit. Wir können daher sowohl mit einer Homeoffice-Option entgegenkommen als auch mit einer attraktiven Dienstwagenregelung</li></ul><br>Wir bieten ein internationales Umfeld mit mehr als 140.000 Kund</em>innen in aller Welt, die heute schon auf unsere Kompetenz in der Digitalisierung setzen. Dabei bringen sich in Deutschland über 2.000 Kolleg<em>innen in spannende und abwechslungsreiche Kundenprojekte aus den Bereichen Luft- und Raumfahrt, Automobil- und Transportbranche, Konsumprodukte und Einzelhandel, Elektronik und Halbleiter, Energie- und Versorgungsindustrie, Industriemaschinen und Schwermaschinen, Maritime Industrie, sowie Medizinprodukte und Arzneimittel ein. Bei uns findest Du ein teamorientiertes Arbeitsumfeld, umfassende Weiterbildungsoptionen und attraktive Benefits. Durch individuelle Zielvereinbarungen und vielfältige Karrieremodelle mit Spezialisierungsoptionen bieten wir Dir die Möglichkeit, fachlich und persönlich zu wachsen.<br><br><strong>Bist Du ein</em>e Ideengestalter*in? Dann werde jetzt Teil unseres Teams!</strong><br><br>Wenn Du erste Fragen mit unserem Recruiting Team klären möchtest, wende Dich gerne per Mail an: careers-DACH.sisw@siemens.com<br><br>Ansprechperson dieser Stellenausschreibung ist Herr Marc Lerch.<br><br>Du möchtest vor Deiner Bewerbung mehr über Siemens Digital Industries Software erfahren? <strong>Mission / Vision und unser Software Portfolio</strong> - oder besuche unsere <strong>Homepage</strong>.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über <strong>Bewerbungen von Menschen mit Behinderung</strong>.<br><br><strong><br><br>#DISW</strong><br><br><strong>#LI-PLM</strong><br><br><strong>#LI-ML6</strong><br><br><strong>#LI-Hybrid</strong><br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry Software GmbH<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Solution Architect (w/m/d) - OEM / Trucks & Busses", "type": "external", "publication_date": "2023-01-19T02:58:02Z", "short_name": "solution-architect-wmd-oem-trucks-busses-8a4dc9", "model_type": "jobs", "id": 10634855, "locations": [{"name": "Frankfurt, Germany"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/solution-architect-wmd-oem-trucks-busses-8a4dc9"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "pharmacy technician", "type": "external", "publication_date": "2024-03-17T12:47:57Z", "short_name": "pharmacy-technician-a2f3c2", "model_type": "jobs", "id": 12979725, "locations": [{"name": "Jupiter, FL"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-a2f3c2"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Do you want to join usin helping to fight the world's most threatening diseases and enabling accessto care for more people around the world? At Siemens Healthineers, we pioneerbreakthroughs in healthcare.  For everyone. Everywhere.</strong><br><br><strong>We offer you a flexibleand dynamic environment with opportunities to go beyond your comfort zone inorder to grow personally and professionally. Sound interesting?</strong><br><br><strong>Our global team: We area team of 66,000 highly dedicated employees across more than 70 countriespassionately pushing the boundaries of what's possible in healthcare to helpimprove people's lives around the world. As a leader in the industry, we aspireto create better outcomes and experiences for patients no matter where theylive or what health issues they are facing. Our portfolio, spanning fromin-vitro and in-vivo diagnostics to image-guided therapy and innovative cancercare, is crucial for clinical decision-making and treatment pathways.</strong><br><br><strong>Our culture: We are partof an incredible community of scientists, clinicians, developers, researchers,professionals, and skilled specialists pushing the boundaries of what'spossible, to improve people's lives around the world.  We embrace aculture of inclusivity in which the power and potential of every individual canbe unleashed. We spark ideas that lead to positive impact and continuedsuccess. Check our Careers Site at </strong><strong>https://www.siemens-healthineers.com/en-us/careers</strong><strong>. </strong><br><br><strong>What you'll do</strong>: Siemens Healthineers <strong>Velocity SalesAssociate (VSA) will work in partnership with field Account Executives (AEs) tocreate qualified leads that convert to pipeline and provide sales support tothe AE throughout the sales cycles. The VSA will develop pipeline throughoutbound prospecting and following up on sales leads targeted at non-hospitalcustomers </strong>(e.g., ambulatory surgery centers and imaging centers).Candidates will start their career on the team and will haveopportunities to learn and advance their career through mentorship and exposureto all aspects of the Siemens Healthineers business. <strong>The position willbe based in the Upstate New York Area, </strong>remote applicants within the area mayalso apply.<br><br><strong>Who you'll work with:</strong><br><br><ul> <li>Work directly with Regional Vice President of Sales and     existing field Account Executives (AEs) in the region</li> <li>Have frequent interaction with the Siemens Healthineers     Networked Care strategy team</li></ul><br><strong>Responsibilities:</strong><br><br><ul><li><strong>Produce Sales Qualified Leads (SQL) that convert to pipeline by conducting out-bound prospecting </strong>(cold-calls, email, social) and following-up on Marketing Qualified Leads (MQLs) of <strong>Ambulatory Surgery Centers and Imaging Centers</strong></li><li><strong>Qualify customers and prospects</strong> to meet SQL criteria</li><li>Consult with customers to<strong> identify theirneeds and pain points </strong>to identify product opportunities</li><li>Effectively use<strong> CRM system and othertools </strong>to plan calls to potential customers within region, record allactivities, and schedule appropriate follow-up tasks</li><li><strong>Hand-off warm Sales Qualified Leads</strong>(SQLs) to field AEs</li><li>Meet daily, monthly, and quarterly<strong> KPImetrics </strong>and<strong> assist AEs in meeting sales quota</strong></li><li><strong>Stay informed and educated</strong> with Siemens Healthineers product and service information updates</li><li><strong>Foster strong internal relationships </strong>to support fast and effective value-delivery tocustomers</li><li><strong>Support AEs through the sales process </strong>with activities such as conducting clientresearch, compiling product communication material, leveraging internal SiemensHealthineers network to bring in relevant product support networks, completingmiscellaneous customer requests, etc.</li><li><strong>Track insights on customer needs </strong>and communicate regularly with field AEs</li><li>Look for<strong> customer trends</strong> in theregion and <strong>proactively contribute to territory planning</strong> /coverage with AE's</li><li>Perform <strong>well-organized prospectingstrategies and weekly calls with all AE counterparts</strong> to discuss priorweek's activities and determine current week's strategy</li></ul><br><strong>What we are looking for:</strong><br><br><ul><li>Bachelor's Degree preferred, or equivalentcombination of education, training, &amp; experience</li><li>Professional sales skills (written and oralskills) and a desire to further advance your sales skillset</li><li>Excellent communication skills; able to buildrelationships with key decision makers</li><li>Strong organizational skills and proactivityfollowing-up on leads</li><li>Resilient attitude, coachability anddemonstrated consistency in performance</li><li>Experience in the medical technology space</li><li>Able to determine customer's values / needs andrecommend Siemens Healthineers solutions &amp; services</li><li>Excellent presentation, planning, andorganizational skills</li><li>Able to work in a team environment,performance-based culture</li><li>Advanced skills with Microsoft Office Suite:Word, Excel, Outlook, and PowerPoint</li><li>Able to leverage CRM to manage accounts;experience using CRM tools such as Oracle Sales Cloud or equivalent is a plus</li><li>Advanced skills with Microsoft Office Suite:Word, Excel, Outlook, and PowerPoint</li></ul><br><strong>Bonus characteristics:</strong><br><br><ul><li>Experience working in fast-paced salesenvironment, focused on top-of-funnel lead generation</li><li>Prior Medtech sales experience</li><li>Proven experience with conductinginbound/outbound phone calls</li></ul><br>At Siemens Healthineers,we value those who dedicate their energy and passion to a greater cause. Ourpeople make us unique as an employer in the med-tech industry. What unites andmotivates our global team is the inspiration of our commonpurpose:  To innovate for healthcare, building on our remarkablelegacy of pioneering ideas that translate into even better healthcare productsand services. We recognize that taking ownership of our work allows both us andthe company to grow. We offer you a flexible and dynamic environment and thespace to move beyond your comfort zone to grow both personally andprofessionally.<br><br><strong>This job is based inthe New York/New Jersey Region.  The base pay range for this position is  Min$60,000- Max $70,000 plus a Targeted Annual Variable Pay of $65,000.  Thepay wage range shown is based on the job posting's primary location. Actual compensationpackages are based on a wide array of factors, including but not limited toskill set, experience, certifications, and location.</strong><br><br><strong>If you want to join usin transforming the way healthcare is delivered, visit our career site at </strong>https://usa.healthcare.siemens.com/careers<strong>.</strong><br><br>If you wish to find outmore about the specific before applying, please visit: https://usa.healthcare.siemens.com/about.<br><br>As an equal-opportunity employer we are happy toconsider applications from individuals with disabilities.<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Medical Solutions USA, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Velocity Sales Associate - Upstate New York", "type": "external", "publication_date": "2023-05-09T23:39:27Z", "short_name": "velocity-sales-associate-upstate-new-york-5c7732", "model_type": "jobs", "id": 10970868, "locations": [{"name": "Buffalo, NY"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/velocity-sales-associate-upstate-new-york-5c7732"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>About us:</strong><br><br>We'reSiemens. Award winning; Ranked on Fortune 500; Digital Engineering globalleader. A collection of over 300,000 excellent minds who are all making thefuture. This position is within the Simcenter Presales group, part of ourDigital Industries Software Business Unit.<br><br><strong>Position overview:</strong><br><br>As anApplication Engineer Modeling &amp; Simulation you will act as the technicallead in demonstrating and promoting our Simcenter Simulation Solutions(primarily Simcenter Prescan) to our customers in a diverse range of industries,with primary focus on sophisticated driver assistance systems (ADAS) andautonomous vehicles (AV).<br><br>Thisexciting opportunity promoting innovative simulation solutions whilemaintaining a high level of technical knowledge offers a diverse range of skilldevelopment, from understanding the first principles of ADAS and AV Systems, todeveloping customer focused presentations, demonstrations, proof of conceptsand account leadership skills in support of our larger sales strategies.<br><br>Inthis position you will collaborate with the presales manager of ourfast-growing Simcenter Simulation and Test Solutions and be part of a largeteam of technical specialists, application and support engineers within theSiemens Digital Industries Software organization.<br><br><strong>Responsibilities:</strong><br><br><ul> <li>Work alongside the sales team     to apply technical skills in the Simcenter Prescan portfolio, using a     combination of application and domain expertise </li> <li>Develops proof of concept     models, provide demonstrations, and drives benchmarks using the Siemens     Simcenter Simulation and Test Solutions portfolio</li> <li>Collaborates with the product     development roadmap by evaluating current product functionality,     identifying customer needs, analyzing competitive products, analyzing and     relaying customer requirements to the Siemens Simcenter product     development team </li> <li>Train and mentor client     technical leads and domain authorities in the application of primarily     Simcenter Prescan</li> <li>Conduct technical discussions     with customers to collect and understand simulation requirements, propose     solutions, and explain benefits of our Simcenter portfolio</li> <li>Join a community of highly     skilled individuals maintaining professional and technical knowledge to     stay at the forefront of innovation.</li></ul><br><strong>Required Knowledge/Skills, Education, and Experience:</strong><br><br><ul> <li>Master of Science in     Automotive, Aerospace, Mechanical Engineering or other engineering team.     Bachelor of Science with several years of shown experience will also be     considered</li> <li>Knowledge and experience using     CAE simulation software</li> <li>Strong interpersonal skills,     communication skills and problem solving capabilities. Ability to work as     an individual contributor and as a team member</li> <li>Ability to travel up to 25%</li></ul><br>QualifiedApplicants must be legally authorized for employment in the United States.Qualified Applicants will not require employer sponsored work authorization nowor in the future for employment in the United .<br><br><strong>Preferred Knowledge/Skills, Education, and Experience:</strong><br><br><ul> <li>Experience using World, Sensor     and Vehicle Modeling tools: Simcenter Prescan, Matlab/Simulink, Simcenter     Amesim, Simcenter Heeds, Polarion, IPG Carmaker, Applied Intuition, Carla,     SUMO, dSpace Aurelion, Carsim/Trucksim,</li> <li>Proficiency with C/C++ and/or     Python</li> <li>Understanding of the properties     and technologies of the sensors used in automated and autonomous systems     (Camera/Lidar/Radar/Ultrasonic/dGPS/V2X)</li> <li>Knowledge of the ADAS/AD system     design process, including the validation and verification (V&amp;V)     process, including SIL/MIL/HIL</li> <li>Experience with 3D design tools     (CAD / Blender / OBS Studio)</li> <li>Experience in student projects     such as SAE Formula Student, EcoCAR Mobility Challenge, GM AutoDrive     Challenge, Indy Autonomous Challenge</li> <li>Industry domain experience in     one of the following areas: Automotive / Ground Vehicle, Aerospace /     Defense, Industrial Machinery</li></ul><br>Thetotal cash compensation range for this position is <strong>$76,300</strong> to <strong>$152,600</strong>with <strong>10%</strong> of this being comprised of an annual incentive target. Theactual compensation offered is based on the successful candidate's worklocation as well as additional factors, including job-related skills,experience, and relevant education/training. Siemens offers a variety of healthand wellness benefits to employees. Details regarding our benefits can be foundhere: www.benefitsquickstart.comIn addition, this position is eligible for time off in accordance with Companypolicies, including paid sick leave paid parental leave, PTO (for non-exemptemployees) or non-accrued flexible vacation (for exempt employees).<br><br>AtSiemens, we are always challenging ourselves to build a better future. We needthe most innovative and diverse Digital Minds to develop tomorrow's reality.Find out more about the Digital world of Siemens here: www.siemens.com/careers/digitalminds<br><br><strong>#swsaas</strong><br><br><strong>#LI-PLM</strong><br><br><strong>#DISW</strong><br><br><strong>#LI-REMOTE</strong><br><br><strong>#li-hm2</strong><br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry Software Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Application Engineer Modeling & Simulation", "type": "external", "publication_date": "2023-04-14T23:42:19Z", "short_name": "application-engineer-modeling-simulation-7fd648", "model_type": "jobs", "id": 11174143, "locations": [{"name": "Flexible / Remote"}, {"name": "Plano, TX"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/application-engineer-modeling-simulation-7fd648"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}], "aggregations": {}}