{"page": 6, "page_count": 15774, "items_per_page": 20, "took": 22, "timed_out": false, "total": 315477, "results": [{"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $19.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:39:33Z", "short_name": "store-associate-bdc3c7", "model_type": "jobs", "id": 13755626, "locations": [{"name": "Phoenix, AZ"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-bdc3c7"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Ve společnosti Siemens najdete naše centrum sdílených služeb pod názvem Global Business Services CZ a v rámci celého koncernu Siemens poskytujeme našim zákazníkům služby v oblasti účetnictví, financí, controllingu, nákupu, logistiky a lidských zdrojů. V Praze a Ostravě poskytujeme služby v celkem 27 jazycích a není tedy divu, že nás v České republice pracuje téměř 2000. </strong><br><br><strong>V Global Business Services (GBS) podporujeme společnosti ve všech sektorech po celém světě a utváříme prostředí sdílených služeb budoucnosti. Naše vynikající podnikové služby poskytujeme zákazníkům na míru a s přidanou hodnotou, jsme partnerem první volby.</strong><br><br><strong>Jste připraveni proměnit své ambice ve skutečnost? Přidejte se k nám teď!</strong><br><br><strong>Co bude Vaší náplní práce?</strong><br><br><ul><li>Zpracování přiděleného objemu zahraničních příchozích faktur.</li><li>Dodržování platných účetních předpisů a standardů pro danou zemi.</li><li>Efektivní komunikace se členy týmu i ostatními odděleními.</li><li>Spolupráce se zákazníkem na optimalizaci procesů.</li><li>Aktivní zapojení do implementace nových technologií.</li><li>Kontrola dat, tvorba reportů a uzávěrkové práce.</li></ul><br><strong>Co od Vás očekáváme?</strong><br><br><ul><li>Velmi dobrou znalost němčiny (slovem i písmem) - min. úroveň B2, znalost angličtiny na úrovni alespoň A2.</li><li>Středoškolské nebo vysokoškolské vzdělání, ideálně v oboru ekonomie nebo financí.</li><li>Předchozí zkušenosti v oblasti účetnictví nebo administrativy.</li><li>Analytické myšlení a zájem o procesní inovace.</li><li>Schopnost efektivně řešit nesrovnalosti v účetních dokladech.</li><li>Otevřenost ke změnám a odolnost vůči stresu.</li><li>Uživatelská znalost produktů MS Office.</li></ul><br><strong>Co Vám můžeme nabídnout?</strong><br><br><ul><li>pestrou práci v mezinárodním a multikulturním prostředí</li><li>zaškolení zkušenými kolegy</li><li>podporu osobního i kariérního růstu</li><li>pro kandidáty mimo dojezdovou vzdálenost do Ostravy nabízíme možnost 100% home office</li><li>5 týdnů dovolené (lze zakoupit až 8 dnů volna navíc z rozpočtu na benefity)</li><li>flexibilní pracovní doba s pevným jádrem od 10:00-14:00 hod.</li><li>home office s příspěvkem 100 Kč netto/den</li><li>roční bonus s možností převodu do cafeterie (nedaní se)</li><li>e-stravenky v hodnotě 130 Kč/den</li><li>MultiSport karta za zvýhodněnou cenu</li><li>roční rozpočet do cafeterie ve výši min. 24 000 Kč s libovolným využitím na stránkách benefit-plus (např. dovolená, jazykový kurz, kulturní a sportovní akce, atd.)</li><li>příspěvek na životní nebo penzijní pojištění hrazený z benefitů</li><li>firemní mateřské školky v Praze a v Ostravě</li><li>příležitost stát se akcionářem Siemens a získat akcie zdarma</li></ul><br><b>Organization:</b> Global Business Services<br><br><b>Company:</b> Siemens, s.r.o.<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Specialista pro zpracování přijatých faktur s němčinou a angličtinou - Ostrava/home office", "type": "external", "publication_date": "2023-04-26T23:40:50Z", "short_name": "specialista-pro-zpracovani-prijatych-faktur-s-nemcinou-a-anglictinou-ostravahome-office-0d3769", "model_type": "jobs", "id": 10953396, "locations": [{"name": "Olomouc, Czech Republic"}], "categories": [{"name": "Administration and Office"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/specialista-pro-zpracovani-prijatych-faktur-s-nemcinou-a-anglictinou-ostravahome-office-0d3769"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><b><strong>What you will do</strong></b><br><br>Here at Cisco Advisory, we strive to offer our clients a premium experience: combining the trusted Cisco brand with highly skilled and experienced individuals offering years of industry exposure and market understanding to provide a custom-built advisory service tailored to our clients' specific needs.<br><br>We are currently looking for <strong>2 senior Consultants </strong>who will act as technology strategists to support our clients in achieving greater business value from technology by delivering services ranging from technology strategy development to cloud migration planning, or even wholly repositioning IT for the digital era.<br><br>We assist clients in aligning the business and technology agendas as well as identifying areas where innovation can drive business value. This work includes optimising the technology budget and increasing the efficiency and effectiveness of the technology organisation through repositioning or redesigning the technology functions, and by assessing and optimising operational processes.<br><br><b><strong>You will typically</strong></b><br><br><ul><li>Work as a trusted advisor alongside senior customer stakeholders to identify the relevant market trends and discover opportunities for technology to create new business value,</li><li>Create or validate technology strategies, the supporting business cases, and define the required transformation programmes,</li><li>Create or enhance operating models catering for effective technology governance and alignment between business and technology,</li><li>Lead work to increase the efficiency and effectiveness of the technology organisation, covering processes, tools &amp; people, including the introduction of orchestration &amp; automation,</li><li>Develop technology reference architectures, service portfolios, and contribute to the associated product development,</li><li>Shape &amp; perform technology benchmarking and develop cost optimisation strategies &amp; action plans, including service &amp; application rationalisation,</li><li>Develop and evangelise cutting edge point of views on how digital technologies will transform the way business is conducted,</li><li>Act as an entrepreneur, including challenging traditional viewpoints at the client C-level,</li><li>Actively work to identify and develop new business opportunities for Cisco through advisory.</li></ul><br><b><strong>About You</strong></b><br><br><ul><li>Relevant Masters' degree with strong academic results. Candidates with a Bachelor degree, combined with extensive experience in the relevant field will also be considered. An MBA would be a plus</li><li>Over 10 years of experience from other consultancy or technology driven organisations, covering:</li><li>Exposure to multiple segments (Enterprises, Governments and Service Providers),</li><li>Experience with multiple technologies (networking, cloud, IoT, Smart Buildings/Cities),</li><li>Strong consulting toolkit and experience,</li><li>A speciality focus or interest, to further broaden the Cisco Advisory tool bag,</li><li>Excellent written, verbal, and presentation skills in the English language, with additional languages a plus,</li><li>Experience with agile delivery methodologies and IT service management (ITSM),</li><li>A desire to multitask and flexibility in terms of travel and work across EMEAR.</li></ul><br><b><strong>Why Cisco</strong></b><br><br>#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.<br><br>We embrace digital, and help our customers implement change in their digital businesses. Some may think we're \"old\" (36 years strong) and only about hardware, but we're also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do - you can't put us in a box!<br><br>But \"Digital Transformation\" is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)<br><br>Day to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.<br><br>So, you have colorful hair? Don't care. Tattoos? Show off your ink. Like polka dots? That's cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!<br><br><b><strong>#LI-Hybrid</strong> <strong>#Cisco #CiscoJobs #WeAreCisco</strong></b><br><br><strong>Message to applicants applying to work in the U.S.:</strong> <br> <br>When available, the salary range posted for this position reflects the projected hiring range for new hire, full-time salaries in U.S. locations, not including equity or benefits. For non-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.<br> <br>U.S. employees have <a href=\"https://www.cisco.com/c/en/us/about/careers/we-are-cisco/benefits-and-perks.html\">access</a> to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long-term disability coverage, basic life insurance and numerous wellbeing offerings. Employees receive up to twelve paid holidays per calendar year, which includes one floating holiday, plus a day off for their birthday. Employees accrue up to 20 days of Paid Time Off (PTO) each year and have access to paid time away to deal with critical or emergency issues without tapping into their PTO. We offer additional paid time to volunteer and give back to the community. Employees are also able to purchase company stock through our Employee Stock Purchase Program.<br> <br>Employees on sales plans earn performance-based incentive pay on top of their base salary, which is split between quota and non-quota components. For quota-based incentive pay, Cisco pays at the standard rate of 1% of incentive target for each 1% revenue attainment against the quota up to 100%. Once performance exceeds 100% quota attainment, incentive rates may increase up to five times the standard rate with no cap on incentive compensation. For non-quota-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.</p>", "name": "Customer Delivery Advisor", "type": "external", "publication_date": "2023-06-14T10:15:40Z", "short_name": "customer-delivery-advisor", "model_type": "jobs", "id": 11593949, "locations": [{"name": "Riyadh, Saudi Arabia"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/ciscomeraki/customer-delivery-advisor"}, "company": {"id": 11799, "short_name": "ciscomeraki", "name": "Cisco Meraki"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health -from advising on prescriptions to helping manage chronic and specialty conditions. As Pharmacy Manager, you have one of the most significant roles in our company - delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to leading and directing your Pharmacy Staff, comprised of both staff Pharmacists and Pharmacy Technicians, you are accountable for the management, oversight and operation of all aspects within your pharmacy. This includes:<li>Patient Safety </li><li>Pharmacy Professional Practice </li><li>Regulatory Requirements </li><li>Quality Assurance </li><li>Customer Service </li><li>Personnel Management </li><li>Inventory Management </li><li>Financial Profitability </li><li>Loss Prevention </li><li>Workflow Management A key component of the Pharmacy Manager role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will: </li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team </li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps </li><li>Identify critical business opportunities and meaningful solutions to drive growth and improve performance in your pharmacy </li><li>Successfully implement those solutions by leading your team to achieve specified goals </li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting </li><li>Seek new ways to grow, collaborate with others and deliver better outcomes </li><li>Align others around purpose to gain support and commitment </li><li>Facilitate a 'team' culture that promotes caring, energy, enthusiasm and pride </li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors </li><li>The above represents a summary of the functions of a Pharmacy Manager. Additional functions and physical requirements are available on the full job description.</li><b>Required Qualifications</b><br>Minimum Required Qualifications:<li>Active Pharmacy License in the state in which you are employed </li><li>Not on the DEA Excluded Parties List </li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Listed on the pharmacy state license as the 'pharmacist in charge' </li><li>Submission of required information/documents to your state PMP administrator to register for PMP access (in states with active PMP for pharmacist use).</li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$70.00 - $87.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "CA - Pharmacy Manager", "type": "external", "publication_date": "2024-03-17T12:27:43Z", "short_name": "ca-pharmacy-manager-aadd32", "model_type": "jobs", "id": 14103914, "locations": [{"name": "Redding, CA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/ca-pharmacy-manager-aadd32"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>At Siemens, we are always challenging ourselves to build a better future. We need the most innovative and diverse Digital Minds to develop tomorrow's reality. Find out more about the Digital world of Siemens here: [1] www.siemens.com/careers/digitalminds<br><br>Siemens EDA is part of Siemens Digital Industries Software, a Siemens Group company and world leader in the global digitalization of companies. Siemens EDA, a world leader of Electronic Design Automation (EDA), develops and markets software products and hardware solutions (emulators) covering the entire design &amp; verification flow.<br><br>Siemens EDA counts among its customers the majority of the world's Top 50 in the fields of Semiconductors, Computing, Consumer, Automotive, Telecommunications and the Defense and Space sector.<br><br>Siemens EDA R&amp;D teams, located across the globe, develop disruptive semiconductor chip design CAD software, including the Analog FastSPICE™ (AFS), the world's fastest nanometer accurate circuit verification platform. AFS is used by over 200 semiconductor companies worldwide for their toughest circuit verification challenges while designing high-speed I/Os, PLLs, ADCs/DACs, CMOS image sensors, RFICs, and embedded memory.<br><br>This position will be part of the AFS R&amp;D team, focused on circuit simulation.  As a key member of a highly proficient, productive, and motivated R&amp;D team, developing industry's leading circuit simulator, using cutting edge software development techniques, you will be offered:<br><br><ul><li>Technical challenges to solve toughest nanometer scale circuit verification problems for the leading semiconductor companies in the world. </li><li>A motivating, stimulating, and rewarding work environment </li><li>Excellent training and growth opportunities throughout your career </li><li>Attractive compensation and benefits </li><li>A motivating, stimulating, and rewarding work environment </li><li>Excellent training and growth opportunities throughout your career </li><li>Attractive compensation and benefits </li></ul><br>As a member of AFS R&amp;D team you will participate in the design and implementation of efficient algorithms using state of the art software engineering processes and development tools, with a strong emphasis on software quality; thus, adding to your industry level experience in solving tough computational complexity problems while participating in entire software development lifecycle. We are looking for a self-motivated and inspiring team player with outstanding problem-solving skills to maintain and grow the technical dominance of the AFS product.<br><br>Responsibilities:<br><br><ul><li>Develop new and compatibility features for the core circuit simulator. </li><li>Participate in the specification, architecture, design, and development of features </li><li>Enhance core circuit simulator, e.g., performance, accuracy, capacity, convergence. </li><li>Maintain and enhance compatibility with other simulators. </li><li>Profile and identify bottlenecks in performance of various analyses for very large circuits. </li><li>Improve numerical algorithms used in the core engine. </li><li>Debug difficult testcases with accuracy, performance, capacity, or functional issues. </li><li>Extend and maintain the capabilities of the AFS circuit simulator. </li><li>Be a force for improving development processes and product quality. </li><li>Work effectively with globally distributed engineering teams and the Product Validation team </li></ul><br>Education and Experience:<br><br><ul><ul><ul><li>Minimum 7 years of proven strong background in developing efficient, high-quality software for engineering applications using numerical methods and sparse matrix techniques </li><li>Deep understanding of numerical methods and sparse matrix techniques </li><li>Working knowledge of analog electrical circuit analysis </li><li>Outstanding programming skills in C and C++, preferably on Linux platform</li><li>Proficiency in memory optimization, high-performance data structures and algorithms </li><li>Advanced multithreading programming experience.</li><li>Understanding of advanced computer architectures</li><li>Solid background in object-oriented design and software engineering processes.</li><li>Self-motivated individual with excellent problem-solving skills. </li><li>Strong interpersonal and excellent oral and written communication skills. </li><li>Highly motivated to work in globally distributed engineering environment</li><li>M.S or PhD in Computer Science, Electrical Engineering, Applied Mathematics, or relevant area </li></ul></ul></ul><br><br><ul><li>Desirable:  </li><ul><li>Understanding of the internal workings of a circuit simulator </li><li>Knowledge of Verilog-A and modeling in Verilog-A. </li><li>Background in semiconductor devices and their modeling</li><li>Python programming experience </li><li>EDA industry level work experience </li></ul></ul><br><br><ul><li></li></ul><br>The salary range for this position is $118,500 to $189,600 and this role is eligible to earn incentive ,compensation. Siemens offers a variety of health and wellness benefits to employees. Details regarding our benefits can be found here: www.benefitsquickstart.com. In addition, this position is eligible for time off in accordance with Company policies, including paid sick leave, paid parental leave, PTO (for non-exempt employees) or non-accrued flexible vacation (for exempt employees).<br><br>#LI-PLM<br>#LI-KM1<br><br>#LI- Remote<br><br>#DISW<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry Software Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Software Developer- Circuit Simulation- Remote", "type": "external", "publication_date": "2023-06-02T23:43:50Z", "short_name": "software-developer-circuit-simulation-remote-0b90e0", "model_type": "jobs", "id": 8617797, "locations": [{"name": "Alexandria, VA"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/software-developer-circuit-simulation-remote-0b90e0"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>From digitalization to electrificationand automation, Siemens is changing the world you live in and the places youwork. Being part of our company lets you solve complex challenges, every day.Our people help to move the world forward. We are 311,000 innovators creating anew vision for the next generation.<br><br><strong>Position Overview:</strong><br><br>Siemens identified theDigital Transformation in the manufacturing industry as a strategic market withsignificant growth potential. Digitalization relatedto CNC Machine Tools encompasses software tools that help machine builders andmachine users reduce engineering time, increase productivity, monitor machineperformance, and optimize machine maintenance. <br><br>Our Machine Tool Systems Segment issearching for a Digitalization software Business Developer to engage withMachine Tool Builders and their distribution channels in the US market. Themain task is - working closely together with our sales team - to identify andpursue opportunities with existing customers who use already Siemens CNCcontrols, and selected builders who use other control brands. The goal is establishing Siemens as a major player in thisgrowing market and driving preference for Siemens technology. <br><br>Reporting to the Business DevelopmentManager within the Siemens Machine Tool Business, we are looking for a driven,highly motivated, successful, future focused individual with diverse backgroundin manufacturing, industrial software, CNC machine tools, CNC control systemsand Automation technology. <br><br>The ideal candidate has a strongtechnical background in software for industrial manufacturing, is a true teamplayer, has excellent communication skills, will be a curious, self-drivenindividual open to new ways of conducting business in a rapidly changingbusiness environment. The long-term success of Siemens originates from hardwork as a team across a matrix organization, passion for Siemens' advancedtechnology offerings and deeply caring for our customers success. <br><br>This position has great exposure to ourmanagement in the US and to our headquarters in Europe, and thus providesexcellent opportunities for talents with career aspirations within Siemensdomestically and globally. <br><br>Siemens has fully adopted to the newway of working. This position will provide a great balance of working remotelyand occasionally spending time in some of the Siemens' offices. Travel isestimated at 50%-60%. <br><br><strong>Responsibilities:</strong><br><br>•         Define the Siemens Go-To Market strategy for theUS; then adjust as markets change.<br><br>•         Develop strategic account plans to ensureachievement of set business goals. <br><br>•         Promote Siemens technology to the targetedindustry. <br><br>•         Work together with the Siemens AccountManagement team, and customers directly to identify opportunities. Act as keypoint of contact for Sales teams for campaign knowledge and support.<br><br>•         Closely interface with our US basedDigitalization Software team (products, order processing, technical support).<br><br>•         Assist targeted machine tool builders throughoutthe project implementation.<br><br>•         Utilize synergies with other Business Developersin the team to maximize the share of wallet for Siemens.<br><br>•         Provide feedback to Product Management regardingtechnology requirements to help shape our future product portfolio.<br><br>•         Team up with other Siemens departments to ensurethe highest level of support for the customers.<br><br>•         Report business status to Siemens US Managementand Siemens headquarters. <br><br><strong>Required Knowledge, Skills, Education,and Experience:</strong><br><br><ul> <li>5+ years' experience in the CNC     machine industry</li> <li>Strong technical background in shop     floor management software tools </li> <li>3+ years of business development experience     in Industrial Manufacturing with track record of successes and performance</li> <li>Great communication-, stakeholder     and relationship management skills</li> <li>Working in a matrix team     environment</li> <li>Entrepreneurial thinking and     follow through in developing new opportunities</li> <li>High level of self-driven decision-making     abilities guided by set business targets</li> <li>Technical / business degree or     equivalent experience</li> <li>Core Industrial automation     experience, especially motion control</li> <li>Individual must possess a valid     driver's license in good standing </li> <li>Travel: 50%-60% </li></ul><br><strong>Preferred Knowledge,Skills, Education, and Experience:</strong><br><br><ul> <li>Strong network     in US machine building industry</li>  <li>Validated expertise in developing     account business plans and strategic customer approaches.</li> <li>Executive Level Engagement</li>  <li>Complex system selling / value     selling </li></ul><br><strong>What you willreceive:</strong><br><br>•         Long-term career options!<br><br>•         Competitive base salary with incentivebonus plan based on a set of KPI's<br><br>•         New way of working: working remotelywhere applicable widely accepted across Siemens globally<br><br>•         Medical/Prescription/Dental/Vision/LifeInsurance<br><br>•         401K Retirement Savings Plan with 6%match<br><br>•         Short &amp; long-term disabilityinsurance<br><br>•         Six weeks paid parental leave forparents<br><br>•         Flexible paid time-off policy<br><br>#DI<br><br>#LI-VM1<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Business Developer - Digitalization for CNC Machine Builder", "type": "external", "publication_date": "2023-04-05T23:47:24Z", "short_name": "business-developer-digitalization-for-cnc-machine-builder-9478f5", "model_type": "jobs", "id": 11139775, "locations": [{"name": "Cadillac, MI"}], "categories": [{"name": "Sales"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/business-developer-digitalization-for-cnc-machine-builder-9478f5"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<div><span>As a Sales Development Representative, you will report to the Head of New Business in France. You will work closely with the entire Sales team, as well as the Marketing Manager in France to contribute to AB Tasty's expansion in the French (and sometimes UK) market. You will be required to work within a team to help define the commercial strategy targeting our prospects.</span></div>\n\n<div><br></div>\n\n<div>NOTE: You must be fluent in both English &amp; French.</div>\n\n<p><strong>What you will do:</strong><ul><li>Target prospects consistent with the sales and marketing strategy</li><li>Define the appropriate tools and channels with the sales and marketing team to enrich the prospect database</li><li>Determine the best approach to sell our solution</li><li>Work on the identification, qualification of prospects and achievement of objectives</li><li>Participate in events: Trade shows, Networking Club etc…</li></ul></p>\n<p><strong>What we are looking for:</strong><ul><li>Fluent in French &amp; English</li><li>Bachelor's degree and ideally Masters</li><li>You have excellent prospecting skills with the ability to manage customer expectations in a positive manner</li><li>You are driven, hardworking, and excited to be in the world of tech sales!</li><li>You want to be part of a growing company, and contribute to its development, by deploying all your talents!</li></ul></p>\n<p><strong>What we offer:</strong><ul><li><b>No micromanaging. </b>Be the owner of your effort - you’ll be one of the team and fully  trusted to take responsibility for your tasks. You’ll have every incentive to make a real impact.</li><li><b>Continuous education.</b> We offer many opportunities for each employee to learn and grow from a mix of professional and non professional topics (a few examples of our permanent or latest classes: Coding lessons, blockchain class, mental health coaching, vegan cooking, …).</li><li><b>Unique career opportunity.</b> By joining a fast-growing company that’s making waves in the tech industry, you’ll have a wonderful chance to enhance your learning and advance in your career faster than you ever thought possible.</li><li><b>Lots. Of. Fun.</b> Our incredible magic makers organize awesome events, such as team games, drinks, yoga classes, parties, and a company-wide retreat every year with employees from all countries gathering for 2 days of fun.</li><li><b>Remote working, flexible schedule.</b> This isn’t a “clock in, clock out” company. We care about your productivity,  not tracking every minute you’re on site. It’s up to you to always be responsible for your work, no matter where you are or what schedule you’re keeping.</li><li><b>Time for yourself.</b> After a year within AB Tasty, we offer you a day off during which we simply ask you to think  about your career expectations with us. It's not always easy to find time for introspection and to envision what path can lead us to a happy career so we offer a Retreat Day as an opportunity to reflect on that. We not only aim to succeed, but also to make you succeed.</li></ul></p>", "name": "Sales Development Representative - Paris", "type": "external", "publication_date": "2024-02-05T23:03:48Z", "short_name": "sales-development-representative-paris", "model_type": "jobs", "id": 10795878, "locations": [{"name": "Paris, France"}], "categories": [{"name": "Sales"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/abtasty/sales-development-representative-paris"}, "company": {"id": 11719, "short_name": "abtasty", "name": "AB Tasty"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:39:34Z", "short_name": "pharmacy-technician-222236", "model_type": "jobs", "id": 13713776, "locations": [{"name": "Mahwah, NJ"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-222236"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Wir suchen nach Menschen, die mit uns die Digitalisierung von Morgen gestalten. Denn - Wir machen digital.<br><br></strong>Wir sind Siemens Digital Industries Software. Wir sind kein Industrieunternehmen. Wir sind ein wachsendes Softwareunternehmen, das unseren Kund<em>innen schon heute die Technologien und Innovationen von morgen bietet. Mit den Chancen eines Großunternehmens sind Deine Möglichkeiten endlos. Die Stelle, auf die Du Dich heute bewirbst, ist nur der erste Schritt auf Deinem Weg zu Siemens.<br><br>Werde jetzt Teil unseres Teams als <strong>Solution Architect (w/m/d) </strong><strong>- OEM / Trucks &amp; Busses</strong> und gestalte die Welt von morgen mit!<br><br>Durch unser hybrides Arbeitsmodell kannst Du flexibel von zu Hause, unterwegs oder an einem unserer über 20 Standorte innerhalb Deutschlands arbeiten. Wir unterstützen Deine Mobilität mit einem Dienstwagen oder einer BahnCard 100.<br><br><strong>Wie gestaltest Du die Welt von morgen? Herausfordernd und zukunftsorientiert!</strong><br><br>Die Digitalisierung stellt viele Unternehmen vor große Herausforderungen und wird die Prozesse in den kommenden Jahren immens verändern, die Schlagworte sind in aller Munde (z.B. Closed Loop Manufacturing, Product Lifecycle Management oder Totally Integrated Automation, Digitaler Zwilling, Industrie 4.0). Auch unsere Kund</em>innen müssen sich, mit unserer Hilfe, diesen Aufgaben stellen, nicht zuletzt steht dabei deren Wettbewerbsfähigkeit auf dem Prüfstand.<br><br>Als PLM Solution Architect mit Fokus auf OEM Prozesse wirst Du diese Reise wesentlich mitgestalten und die Anforderungen unserer Kund<em>innen in Digitalisierungslösungen mit dem Siemens Xcelerator Software Portfolio verwandeln.<br><br>Wir suchen einen PLM-Profi, der</em>die diese Aufgabe annimmt und mit seinem großen Erfahrungsschatz und Enthusiasmus unseren Kund<em>innen bei der Transformation zum digitalen Unternehmen zur Seite steht.<br><br><ul><li>Als Solution Architect bringst Du die Anforderungen unserer Kund</em>innen und die im PreSales erarbeiteten Lösungsansätze zusammen. Du definierst konkrete Architekturen auf Basis der Bedürfnisse der Kund<em>innen, natürlich immer vor dem Hintergrund einer optimalen wirtschaftlichen Umsetzbarkeit</li><li>Fokus der Arbeit liegt auf dem Design, der Konzeption und Umsetzung von innovativen Lösungskonzepten rund um die Prozesse der Kund</em>innen.</li><li>Du arbeitest an Consulting- und Digitalisierungsprojekten und führst dabei Implementation und Technical Consultants in interdisziplinären Teams als Lead Architect.</li><li>Als \"Trusted Advisor\" führst Du die Kund<em>innen auch in schwierigen Situation und bist für die Umsetzung der technischen Lösungen verantwortlich</li><li>Die Zusammenarbeit mit dem Produktmanagement und der Entwicklung ist ein weiteres entscheidendes Element für den Erfolg unserer Arbeit.</li><li>Unterstützung des Presales/Engagement Team während der technischen Auswahl- oder Angebotsphasen eines Projekts</li><li>Du verantwortest die zielsichere Integration der Architekturen in die Gesamtsysteme unter Berücksichtigung bestehender IT-Systemlandschaften</li><li>Als technische/r Expert</em>in arbeitest Du aktiv an der Dokumentation und Weiterentwicklung von Best-Practices und dem weiteren Ausbau unserer Wissensdatenbank</li><li>Dein zukünftiges, kollegiales Umfeld zeichnet sich durch ein offenes und partnerschaftliches Miteinander aus, wobei das Team im Vordergrund steht</li></ul><br><strong>Wie wirst Du Teil unseres Teams? Mit viel Leidenschaft und Mut!</strong><br><br><ul><li>Abgeschlossenes Studium der Informatik, Fahrzeugtechnik, allg. Maschinenbau, Produktions- oder Fertigungstechnik o.ä.</li><li>Du hast mehrjährige Erfahrung in der Beratung und Konzepterstellung für PLM Prozesse</li><li>Du besitzt Prozesswissen aus der Automotive-Industrie im Umfeld der Produktentwicklung, Fertigung und Service</li><li>Du hast gute Kenntnisse über das Siemens PLM Produktportfolio</li><li>Du kennst die Vorteile der PLM Philosophie und verstehen die Rolle unserer Produkte</li><li>Grundkenntnisse in mindestens einem führenden CAD System, ERP Prozesse, MES/MOM, PLM übergreifende Prozesse</li><li>Du bist in der Lage den Kunden auf dem Weg zur Verwirklichung seiner individuellen PLM Bedürfnisse zu führen</li><li>Komplexe oder schwierige Situationen mit Kund<em>innen meisterst Du mit Routine, Weitblick und kühlem Verstand</li><li>Beratungs- und Führungskompetenz sowie hervorragende Kommunikationsfähigkeiten auch auf Management Ebene</li><li>Wir kommunizieren sowohl mit unseren Kund</em>innen als auch mit unseren nationalen und internationalen Geschäftspartner<em>innen auf Deutsch und auf Englisch.</li><li>Unser Team arbeitet deutschlandweit. Wir können daher sowohl mit einer Homeoffice-Option entgegenkommen als auch mit einer attraktiven Dienstwagenregelung</li></ul><br>Wir bieten ein internationales Umfeld mit mehr als 140.000 Kund</em>innen in aller Welt, die heute schon auf unsere Kompetenz in der Digitalisierung setzen. Dabei bringen sich in Deutschland über 2.000 Kolleg<em>innen in spannende und abwechslungsreiche Kundenprojekte aus den Bereichen Luft- und Raumfahrt, Automobil- und Transportbranche, Konsumprodukte und Einzelhandel, Elektronik und Halbleiter, Energie- und Versorgungsindustrie, Industriemaschinen und Schwermaschinen, Maritime Industrie, sowie Medizinprodukte und Arzneimittel ein. Bei uns findest Du ein teamorientiertes Arbeitsumfeld, umfassende Weiterbildungsoptionen und attraktive Benefits. Durch individuelle Zielvereinbarungen und vielfältige Karrieremodelle mit Spezialisierungsoptionen bieten wir Dir die Möglichkeit, fachlich und persönlich zu wachsen.<br><br><strong>Bist Du ein</em>e Ideengestalter*in? Dann werde jetzt Teil unseres Teams!</strong><br><br>Wenn Du erste Fragen mit unserem Recruiting Team klären möchtest, wende Dich gerne per Mail an: careers-DACH.sisw@siemens.com<br><br>Ansprechperson dieser Stellenausschreibung ist Herr Marc Lerch.<br><br>Du möchtest vor Deiner Bewerbung mehr über Siemens Digital Industries Software erfahren? <strong>Mission / Vision und unser Software Portfolio</strong> - oder besuche unsere <strong>Homepage</strong>.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über <strong>Bewerbungen von Menschen mit Behinderung</strong>.<br><br><strong><br><br>#DISW</strong><br><br><strong>#LI-PLM</strong><br><br><strong>#LI-ML6</strong><br><br><strong>#LI-Hybrid</strong><br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry Software GmbH<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Solution Architect (w/m/d) - OEM / Trucks & Busses", "type": "external", "publication_date": "2023-01-19T02:58:02Z", "short_name": "solution-architect-wmd-oem-trucks-busses-401908", "model_type": "jobs", "id": 10634860, "locations": [{"name": "Berlin, Germany"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/solution-architect-wmd-oem-trucks-busses-401908"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br>The Store Manager In Training (SMIT) job is a development focused role that is crafted to prepare you for a CVS Store Manager position.<br><br>The SMIT program is designed to enhance your career as a future store leader. We support your development towards the store manager role by participating in a self-paced, collaborative training over the span of 16 weeks.<br><br>We provide both virtual and hands on learning experiences to develop you as a leader. Our team of people, that support your growth toward your leadership career include: your District Leader, Human Resources Business Partner, Training Store Manager, and your Store Manager coach.<br><br>Some of the skills needed for this role are:<ul><li>Communicate well verbally and in writing to support and lead your team.</li><li>Perform customer care duties to provide high levels of service.</li><li>Execute merchandising strategies to support store sales growth.</li><li>Manage the store inventory and assets to maintain profitability.</li></ul>We are invested in your growth and anticipate that you will be as well.  We expect our SMIT's to:<ul><li>Actively engage with your leader in Key Learning Experiences to support you on your path to promotion during the structured program.</li><li>Support your store as management team member and lead in a manner that is consistent with CVS values and policies.</li><li>Engage your colleagues in support of the company's purpose of \"helping people on their path to better health.\"</li><li>Be willing to accept promotion roles with the market that you work in.</li></ul>Selection for the SMIT position does not guarantee promotion into a Store Manager position.  Whether and when you are actually promoted to Store Manager is dependent on a variety of factors, including but not limited to performance and availability of openings.<ul><li>Willingness to accept a promotion to Store Manager role at any location in the designated market.</li><li>Ability to transfer to other CVS Pharmacy stores located within the designated market.</li><li>Ability to work a schedule that may vary based on business needs.</li><li>High School diploma or GED</li><li>Bachelor's Degree</li><li>Retail management experience, or experience as a CVS SupervisorΓÇÉ A high school diploma or GED is required.</li></ul>- A four year college degree is preferred, or relevant work experience may be considered in lieu of a college degree.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$18.50 - $23.88<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Manager in Training", "type": "external", "publication_date": "2024-03-17T12:42:26Z", "short_name": "store-manager-in-training-662cbd", "model_type": "jobs", "id": 13572043, "locations": [{"name": "Carmel, IN"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-manager-in-training-662cbd"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><b><strong>About the Role</strong></b><br><br>Account Representatives at Uber Eats bring the best local and regional small and medium restaurants to the Uber Eats platform. Who are we looking for? Someone who is natural at selling and knows the best local restaurants, passionate about food and Uber, and enjoys negotiating!<br><br>In this role you will lead the full sales cycle and sign partnerships with top local restaurants while being a champion for the Uber and Uber Eats brands. Your success in this role is measured by achieving and exceeding your monthly quota and proactively building your pipeline by managing and hitting the weekly metrics (cold-calls, emails, and field appointments).<br><br><b><strong>What You'll Do</strong></b><br><br><ul><li>Own and manage a pipeline of local small and medium restaurants to sign new partnerships in your geographic region with a mix of cold-calling (at least 50 dials per day) and in-person meetings</li><li>Build a great first-impression and act as an ambassador of Uber Eats to develop long-term partnerships and clearly communicate the value of Uber</li><li>Manage contract negotiation to establish the foundation of a strong working relationship with our restaurant partners, including sustainable economics for both parties</li><li>Help us identify and build standard processes and collaborate with the Account Management team to support a seamless onboarding experience for each new restaurant partner</li><li>Proactively maintain communication channels with prospects via phone, email, and face-to-face meetings</li></ul><br><b><strong>Basic Qualifications</strong></b><br><br><ul><li>Minimum 1+ years total professional sales experience <strong>or</strong> 0+ years with a Bachelor's Degree and exposure to sales through internships or other experiences</li><li>Passionate about sales and about helping restaurants and merchants grow their business with Uber Eats</li></ul><br><b><strong>Preferred Qualifications</strong></b><br><br><ul><li>Minimum 1+ year work experience in sales (full cycle sales preferred)</li><li>Experience with Salesforce and Google Suite</li><li>Good communicator and enjoy working on teams that value teamwork</li><li>Willingness to roll up your sleeves and demonstrate persistence and perseverance, you aren't fearful of rejection or cold-calling</li><li>Comfortable thinking on your feet, genuinely curious and like to ask questions</li><li>Excited to learn - This is a phenomenal role to grow or build your career in sales</li><li>No fear of picking up the phone - this role is 70% on the phone and 30% in the field</li></ul><br>For Chicago, IL-based roles: The base hourly rate amount for this role is $22.00 per hour. Additionally, our Sales Representatives are eligible to participate in the Company's Incentive program and will be eligible for a cash variable incentive target of $30,160.00 annually based on individual sales performance, with any amount of incentive payment based on the terms of the Sales Incentive Plan.<br><br>For Chicago, IL-based roles: The base hourly rate amount for this role is USD$22.00 per hour.<br><br>You will be eligible to participate in Uber's bonus program, and may be offered sales bonuses &amp; other types of comp. You will also be eligible for various benefits. More details can be found at the following link https://www.uber.com/careers/benefits.<br><br>Uber is proud to be an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know by completing this form.<br><br>Offices continue to be central to collaboration and Uber's cultural identity. Unless formally approved to work fully remotely, Uber expects employees to spend at least half of their work time in their assigned office. For certain roles, such as those based at green-light hubs, employees are expected to be in-office for 100% of their time. Please speak with your recruiter to better understand in-office expectations for this role.</p>", "name": "Account Representative, Chicago", "type": "external", "publication_date": "2024-02-29T00:26:58Z", "short_name": "account-representative-chicago", "model_type": "jobs", "id": 14023788, "locations": [{"name": "Chicago, IL"}], "categories": [{"name": "Business Operations"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/uber/account-representative-chicago"}, "company": {"id": 61, "short_name": "uber", "name": "Uber"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $18.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 05/23/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:27:42Z", "short_name": "shift-supervisor-trainee-f621c5", "model_type": "jobs", "id": 14148404, "locations": [{"name": "State College, PA"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-f621c5"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:47:58Z", "short_name": "pharmacy-technician-504c83", "model_type": "jobs", "id": 12836070, "locations": [{"name": "Summersville, WV"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-504c83"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Do you want to join us in helping to fight the world'smost threatening diseases and enabling access to care for more people aroundthe world? At Siemens Healthineers, we pioneer breakthroughs in healthcare.  For everyone. Everywhere.</strong><br><br><strong>We offer you a flexible and dynamic environment withopportunities to go beyond your comfort zone in order to grow personally and </strong><strong>professionally. Sound interesting?Then come and join our global team as Regional Service Manager.</strong><br><br><strong>Our global team</strong><strong>:We are a team of 66,000 highly dedicated employees across more than 70countries passionately pushing the boundaries of what's possible in healthcareto help improve people's lives around the world. As a leader in the industry,we aspire to create better outcomes and experiences for patients no matterwhere they live or what health issues they are facing. Our portfolio, spanningfrom in-vitro and in-vivo diagnostics to image-guided therapy and innovativecancer care, is crucial for clinical decision-making and treatment pathways.</strong><br><br><strong>Our culture</strong><strong>:We are part of an incredible community of scientists, clinicians, developers,researchers, professionals, and skilled specialists pushing the boundaries ofwhat's possible, to improve people's lives around the world.  We embrace a culture of inclusivity in whichthe power and potential of every individual can be unleashed. We spark ideasthat lead to positive impact and continued success. Check our Careers Site at </strong><strong>https://www.siemens-healthineers.com/en-us/careers</strong><strong>.  </strong><br><br><strong>This is a role well suited to an ambitiousprofessional, looking for the next step in their career. As a </strong><strong>Regional Service Manager,</strong><strong>you will beresponsible for</strong>:<br><br><ul><li>Work to maximize customerloyalty and satisfaction</li><li>Communicate the valueproposition of Siemens service to customers</li><li>Obtaining service financialgoals through revenue attainment and effective cost containment.</li><li>Ensure compliance with FDAGood Manufacturing Practices</li><li>Meet annual RSM goals andmetrics as established</li><li>Hire, develop, train andcoach Customer Service Engineers (CSE's)</li><li>Prioritize customer andbusiness objectives to provide clear direction to CSE's<ul><li>Developlong term value-based relationships with key accounts</li><li>Provideadditional escalation support to resolve key account issues</li><li>Developproactive account plans to prevent or predict issues</li><li>Providecontinues communication across organization for key accounts</li></ul></li><li>Some travel may be required</li></ul><br><strong>This position may suit you best if you are familiarwith </strong><strong>what is below, and would like to do develop your career withHealthineers<br></strong><br><br><ul><li>BS/BA in relateddiscipline, or advanced degree, where required, or equivalent combination ofeducation and experience.</li><li>8+ years of successfulexperience in a directly related field and successful demonstration of KeyResponsibilities and Knowledge as presented above.</li><li>Excellent organizationalskills</li><li>Superior communicationskills (written and oral) and ability to effectively communicate withstakeholders at many levels within the organization</li><li>Effectively presentinformation to co-workers and employee groups, including upper management,customers at various levels and public representatives</li><li>Ability to read, analyzeand translate into action financial profit and loss statements.</li><li>Professional levelknowledge on using analytical databases and complex excel workbooks andassociated pivot tables.</li><li>Ability to read, analyzeand interpret common scientific and technical journals, financial reports, andlegal documents</li><li>Ability to thrive as amember of a collaborative, cross-functional team</li><li>Competent knowledge of MSOffice applications</li></ul><br><strong>Required skills to have for thesuccess of this role</strong><br><br><ul> <li>Recent     experience in managing large remote employee-based territory</li> <li>Knowledge     of the Diagnostic Imaging Instruments or equivalent Diagnostic Imaging     industry experience</li> <li>Ability     to articulate and explain value of Service Agreement offerings</li> <li>Working     knowledge of SAP or experience with equivalent enterprise service software     solution</li></ul><br>AtSiemens Healthineers, we value those who dedicate their energy and passion to agreater cause. Our people make us unique as an employer in the med-techindustry. What unites and motivates our global team is the inspiration of ourcommon purpose:  To innovate forhealthcare, building on our remarkable legacy of pioneering ideas that translateinto even better healthcare products and services. We recognize that takingownership of our work allows both us and the company to grow. We offer you aflexible and dynamic environment and the space to move beyond your comfort zoneto grow both personally and professionally.<br><br><strong>If you want to join us in transforming the way healthcareis delivered, visit our career site at </strong>https://usa.healthcare.siemens.com/careers<strong>. </strong><br><br>Ifyou wish to find out more about the specific before applying, please visit: https://usa.healthcare.siemens.com/about.<br><br>Asan equal-opportunity employer we are happy to consider applications fromindividuals with disabilities.<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Medical Solutions USA, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Regional Service Manager -  West Michigan", "type": "external", "publication_date": "2023-04-14T23:43:20Z", "short_name": "regional-service-manager-west-michigan", "model_type": "jobs", "id": 11189260, "locations": [{"name": "Hoffman Estates, IL"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/regional-service-manager-west-michigan"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $18.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 06/11/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "store associate", "type": "external", "publication_date": "2024-03-17T12:15:37Z", "short_name": "store-associate-b7c1f5", "model_type": "jobs", "id": 14357016, "locations": [{"name": "Crawfordsville, IN"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-b7c1f5"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Hybrid Cloud Service Manager (SAP Infrastructure &amp; Services)</strong><br><br><strong>Location: Poland</strong><br><br>We at Siemens Healthineers are committed to helping healthcare providersglobally to succeed in today's dynamic environment. We are inspired to transformthe way things are done - because we want what is best for our people, ourcustomers and ultimately the health of mankind.<br><br>While we invest in engineeringexcellence - leading-edge medical technologies and services, we don't stopthere. We also deeply invest on our 68 000 people with the hearts of pioneers, highlycommitted and connected in this industry. And as we strive to shape the futureof healthcare, our overall success will depend on our ability to continuouslyreinvent ourselves. <br><br><strong>The HybridCloud Service Manager for SAP infrastructure and services is responsible forleading the development of the support solutions, including the support organizationand 3rd Parties. Driving Operational Excellence through standardization/simplificationof systems and enabling continuous improvement across the organization. Focusedon the design, deployment of Support solutions and all necessary programs andBAU integration points.</strong><br><br><strong>The Hybrid Cloud Service Manager has the followingresponsibilities</strong><strong>:</strong><br><br><ul> <li>Work with internal &amp; external stakeholders     in IT, vendors &amp; business to collaboratively develop and drive the     strategy &amp; roadmap for the SAP services in scope. Understands service     requirements, components and setup to drive continuous service     improvements</li> <li>Takes ownership of the SAP services' service     level agreements between stakeholders and the customers which details the     parameters of the services to be provided. Involved in and manages     incident, problem, and change management for service on day-to-day basis     as per defined SLAs. Ensures root cause analysis and permanent fix for     problems</li> <li>Takes ownership and delivers operational level     agreements (OLA) with departments internal to the service provider     detailing the provision of certain elements of a service</li> <li>Drives service team to establish and agree     development priorities and development work</li> <li>Communicates, influences and works with     stakeholders and executives both inside and outside of SHS IT to ensure     the broadest understanding and contribution to the hybrid cloud strategy</li> <li>Acts as go-to point for data center services     and advises various internal, partner and customer teams on hybrid cloud     services. Coordinates communication among internal and external support     staff</li> <li>Contribute to regional and global projects,     influencing, building and maintaining relationships, collaborations and     partnerships with internal and external stakeholders</li> <li>Responsible for day-to-day management of tasks     and processes related to service &amp; its deployments</li> <li>Ensures and participates in ITIL process     execution including Asset, incident, change, problem, configuration,     release and knowledge management</li> <li>Provides operational leadership and expert     knowledge to internal customers to assist their IT related challenges. Serves     as the point of escalation (notification) for major incidents</li> <li>Maintains updated service documentation as per     ITSM framework of SHS IT</li> <li>Provides senior management and service     stakeholders required, weekly, monthly and quarterly reports related to     service performance, SLAs etc.</li> <li>Travels as needed to engage with internal and     external stakeholders to oversee day-to-day operations as well as to     ensure service delivery in alignment with SHS IT strategy.</li> <li>Responsible for ensuring service governance     related to security, costs, data protection, legal, export control &amp;     customs requirements.</li> <li>Participates in internal service review     meetings (within IT &amp; with business) &amp; supplier management     meetings</li></ul><br><strong>Qualificationsand experience:</strong><br><br><ul> <li>Bachelor's     degree in engineering, computer science or a related field with 13+ years     of total workexperience</li></ul><ul> <li>Experience     of large-scale SAP implementations and transformation programs</li> <li>Have good     understanding and experience in SAP Basis and SAP Interface Management</li></ul><ul> <li>Strong     knowledge of all ITIL processes and demonstrable mandatory experience of     7+ years in ITservice delivery in a global organization across continents</li></ul><ul> <li>Passionate     about technology with demonstrable experience of delivering services that meet the businessneed and are delivered in accordance with agreed business requirements, andmanaging the service lifecycle</li></ul><ul> <li>Demonstrable     understanding of the unique requirements for enterprise and commercial customer use ofthe data centers. </li></ul><ul> <li>Understanding     of compute, storage, network, security and datacenter technologies and emerging trendsin the modern data centers.</li></ul><ul> <li>Familiarity     with Healthcare standards FDA, HIPPAA, Part 11 etc. and data protection laws like GDPRetc.</li></ul><ul> <li>Preferred     knowledge of financial processes including forecasting, budgeting &amp;     accounting skills.  </li> <li>Self-directed,     proactive, work on own initiative with a best practice approach. Pragmatic problem solver.Able to articulate technical issues in terms of business risk and opportunity.Strong team player prepared to work flexibly across a matrix organization.</li></ul><ul> <li>Strong     communication and interpersonal skills and a strong professional ethic     when dealing withcustomers.</li></ul><ul> <li>Able to     negotiate and resolve conflicting priorities and to influence senior     executives </li> <li>Able to     assimilate information from multiple sources and to disseminate     effectively to customers andcolleagues.</li></ul><br><strong>Weoffer:</strong><br><br>•       Exciting workin international corporation<br><br>•       Contract of employment with benefitpackage (i.e. medical care, couple of extra vacation days every year, pensionscheme)<br><br>•       We provide necessary tools <br><br>•        You can choose your work type remote/hybrid/office<br><br><strong>If you are interested use the\"Apply\" button.</strong><br><br><strong>Our culture:</strong><br><br>At Siemens Healthineers, we take into account different perspectives, areopen to dialogue and challenge conventions. Change is an integral part of ourwork. We strive to be a leader of change in our industry, not just to respondto them. We invite you to take on new challenges with us, test your ideas andcelebrate successes.<br><br>We highly value diversity, inclusion and equal opportunities, so wewarmly invite everyone, regardless of their gender identity, to apply for thisposition. We also encourage people with disabilities to apply.<br><br><strong>Do you want to know more? Contact us.</strong><br><br>At https://www.siemens-healthineers.com/pl/ you will find additional information about our areas of activities.<br><br>We care about data privacy and take it seriously in accordance with theGDPR and other regulations related to personal data protection. For thisreason, please do not send us your CV or other application documents by e-mail.Instead, please create your profile on our Career Portal https://jobs.siemens.com/healthineers , which allows you to submit your documents, apply for open positions andto obtain information about our vacancies and career development at Siemens.<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Healthcare Sp. z o.o.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Hybrid Cloud Service Manager (SAP Infrastructure & Services) m/f/d", "type": "external", "publication_date": "2023-04-19T23:40:41Z", "short_name": "hybrid-cloud-service-manager-sap-infrastructure-services-mfd-11420b", "model_type": "jobs", "id": 11139620, "locations": [{"name": "Warsaw, Poland"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/hybrid-cloud-service-manager-sap-infrastructure-services-mfd-11420b"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions. As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management<br><br>A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li><b>Required Qualifications</b><br>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Free of pending felony charges or convictions for criminal offenses involving controlled substances</li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60.00 - $73.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Dist Suppt Pharmacist PT", "type": "external", "publication_date": "2024-03-17T12:39:35Z", "short_name": "dist-suppt-pharmacist-pt-73da40", "model_type": "jobs", "id": 13667614, "locations": [{"name": "Plano, TX"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/dist-suppt-pharmacist-pt-73da40"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br> o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br> o Actively look for ways to help people, and do so in a friendly manner<br> o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br> o Use and understand verbal and written communication to interact with customers and colleagues<br> o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br> o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br> o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br> o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br> o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:50:31Z", "short_name": "pharmacy-technician-de8805", "model_type": "jobs", "id": 12303727, "locations": [{"name": "League City, TX"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-de8805"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:27:43Z", "short_name": "pharmacy-technician-c2fc27", "model_type": "jobs", "id": 14099738, "locations": [{"name": "Wesley Chapel, FL"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-c2fc27"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:36:11Z", "short_name": "shift-supervisor-trainee-52d09c", "model_type": "jobs", "id": 13894345, "locations": [{"name": "Houston, TX"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-52d09c"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}], "aggregations": {}}