{"page": 10, "page_count": 15774, "items_per_page": 20, "took": 16, "timed_out": false, "total": 315477, "results": [{"contents": "<p><strong>*We kindly request that applicants submit both an english and german version of their CV.</strong><br><br><strong>Knowledge for the world of tomorrow.</strong><br><br>The Tübingen location of Siemens AG develops, tests, and manufactures geared motors for the global market. The target customers comprise transport technology, automotive, and airport logistics, among others. The Tübingen plant coordinates Siemens manufacturing locations for geared motors worldwide. Due to digitalisation solutions which can be checked on site, the plant was included in the list of \"100 locations of Industry 4.0\" of the Land Baden-Württemberg.<br><br><strong>Change the world with us.</strong><br><br>You shall take over the logistics management of a network of 2 plants with the associated in-house logistics, order processing, material planning, and dispatch. In our integrated environment, you shall comprehensively synchronise the E2E supply chain with focus on the source, deliver, dispatch, and inbound &amp; outbound logistics with a high level of understanding of LEAN. You shall have the opportunity to carry out holistic optimisations in order to develop supply chain logistics more efficiently and cost-effectively. You shall drive the process and technology development with an increase in the degree of automation and digitalisation in logistics, e.g., with the use of disruptive technologies such as driverless transport systems, advanced robotics, KI applications. Thanks to your holistic understanding of the system, you shall bring information flows and physical realisations into line with the use of innovative digital solutions. You shall work with confidence and strong communication skills in an international environment with internal and external business contacts, including customers, regions, suppliers, but also head office functions.<br><br><strong>Your profile for \"Make the Future Possible\".</strong><br><br><ul><li>You should have successfully completed a technical or economic degree. Many years of professional experience in the manufacturing or logistics environment should be part of your profile.</li><li>You should be characterised by a broad understanding of leadership. In this role, you will lead various groups that include technology and process design, logistics handling, and operational implementation. You should have experience in optimising supply chain / logistics processes in a network of two locations.</li><li>You should already have well-founded process experience in production and logistics processes (e.g., Lean processes, automation, E2E thinking) as well as experience with SAP (MM, SD).</li><li>You should impress us with your strategic skills, creative drive, and ability to create an innovative working environment.</li><li>You should work actively on the optimisation of inventories and logistics processes in order to strengthen the cash flow position of the plants and of the organisation.</li><li>You should also proactively drive topics forward and have a passion for efficiency and expertise in digitalisation and automation.</li><li>An agile and structured approach is required due to the complexity of the task; you should be able to get to the substance of the matter and develop specific actions.</li><li>You should have profound knowledge of written and spoken German and English and be willing to travel.</li></ul><br><strong>We are Innomotics!</strong><br><br><ul><li>Motors, electric drives, and drive solutions have been our business and our passion for more than 150 years.</li><li>Based on this experience, Siemens AG will become an independent, integrated producer of motors and large drives with the establishment of a wholly owned subsidiary of Siemens AG on 1 July 2023.</li><li>A company with over 14,000 employees, EUR 3 billion in sales, and 16 manufacturing sites worldwide.</li><li>Siemens AG and Innomotics will continue to closely cooperate to ensure that our products, systems and solutions function optimally for you.</li></ul><br><strong>What we offer.</strong><br><br><ul><li>2 to 3 days of mobile working per week as a future global standard</li><li>Attractive remuneration package</li><li>Development opportunities for both personal and professional growth </li><li>30 leave days and a variety of flexible working models that allow time off for yourself and your family </li><li>Share matching programs to become a shareholder of Siemens AG</li><li>Find more benefits here</li></ul><br>Individual benefits are adapted to meet local legal regulations, the requirements of different job profiles, locations, and individual preferences<br><br><strong>Make your mark in our exciting world at Siemens.</strong><br><br>As an equal-opportunity employer we are happy to consider applications from individuals with disabilities.<br><br><strong>https://new.siemens.com/</strong> - if you would like to find out more about jobs &amp; careers at Siemens.<br><br><strong>FAQ</strong> - if you need further information on the application process.<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens AG<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Either</p>", "name": "Head (w/m/d) Factory Logistics", "type": "external", "publication_date": "2023-04-10T23:33:26Z", "short_name": "head-wmd-factory-logistics-94a4f6", "model_type": "jobs", "id": 11034616, "locations": [{"name": "Tübingen, Germany"}], "categories": [{"name": "Transportation and Logistics"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/head-wmd-factory-logistics-94a4f6"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li></li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "FT Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:47:59Z", "short_name": "ft-shift-supervisor-trainee-2489ba", "model_type": "jobs", "id": 12831907, "locations": [{"name": "Overland Park, KS"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/ft-shift-supervisor-trainee-2489ba"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:27:42Z", "short_name": "pharmacy-technician-037319", "model_type": "jobs", "id": 14103816, "locations": [{"name": "DeSoto, TX"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-037319"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>At Siemens we are always challenging ourselves to build a better future.  We need the most innovative and diverse Digital Minds to develop tomorrow's reality.  Find out more about the Digital world of Siemens here:  www.siemens.com/careers/digitalminds  Questa Simulation Product Manager <br>Siemens DISW is investingheavily in high-performance simulation of semiconductor designs, as its Questasimulation product line continues to grow faster than the overall market,thanks to recent advances in machine-learning and parallelism.  This exciting new Simulation Product Managerposition reports to the Director of Product Management for the DesignVerification Technology division.  In therole of Simulation Product Manager, you will join a high-performing team thatis rapidly growing its business in a fast-growing market segment.<br><br>As a Simulation Product Manager,you will be responsible for the helping to implement product strategies,including assembling product roadmaps and documenting development priorities. Asa member of the Product Management team, you will work closely with customers,key industry and academia technologists, Product Engineering, R&amp;D, and key SiemensDISW technologists to implement programs to maximize business in this productline.  You will need to be able to alignproduct line strategies into programs, initiatives, and tactics.  Experience in understanding, documenting andprioritizing customer requirements into business, product and promotional plansis a plus.<br><br>A successful candidate must havea strong desire and enthusiasm for working with customers, account teams,distributors, internal groups and other industry experts to maximize our businessin the semiconductor and systems market segments.  You will need to effectively communicate withmultiple levels of organizations, from engineers to managers when gatheringrequirements and promoting our solutions to customers.  Driving collaboration is a must along withthe ability to indirectly influence others within marketing, engineering andsales, across divisions and with 3rd party partners.<br><br>An optimal candidate must havepractical exposure to System and IP design and verification processes, as wellas leading edge functional verification tools and methodologies.  The candidate must have an appreciation ofthe challenges and evolving use-models at all levels of abstraction includingsimulation of design IP to emulation of entire systems.<br> Key Responsibilities <br>•      Developrelationships with appropriate early adopter customers/partners based onbusiness alignment.  Implementpartnerships to support the business objectives of DVT.<br><br>•      SupportPR and sustaining outbound marketing strategy collateral with partners.<br><br>•      Collect,update, and maintain competitive information.<br><br>•      Supportcollaboration with other complementary product groups.<br><br>•      Developbusiness relationships with strategic customers and account teams.  Implement plans to ensure sales engagementand business success.<br><br>•      Assemble1-3 year roadmaps.  Support collateralpriorities including new product introduction and business introductionpresentations.<br><br>•      Implementlaunch tactics for new products and technologies as needed.  Support messaging, positioning, andcommunicating to the industry for awareness and to the field for saleseffectiveness.<br><br>•      Supportmessaging, positioning, and communicating at conferences, and implementrequirements and priorities for collateral generation.<br><br>Screening  A candidate must be able to explain each of the following topicsprior to requesting an interview <ul><li>Semiconductor design and/orverification</li><li>EDA, VIP, Verilog, VHDL,SystemVerilog</li><li>Simulation, Formal Verification,Emulation</li></ul> Requirements  A candidate must bring the following requirements  <br>•      A mixture ofbusiness, marketing, and technical skills<br><br>•      Domainexperience in design and/or verification IP<br><br>•      Functionalexperience in product marketing and product management<br><br>•      Abilityto implement initiatives, programs, and tactics that align to strategy<br><br>•      Strongwritten and verbal skills with the ability to communicate<br><br>•      Knowledgeof and exposure to verification tools and methodologies<br><br>•      Abilityto work toward objectives rather than by task assignment<br><br>•      Willingto travel 25% of the time, including occasional international travel<br><br>Preferred  A strong candidate would bring the following requirements  <br>•      Experiencein both field and divisional organizations. Understands both perspectives.<br><br>•      Experiencein the sales process of complex systems. Understands the elements of selling.<br><br>•      Familiarityin product lifecycle management, including Crossing the Chasm from earlyadoption into the mainstream.<br><br>The salary rangefor this position is $95,800 to $172,400 and this role is eligible to earnincentive compensation. Theactual compensation offered is based on the successful candidate's worklocation as well as additional factors, including job-related skills,experience, and relevant education/training. Siemens offers avariety of health and wellness benefits to employees. Details regarding ourbenefits can be found here: www.benefitsquickstart.com. In addition, this position is eligible fortime off in accordance with Company policies, including paid sick leave, paidparental leave, PTO (for non-exempt employees) or non-accrued flexible vacation(for exempt employees).<br><br>#LI-PLM <br><br>#DISW<br><br>#LI-HYBRID<br><br>#LI-KM1<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry Software Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Product Manager - Simulation", "type": "external", "publication_date": "2023-06-01T23:45:19Z", "short_name": "product-manager-simulation-3dc30f", "model_type": "jobs", "id": 11489023, "locations": [{"name": "Austin, TX"}], "categories": [{"name": "Product Management"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/product-manager-simulation-3dc30f"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Od 3 lat firma Siemens realizuje swoją działalność produkcyjną w Polsce. Fabryka w Mirkowie zajmuje się montażem nowoczesnych, uznanych jakościowo szaf sterowniczych. W związku z naszym rozwojem poszukujemy osoby na stanowisko <strong>Technika / techniczki jakości (f/m/d)</strong>, która będzie pierwszym punktem kontaktu w przypadku pytań dotyczących jakości wyrobów/procesów, ściśle współpracując z  fabryką w Chemnitz (w Niemczech). Szukamy osoby, która poprzez swoje działania będzie wywierała prawdziwy wpływ na kształtowanie wysokiej kultury jakości w firmie.<br><br><strong>Zmień z nami przyszłość na lepsze. Będziesz odpowiedzialny/na za:   </strong><br><br><ul><li>Prowadzenie okresowych analiz/opracowań używając wielu danych</li><li>Wspieranie obszaru produkcji w przygotowaniu analiz oraz dążeniu do uzyskiwania przez ten obszar oczekiwanych wyników KPI </li><li>Przewodniczenie w rozwiązywaniu problemów technicznych, systemowych</li><li>Tworzenie procedur i instrukcji systemu zarządzania wraz z mapami procesów</li><li>Wspieranie Głównego Specjalisty ds. Jakości i BHP w prowadzeniu auditów wewnętrznych oraz dedykowanych działań z obszaru jakości, też z bezpiecznego wykonywania prac produkcyjnych i biurowych oraz środowiska naturalnego</li><li>Ciągłe doskonalenie w realizacji celów i zadań firmy</li></ul><br><strong>Jakie wymagania należy spełnić, by to urzeczywistnić?</strong><br><br><ul><li>2 lata doświadczenia w pracy w firmie produkcyjnej na podobnym stanowisku</li><li>znajomość MS Office, w szczególności Excel i PowerPoint w stopniu średniozaawansowanym</li><li>doświadczenie w pisaniu procedur, instrukcji, SOP (Standard Operation Procedure), etc.</li><li>bardzo dobra znajomość języka angielskiego (co najmniej na poziomie B2)</li><li>biegła znajomość języka polskiego</li><li>odpowiedzialność i nastawienie na partnerską współpracę</li><li>pozytywne nastawienie do realizowanych działań (podejście \"CAN DO\")</li><li>Mile widziane:</li><ul><li>certyfikat wewnętrznego auditora systemu zarządzania jakością wg ISO 9001:2015 </li><li>znajomość MS Visio w stopniu średniozaawansowanym</li><li>znajomość języka niemieckiego będzie dodatkowym atutem</li></ul></ul><br><strong>Mamy całkiem dużo do zaoferowania:</strong><br><br><ul><li>możliwość pracy w pełnym innowacyjnych technologii międzynarodowym środowisku </li><li>sposobność do prawdziwego wpływu na biznes przy ścisłej współpracy z obszarem produkcji</li><li>dobrą atmosferę pracy oraz kulturę organizacji opierającą się na zaufaniu, odpowiedzialności oraz szacunku </li><li>atrakcyjny pakiet benefitów wliczając w to: prywatną opiekę zdrowotną, ubezpieczenie na życie, kartę lunchową, dofinansowanie do zajęć sportowych </li></ul><br><strong>Siemens jest Pracodawcą Równych Szans</strong><br><br>Gdybyśmy wszyscy myśleli w ten sam sposób, nigdy nie stworzylibyśmy nic nowego. Wiemy, że tworząc zróżnicowane środowisko pracy, mamy realny wpływ na sukces naszej firmy, dlatego zachęcamy do aplikowania Kandydatów z różnych środowisk (o różnych doświadczeniach i podejściach). Tworząc przyjazne i otwarte środowisko pracy, dbamy by na każdym etapie naszych działań wspierać kulturę różnorodności. Wszyscy aplikujący Kandydaci będą oceniani pod kątem ich kompetencji, wiedzy i umiejętności.<br><br><strong>Czekamy na Twoją aplikację! </strong>Prosimy o przesyłanie CV w języku angielskim.<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Sp. z o.o.<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Technik / Techniczka jakości (f/m/d)", "type": "external", "publication_date": "2023-05-19T23:38:55Z", "short_name": "technik-techniczka-jakosci-fmd", "model_type": "jobs", "id": 11404138, "locations": [{"name": "Wroclaw, Poland"}], "categories": [{"name": "Unknown"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/technik-techniczka-jakosci-fmd"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $22.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:32:17Z", "short_name": "shift-supervisor-trainee-2b8ab5", "model_type": "jobs", "id": 13969724, "locations": [{"name": "Hingham, MA"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-2b8ab5"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions. As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li><b>Required Qualifications</b><br>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Free of pending felony charges or convictions for criminal offenses involving controlled substances</li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$65.00 - $78.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "CA Staff Pharmacist FT", "type": "external", "publication_date": "2024-03-17T12:42:24Z", "short_name": "ca-staff-pharmacist-ft-72360c", "model_type": "jobs", "id": 13628663, "locations": [{"name": "Fresno, CA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/ca-staff-pharmacist-ft-72360c"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:32:18Z", "short_name": "store-associate-f2c0f9", "model_type": "jobs", "id": 13946885, "locations": [{"name": "Long Beach, CA"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-f2c0f9"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Art der Anstellung:</strong> <br>Befristet / <br>35h/Woche<br><br>Willst du die Zukunft des Gesundheitswesens mitgestalten? Wir bei Siemens Healthineers setzen auf Menschen, die ihre Energie und Leidenschaft diesem Ziel widmen - das sagt schon unser Unternehmensname. Siemens Healthineers steht für Pioniergeist unserer Mitarbeitenden, gepaart mit unserer langen Tradition als weltweit führender Technologiekonzern in der stets dynamischen Gesundheitsbranche.<br>Wir bieten ein flexibles und dynamisches Umfeld voller Gelegenheiten, über sich hinaus zu wachsen, um sich persönlich und beruflich weiterzuentwickeln. Klingt das interessant für dich?<br><br><strong>Dann werde Teil unseres globalen Teams als Ferienaushilfe (w/m/d) bei Restaurant Services.</strong><br><br><strong>Deine Aufgaben und Verantwortlichkeiten:</strong><br><br><ul><li>Du hilfst bei der Speisenzubereitung und Essensausgabe, wenn unseren Mitarbeitenden der Magen knurrt. Zu deinen Aufgaben gehört das:</li><ul><li>Transportieren der Lebensmittel zur Küche</li><li>Aufbereiten der Lebensmittel zur Verarbeitung (würzen, panieren etc.)</li><li>Portionieren einfacher Speisen wie Salate und Desserts</li><li>Tragen der Speisen zur Essenausgabe</li><li>Anrichten von Speisen nach Anleitung</li><li>Auslegen von Besteck und Geschirr</li></ul><li>Um der Belegschaft ein angenehmes Ambiente zu bieten, unterstützt du uns ebenso bei folgenden Aufgaben:</li><ul><li>Spülen von Geschirr</li><li>Reinigen und Pflegen von Maschinen und Arbeitsgeräten</li><li>Reinigen des Arbeitsplatzes</li><li>Abräumen des Geschirrs</li><li>Vorreinigen von Kochutensilien sowie von Geschirr und Besteck</li><li>Ein- und Ausräumen von Geschirrspülern und sortiertes Weglegen zur weiteren Benutzung</li></ul></ul><br>Mehr über dieses Geschäftsfeld erfährst du unter https://www.siemens-healthineers.com/de/products-services<br><br><strong>Deine Qualifikationen und Erfahrung:</strong><br><br><ul><li>Du bist Schüler<em>in und bist mindestens 18 Jahre alt</li><li>Du kannst uns entweder im Zeitraum vom 21.08.2023 bis 08.09.2023 mit 35 Wochenstunden unterstützen</li><li>Du hast bereits eine Bescheinigung über die Aufklärung der Infektionsschutzbelehrung nach § 3 IfSchG oder bist bereit, dieser Anforderung bis Tätigkeitsbeginn nachzukommen</li></ul><br><strong><br>Dein Profil und deine Fähigkeiten:</strong><br><br><ul><li>Du besitzt gute Deutschkenntnisse</li><li>Du hast Lust auf ein nettes Team und eine unkomplizierte Tätigkeit? Dann bist du bei uns genau richtig!</li></ul><br><strong>Unser globales Team:</strong><br><br>Siemens Healthineers ist ein weltweit führendes Medizintechnikunternehmen. Mit mehr als 68.000 engagierten Mitarbeitenden in über 70 Ländern gestalten wir die Zukunft des Gesundheitswesens. Jeden Tag profitieren etwa fünf Millionen Patient</em>innen weltweit von unseren innovativen Technologien und Dienstleistungen aus den Bereichen Diagnostik und therapeutische Bildgebung, Labordiagnostik und molekulare Medizin sowie von unseren digitalen Gesundheits- und Unternehmensdienstleistungen.<br><br><strong>Unsere Kultur:</strong><br><br>Unsere Unternehmenskultur schätzt verschiedene Blickwinkel, offene Diskussionen und den Willen, Konventionen in Frage zu stellen. Ständiger Wandel gehört zu unserem Arbeitsalltag. Wir wollen in unserer Branche Veränderungen vorantreiben, statt nur darauf zu reagieren. Deswegen laden wir dich ein, dich neuen Herausforderungen zu stellen, eigene Ideen auszutesten und Erfolge zu feiern. Besuche auch unsere Karriere-Seite unter https://www.siemens-healthineers.com/de/careers<br><br>Wir legen Wert auf Diversität und Chancengleichheit und freuen uns über Bewerbungen mit vielfältigen Hintergründen und insbesondere von Menschen mit Behinderung.<br><br>Du möchtest mehr erfahren und erste Fragen gern persönlich klären - Sprich uns an: <br><br>students.func@siemens-healthineers.com<br><br>.<br><br>Wir nehmen den Schutz deiner Daten und die Einhaltung der DSGVO und anderer Datenschutzgesetze ernst. Deshalb bitten wir dich, uns deinen Lebenslauf nicht per E-Mail zu schicken. Bitte lege dir ein Profil in unserer Talent Community an, um deinen Lebenslauf hochzuladen. Daran erkennen wir, dass du an Karrieremöglichkeiten bei uns interessiert bist und können dich zu relevanten Stellen benachrichtigen. Klicke hier, um ein Profil anzulegen.<br><br>Siemens Healthineers Deutschland wurde mit dem Zertifikat Great Place to Work® ausgezeichnet.<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Healthcare GmbH<br><br><b>Experience Level:</b> Student (Not Yet Graduated)<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Ferienjob als Küchenhelfer*in (w/m/d) in Forchheim vom 21.08.2023 bis 08.09.2023", "type": "external", "publication_date": "2023-03-13T23:41:45Z", "short_name": "ferienjob-als-kuchenhelferin-wmd-in-forchheim-vom-21082023-bis-08092023", "model_type": "jobs", "id": 11022324, "locations": [{"name": "Erlangen, Germany"}], "categories": [{"name": "Unknown"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/ferienjob-als-kuchenhelferin-wmd-in-forchheim-vom-21082023-bis-08092023"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>Who designs your future? You do.</strong><br><br>Are you looking for a career where you can showcase your technical aptitude and passion for problem-solving to ensure your customers can work in a comfortable, safe, and energy-efficient environment? Then look to Siemens!<br><br><strong>Our Culture: <br> </strong>At Siemens, we live and foster an ownership culture, in which every employee takes personal responsibility for our company's success. We trust and empower our leaders to act as owners, direct their teams, and innovate to succeed. We communicate openly and honestly to learn from our failures and celebrate our successes. We recognize individual and team achievements frequently. We invest in our team members, offering a wide variety of internal and external development opportunities.<br> <br><strong>What you will do for Siemens Smart Infrastructure:</strong><br><br>Our Operations Managers lead a team responsible for project management, system installation, and commissioning activities. As an Operations Manager, you will manage the revenue and gross margin to targets by controlling job costs and executing projects on time.<br> <br><strong>Responsibilities:</strong><br><br><ul><li>Supervise, train, and mentor the team through goal setting, performance monitoring, employee review meetings, and scheduling of formal training</li><li>Manage revenue, gross margin, and absorption to achieve monthly and annual business plan projections and forecasts</li><li>Direct and supervise the development of project plans in order to monitor and control the progress in the execution of work</li><li>Ensure schedules are maintained and projects proceed in accordance with the contract documents and customer expectations</li><li>Plan and justify manpower, staffing requirements, tools, and other appropriate investments for effective and timely execution of work</li><li>Maintain relationships between Operations and Sales teams so project details, changes, and plan discrepancies can be managed to minimize cost and delays throughout the estimating, bidding and operations phases of each project</li><li>Support project productivity and profitability through cost-containment procedures and processes</li></ul><br><strong>Qualifications:</strong><br><br><ul><li>High school diploma or state-recognized GED; Bachelor's degree preferred</li><li>Experience supervising teams; 2+ years preferred</li><li>Experience with project management preferred</li><li>Solid understanding of job financial reporting with ability to apply cost control measures for projects</li><li>Familiarity or experience with HVAC systems and/or building automation systems</li><li>Excellent organizational and interpersonal skills</li><li>Proficient in Microsoft Office</li><li>Good verbal and written communication skills in English</li><li>Must be 21 years of age and possess a valid driver's license with limited violations</li><li>Applicants must be legally authorized for employment in the United States without need for current or future employer-sponsored work authorization</li><li>Where permitted by applicable law, Siemens may require employees to be fully vaccinated against COVID-19 based on job requirements, and in accordance with an accommodation based on legally protected reasons</li></ul><br><strong>Benefits: </strong><br><br><ul><li>Competitive salary based on qualifications</li><li>Health, dental, and vision plans with options</li><li>Matching 401(k)</li><li>Competitive paid time off plan, holidays, and floating holidays</li><li>Paid parental leave</li><li>Company cell phone and laptop</li><li>Extensive product training and professional career development</li><li>Education and tuition reimbursement programs available</li><li>Overtime, on-call pay, and company uniform and vehicle for eligible positions</li></ul><br>#LI-DRR<br><br>#RSS<br><br>Keywords:  Hvac controls, building controls,building automation, programming, field technician, heating, ventilation, airconditioning, direct digital control, apogee, desigo, modbus, tridium, alerton,controls, commissioning, lonworks, bacnet, ddc, bau, bms, building management,mechanical systems, system integration<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Operations Manager - Building Automation / HVAC Controls - Boston, MA", "type": "external", "publication_date": "2023-04-07T23:37:19Z", "short_name": "operations-manager-building-automation-hvac-controls-boston-ma-8f2f4d", "model_type": "jobs", "id": 11155240, "locations": [{"name": "Boston, MA"}], "categories": [{"name": "Project Management"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/operations-manager-building-automation-hvac-controls-boston-ma-8f2f4d"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>Gemeinsam realisieren wir, worauf es ankommt!</strong><br>Smart Infrastructure verbindet auf intelligente Weise Energiesysteme, Gebäude und Industrien, um die Art, wie wir leben und arbeiten, weiterzuentwickeln und zu verbessern. Dabei stehen alle Arten von Gebäuden in unterschiedlichsten Märkten für uns im Fokus. Immer mit dem Anspruch, Infrastrukturen laufend zu verbessern. Dies machen wir unabhängig von der Gebäudegrösse, durch vernetzte, cloudbasierte digitale Angebote und Dienstleistungen sowie durch Produkte, Komponenten und Systeme. Von der intelligenten Stromnetzsteuerung, Gebäudeautomations- und Management Systemen, Brandschutz- und Sicherheitslösungen bis hin zu Schaltern, Ventilen und Sensoren. Siemens - für eine nachhaltige Entwicklung unserer Welt von morgen. Gestalte als Teil eines weltweiten Teams von rund 303 000 Mitarbeitenden mit uns die Zukunft.<br><br>Wir können mit Remote Connectivity schneller auf die Bedürfnisse unserer Kunden reagieren, entscheidende Erkenntnisse aus Daten leichter gewinnen und gleichzeitig die Umwelt durch weniger Fahrten zum Kunden schonen.  Remote Connectivity ist die zentrale Verbindungsstelle unserer technischen Anlagen mit unseren Cloud-Systemen Xcelerator und BuildingX.<br><br>Damit du erfolgreich sein kannst, lernst du das Produkt Management kennen und entwickelst dich zu einem Ansprechpartner für Fachthemen. Du bearbeitest interne Anliegen und wirst diese selbstständig lösen können. Dabei hast du die Chance die Entwicklung im Bereich Remote Connectivity für die Schweiz mitzugestalten. Dich unterstützten dabei erfahrene Fachexpert:innen und Produkt-Manager:innen. Wenn Du Lust auf Verantwortung und kontinuierlich Lernen hast, dann bist du bei uns richtig. Ein engagiertes, multikulturelles und sympathisches Team heisst dich gerne im Digital Service Center an unserem Hauptstandort in Zürich willkommen. Wir freuen uns auf deine Bewerbung.<br> <br><strong>Dein neues Aufgabenfeld</strong><br><br><ul><li>Als Werkstudent:in unterstützt du uns in der Administration, Pflege und Entwicklung im Bereich \"Remote Connectivity\"</li><li>Du übernimmst Verantwortung in kleineren Projekten und Initiativen, die unsere Lösungen und Services auf das nächste Level bringen</li><li>Du unterstützt uns im technischen Support und wirst auch eigenständig Probleme lösen können</li><li>Ferner entlastest Du uns durch das Aufbereiten und Aktualisieren von Dokumenten sowie bei der Organisation der entsprechenden Ablagestruktur</li></ul><br><strong>Deine Talente und Erfahrungen</strong><br><br><ul><li>Du studierst einen technischen oder betriebswirtschaftlichen Studiengang an einer FH oder Uni oder hast ein Faible für Technik.</li><li>Du gehst Probleme als Herausforderungen an und kannst diese selbstständig lösen</li><li>Du erzielst gerne Ergebnisse und magst es, strukturiert zu arbeiten</li><li>Du bist an Standardisierung und Optimierung von Prozessen interessiert</li></ul><br><strong>Arbeitgeber- und Standortporträt </strong><br><br>Erfahre weshalb Siemens jedes Jahr zu einem der beliebtesten Arbeitgeber der Schweiz gewählt wird. Gewinne schon heute einen Einblick in dein neues Arbeitsumfeld sowie einen Eindruck deiner möglichen Kolleg:innen.<br><br>Video Siemens in Zürich<br><br>www.siemens.ch/employer<br> <br><strong>Deine Bewerbung  </strong><br><br>Wir nehmen deine Privatsphäre ernst und pflegen darum einen hohen Datenschutzstandard. Aus diesem Grund können wir deine Bewerbung ausschliesslich über unsere Bewerbungsplattform entgegennehmen (Button \"BEWERBEN\").  Antworten zu den häufigsten Fragen sowie ein Kontaktformular findest du auf unserer FAQ-Seite. Wir freuen uns auf deine Bewerbung.<br><br>Information für Personalvermittlungen: Siemens Schweiz nimmt für diese Position keine Bewerbungen von Personalvermittlungen entgegen. Wir danken für Ihr Verständnis.<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Schweiz AG<br><br><b>Experience Level:</b> Student (Not Yet Graduated)<br><br><b>Full / Part time:</b> Part-time</p>", "name": "Working Student Product Management Remote Connectivity 40-60%", "type": "external", "publication_date": "2023-05-16T23:40:22Z", "short_name": "working-student-product-management-remote-connectivity-4060", "model_type": "jobs", "id": 11382199, "locations": [{"name": "Zurich, Switzerland"}], "categories": [{"name": "Management"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/working-student-product-management-remote-connectivity-4060"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $22.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:32:15Z", "short_name": "shift-supervisor-trainee-408d46", "model_type": "jobs", "id": 14103757, "locations": [{"name": "Tinton Falls, NJ"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-408d46"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $17.25<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:45:17Z", "short_name": "store-associate-032ec1", "model_type": "jobs", "id": 13339067, "locations": [{"name": "Wildwood, FL"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-032ec1"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions. As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li><b>Required Qualifications</b><br>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Free of pending felony charges or convictions for criminal offenses involving controlled substances</li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$65.00 - $78.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Staff Pharmacist", "type": "external", "publication_date": "2024-03-17T12:47:58Z", "short_name": "staff-pharmacist-acef14", "model_type": "jobs", "id": 12835904, "locations": [{"name": "Aliso Viejo, CA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/staff-pharmacist-acef14"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br> o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br> o Actively look for ways to help people, and do so in a friendly manner<br> o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br> o Use and understand verbal and written communication to interact with customers and colleagues<br> o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br> o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br> o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br> o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br> o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:50:31Z", "short_name": "pharmacy-technician-377fe2", "model_type": "jobs", "id": 12301798, "locations": [{"name": "Palm Beach Gardens, FL"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-377fe2"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Do you want to join us in helping tofight the world's most threatening diseases and enabling access to care formore people around the world? At Siemens Healthineers, we pioneer breakthroughsin healthcare.  For everyone. Everywhere.</strong><br><br><strong>We offer you a flexible and dynamicenvironment with opportunities to go beyond your comfort zone in order to growpersonally and professionally. Sound interesting? Then come and join our globalteam as a Senior Automation Engineer/Electronic Developer to supportand improve our inhouse automation capabilities.</strong><br><br><strong>Our global team: We are a team of66,000 highly dedicated employees across more than 70 countries passionatelypushing the boundaries of what's possible in healthcare to help improvepeople's lives around the world. As a leader in the industry, we aspire tocreate better outcomes and experiences for patients no matter where they liveor what health issues they are facing. Our portfolio, spanning from in-vitroand in-vivo diagnostics to image-guided therapy and innovative cancer care, iscrucial for clinical decision-making and treatment pathways.</strong><br><br><strong>Our culture: We are part of anincredible community of scientists, clinicians, developers, researchers,professionals, and skilled specialists pushing the boundaries of what's possible,to improve people's lives around the world.  We embrace a culture ofinclusivity in which the power and potential of every individual can beunleashed. We spark ideas that lead to positive impact and continued success.Check our Careers Site at </strong><strong>https://jobs.siemens-healthineers.com/careers</strong><strong>.</strong><br><br><strong>This is a role well suited to anambitious professional, looking for the next step in their career. As a Senior AutomationEngineer/Electronic Developer, you will be responsible for</strong>:<br><br><ul> <li>Managing electrical design for     all in house CNC controls, cartesian robotics and develop future vision     guided robotic systems.</li> <li>Designing electrical control     systems, wiring schematics, panel layouts for CNC, robotics, vision,     palletizing and assembly stations.</li> <li>Implementing manufacturing     automation from concept to completion and validation</li> <li>Implementing process improvement     projects required to keep up with industry demands</li> <li>Completing and maintain all final     documentation and specifications</li> <li>Completing final verification and     validations of equipment prior to production handoff</li> <li>Working with cross-functional     teams to improve processes or implement new products</li> <li>Working with inhouse IT for data     hand offs between automation and network production tracking</li> <li>Assisting maintenance in     troubleshooting and repair</li> <li>Investigation of process defects     and driving down defect rate</li> <li>Excellent communication skills:     interpersonal, listening, oral and written</li> <li>Able to work with minimal     supervision, efficiently schedule and manage time</li> <li>Prioritize, track and process     multiple projects at the same time</li></ul><br><strong>Thisposition may suit you best if you are familiar with what is below, andwould like to develop your career with Siemens Healthineers</strong><br><br><ul> <li>PLC programing experience</li> <ul>  <li>Siemens, Allen Bradley, LabVIEW...</li> </ul> <li>Panel Wiring and Layout</li> <li>Automation Concepts</li> <ul>  <li>Palletizing</li>  <li>Pick &amp; Place</li>  <li>Vision Inspection</li>  <li>CNC Controls</li> </ul> <li>Manufacturing process improvement</li> <li>Quality System Compliance</li> <li>Cost justification analysis</li> <li>Team Coordination</li> <li>Project Management</li> <li>Capital Project Planning &amp;     Estimation</li> <li>Data Compilation &amp; Analysis</li> <li>Automation Concepts</li></ul><br><strong>Requiredskills to have for the success of this role</strong><br><br>Aqualified candidate must have demonstrated extensive technical knowledge inarea of competence including BS/BA in related discipline or equivalentcombination of education and experience.<br><br><ul> <li>Strong interpersonal and     organizational skills</li> <li>Excellent attention to detail in     the execution of job responsibilities</li> <li>Ability to accomplish multiple     tasks in fast-paced environment</li> <li>Good understanding of electrical     equipment (Control systems, UPS, RF generators), including troubleshooting     techniques</li> <li>Willing to travel up to 10%</li></ul><br>The pay range for thisposition is <strong>$90,000 - $118,000 </strong>annually; however, base pay offered mayvary depending on job-related knowledge, skills, and experience. The annualincentive target is <strong>8%</strong> of base pay.  Siemens Healthineersoffers a variety of health and wellness benefits including paid time off andholiday pay.   Details regarding our benefits can be found here<strong>:https://benefitsatshs.com/index.html</strong><br><br>At Siemens Healthineers,we value those who dedicate their energy and passion to a greater cause. Ourpeople make us unique as an employer in the med-tech industry. What unites andmotivates our global team is the inspiration of our commonpurpose:  To innovate for healthcare, building on our remarkablelegacy of pioneering ideas that translate into even better healthcare productsand services. We recognize that taking ownership of our work allows both us andthe company to grow. We offer you a flexible and dynamic environment and thespace to move beyond your comfort zone to grow both personally and professionally.<br><br><strong>Beware of Job Scams</strong><br><br>Please beware ofpotentially fraudulent job postings or suspicious recruiting activity bypersons that are currently posing as Siemens Healthineers recruiters/employees.These scammers may attempt to collect your confidential personal or financialinformation. If you are concerned that an offer of employment with SiemensHealthineers might be a scam or that the recruiter is not legitimate, pleaseverify by searching for the posting on the Siemens HealthineersCareer Site.<br><br><strong>If you want to join us intransforming the way healthcare is delivered, visit our career site at </strong>https://usa.healthcare.siemens.com/careers<strong>.</strong><br><br>If you wish to find outmore about the specific before applying, please visit: https://usa.healthcare.siemens.com/about.<br><br>As an equal-opportunityemployer we are happy to consider applications from individuals withdisabilities.<br><br>#LI-JW1<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Medical Solutions USA, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Senior Automation Engineer/Electronic Developer", "type": "external", "publication_date": "2023-05-02T23:41:19Z", "short_name": "senior-automation-engineerelectronic-developer", "model_type": "jobs", "id": 10415786, "locations": [{"name": "Alcoa, TN"}], "categories": [{"name": "Science and Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/senior-automation-engineerelectronic-developer"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br> o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br> o Actively look for ways to help people, and do so in a friendly manner<br> o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br> o Use and understand verbal and written communication to interact with customers and colleagues<br> o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br> o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br> o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br> o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br> o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:50:31Z", "short_name": "pharmacy-technician-b14540", "model_type": "jobs", "id": 12303258, "locations": [{"name": "Marlton, NJ"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-b14540"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:47:56Z", "short_name": "pharmacy-technician-9b818f", "model_type": "jobs", "id": 13052351, "locations": [{"name": "Columbus, GA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-9b818f"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health colleagues can initiate a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through myHR (1-888-694-7287, or through myLeave at myHR). If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:50:27Z", "short_name": "pharmacy-technician-76ca26", "model_type": "jobs", "id": 12491747, "locations": [{"name": "Milford, CT"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-76ca26"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Who designs your future? You do.</strong><br><br>Are you looking for a career where you can showcase your technical aptitude and passion for problem-solving to ensure your customers can work in a comfortable, safe, and energy-efficient environment? Then look to Siemens!<br> Our Culture: <br> At Siemens, we live and foster an ownership culture, in which every employee takes personal responsibility for our company's success. We trust and empower our leaders to act as owners, direct their teams, and innovate to succeed. We communicate openly and honestly to learn from our failures and celebrate our successes. We recognize individual and team achievements frequently. We invest in our team members, offering a wide variety of internal and external development opportunities.    <strong>What you will do for Siemens Smart Infrastructure:</strong> <br> Our Smart Buildings help to create efficient, safe, responsive, and responsible environments. Our aim isn't just about improving buildings; it's about creating perfect places that improve people's lives. Our Commissioning Technicians provide expertise and knowledge throughout the system or service project lifecycle on customer sites. As a Commissioning Technician, you will estimate, track, start-up and commission projects, and will be the customer interface for all technical requirements.<br><br><strong>Responsibilities:</strong><br><br><ul><li>Attend pre-booking meetings to gain knowledge of the sales estimate and project scope; analyze plans, specifications, and contract details to determine system requirements select products and determine appropriate placement to meet specifications</li><li>Develop and maintain a project schedule and coordinate needs with the project team; identify time-sensitive installation needs</li><li>Manage the requisition of supplies and materials to complete projects</li><li>Track resources and project progress</li><li>Oversee the creation of system graphics. Troubleshoot issues, including identifying and debugging software, and diagnosing electrical or pneumatic installation problems</li><li>Organize and maintain job documentation. Prepare engineering re-estimate reports</li><li>Provide on-site assistance with or perform programming, start-up, checkout, commissioning, and validation processes; participate in job site final walk-through, complete all job closeout documentation, and provide customer training</li><li>Act as technical resource to customers and field employees</li><li>Coordinate work with subcontractors</li></ul><br><strong>Qualifications:</strong><br><br><ul><li>High school diploma or state-recognized GED required; Associate degree preferred</li><li>Experience in installing and/or servicing HVAC or Building Automation Controls; 2+ years preferred</li><li>Knowledge of HVAC, mechanical systems, business operations, and job financial reports</li><li>Able to read/interpret electrical circuit diagrams</li><li>Proficient in Microsoft Office and AutoCAD</li><li>Good verbal and written communication skills in English</li><li>Qualified applicants must be legally authorized for employment in the United States without the need for employer-based sponsorship currently or in the fuure</li><li>Must be 21 years of age and possess a valid driver's license with limited violations</li></ul><br>Thisposition may support a Siemens customer who may require all employees andvendors to be fully vaccinated against COVID-19 where permitted by applicablelaw and in accordance with an accommodation based on legally protected reasons.<br><br><strong>Benefits: </strong><br><br><ul><li>Competitive salary based on qualifications</li><li>Health, dental, and vision plans with options</li><li>Matching 401(k)</li><li>Competitive paid time off plan, holidays, and floating holidays</li><li>Paid parental leave</li><li>Company cell phone and laptop</li><li>Extensive product training and professional career development</li><li>Education and tuition reimbursement programs available</li><li>Overtime, on-call pay, and company uniform and vehicle for eligible positions</li></ul><br>#LI-DRR<br><br>#RSS<br><br>Keywords:  Hvac controls, building controls,building automation, programming, field technician, heating, ventilation, airconditioning, direct digital control, apogee, desigo, modbus, tridium,controls, commissioning, lonworks, bacnet, ddc, bau, bms, building management,mechanical systems, system integration<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Mid-level Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Commissioning Technician (HVAC / Building Automation Controls) - Smart Buildings - Boston, MA", "type": "external", "publication_date": "2023-02-10T23:37:45Z", "short_name": "commissioning-technician-hvac-building-automation-controls-smart-buildings-boston-ma", "model_type": "jobs", "id": 10858182, "locations": [{"name": "Stoughton, MA"}], "categories": [{"name": "Education"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/commissioning-technician-hvac-building-automation-controls-smart-buildings-boston-ma"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}], "aggregations": {}}