{"page": 5, "page_count": 15774, "items_per_page": 20, "took": 16, "timed_out": false, "total": 315477, "results": [{"contents": "<p><strong>Real trendsetters in every language.</strong><br><br>Before our software developers write even a single line of code, they have to understand what drives our customers. What is the environment and the user story based on? Implementation means trying, testing, and improving outcomes until a final solution emerges. Knowledge means exchange discussions with colleagues from all over the world. Join our team and enjoy the freedom to think in completely new categories.<br><br>Be an integral part of a team that is developing comprehensive verification IPs for interfaces such as PCIe Gen5/Gen6, USB3.2, 400Gigabit Ethernet, DDR5, LPDDR5 and leading coherency protocols like CXL.<br><br><strong>We make real what matters.</strong><br><br><strong>This is your role.</strong><br><br><ul><li>Verification IP's help design teams find more bugs in less time than conventional simulation techniques.</li><li>You will specify, implement, test and enhance these verification components for a wide range of end user applications.</li><li>You will work on technologies involving SV, UVM, Assertions, Coverage, Test plan, BFM design, debug, and logger.</li><li>You will get along with TMEs and Field AEs or directly with customers to deploy or resolve customer issues.</li></ul><br><strong>We don't need superheroes, just super minds.</strong><br><br><ul><li>You're an Electronics Engineer (B.Tech/ M.Tech) or related field from a reputed institute</li><li>You've got phenomenal knowledge of verification engineering and have between 2 - 6 years of working experience as well.</li><li>You've sound knowhow of System Verilog for test bench with exposure to verification methodologies like UVM, VMM etc.</li><li>You've intimate knowledge of one or more standard bus protocols, like PCIe, USB, SATA, NVMe, Flash, DIMM etc.</li><li>You are a great teammate, resilient and sincere, Enjoy learning new things and build knowledge base in new area.</li></ul><br><strong>We've got quite a lot to offer. How about you</strong><br><br>This role is based in Taipei but you'll get the chance to work with teams impacting entire cities, countries - and the shape of things to come.<br><br>The pace of innovation in electronics is constantly accelerating. To enable our customers to deliver life-changing innovations to the world faster and to become market leaders, we are committed to delivering the world's most comprehensive portfolio of electronic design automation (EDA) software, hardware, and services. We, at Siemens EDA enable companies to develop better electronic products faster and more efficiently. Our innovative products and solutions help engineers conquer design challenges in the increasingly sophisticated worlds of board and chip design<br><br>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.<br><br>#DISW<br>#LI-EDA<br>#LI-Onsite<br><br>#DISW<br>#LI-EDA<br>#LI-Onsite<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Industry Software Limited, Taiwan Branch<br><br><b>Experience Level:</b> Mid-level Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "EDA - RD_Verification IP_Software Engineer", "type": "external", "publication_date": "2023-05-31T23:46:07Z", "short_name": "eda-rdverification-ipsoftware-engineer", "model_type": "jobs", "id": 11451767, "locations": [{"name": "Taipei, Taiwan"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/eda-rdverification-ipsoftware-engineer"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br>As a Clinical Support Specialist, you are critical to successfully fulfilling home infustion patients's prescriptions. In partnership with other employees, and under the supervision of a pharmacist, this role is in daily communications with patients to meet patient delivery needs, assess current condition (in non-clinical manner), validate insurance coverage, and medication supply needs.<br><br><b>Required Qualifications</b><br>Active State Pharmacy Technician License<br><br>Minimum of one year of Customer Service related experience.<br><br>Adherence To:<br>•  Regular Predicable Attendance<br>Skill In:<br>•  Verbal and written communication<br>•  Computer Programs (Word, Excel, Outlook)<br>Ability To:<br>•  Multi-task with attention to detail in a fast-paced environment<br>•  Work independently and within the clinical team<br><b>Preferred Qualifications</b><br>Minimum of one year of experience as a Customer Service Specialist within a healthcare environment or industry<br>Knowledge of:<br>•  Medical terminology<br>Skill in:<br>•  Customer Serivce and experience in home health and/or the healthcare industry<br>Physical Demands:<br>The physical demands listed below are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br>- Constant talking and hearing<br>- Constant use of hands to finger, handle or feel objects with the ability to reach with hands and arms<br>- Specific vision abilities to include close vision, peripheral vision, and the ability to adjust focus<br>- Frequent walking, standing, sitting, kneeling, and stooping<br>- Occasional lifting and/or moving up to 25 pounds<br>Work Environment:<br>The work environment characteristics listed below are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br>- Occasional exposure to toxic or caustic chemicals.<br>- Potential exposure to fumes or airborne particles.<br>Our diverse work experience empowers colleagues for career success. In addition to skill and experience, we attract and retain colleagues whose beliefs and behaviors are in alignment with our core values of collaboration, innovation, caring, integrity and accountability.<br>CVS Health is an equal opportunity/affirmative action employer. Gender/Race/Ethnicity/Disability/Protected Veteran - we highly value and are committed to all forms of diversity in the workplace. We proudly support and encourage people with military experience (active, veterans, reservists and National Guard) as well as military spouses to apply for CVS Health job opportunities. We comply with the laws and regulations set forth in the following EEO is the Law Poster: EEO IS THE LAW and EEO IS THE LAW SUPPLEMENT. We provide reasonable accommodations to qualified individuals with disabilities. If you require assistance to apply for or perform this job, please contact our Advice and Counsel Reasonable Accommodations team at AdviceCounsel@cvshealth.com.<br><br><b>Education</b><br><br>High School Diploma or General Equivalent Development (GED)<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$17.00 - $28.45<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician - Clinical Support Services", "type": "external", "publication_date": "2024-03-17T12:32:15Z", "short_name": "pharmacy-technician-clinical-support-services-036da0", "model_type": "jobs", "id": 14101546, "locations": [{"name": "Lenexa, KS"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-clinical-support-services-036da0"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br>Please replace this section with the Job Summary<br><br><b>Required Qualifications</b><br>Please replace this section with the Required Job Qualifications<br><br><b>Preferred Qualifications</b><br>Please replace this section with the Preferred Job Qualifications<br><br><b>Education</b><br>Please replace this section with the Education Requirements<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:48:00Z", "short_name": "pharmacy-technician-ede641", "model_type": "jobs", "id": 12584715, "locations": [{"name": "Endicott, NY"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-ede641"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>零碳先锋, 美丽中国!</strong><br><br><strong>西门子智能基础设施</strong><strong>(Smart Infrastructure, </strong><strong>简称</strong><strong>SI)</strong><strong>, 致力于智能地连接能源系统、楼宇和工业, 改进公众生活和工作方式。我们与客户和合作伙伴一起创造直观响应人们需求的生态系统, 帮助客户优化资源利用。</strong><br><br><strong>工作职责:</strong><br><br><ul><li>发掘及跟进客户, 及时响应客户需求, 达成业绩目标</li><li>向客户推广中低压配电元器件/成套产品及系统解决方案; </li><li>定期拜访客户并建立良好有效的长期合作关系; </li><li>为客户提供并安排技术支持及服务; </li><li>定期完成公司规定的各项报告 (如客户拜访报告、项目分析报告及客户发展计划等等) ; </li><li>制定费用预算, 控制成本。</li></ul><br><strong>任职要求:</strong><br><br><ul><li>本科及以上学历; </li><li>三年以上实战销售经验; 熟悉中低压配电产品及市场状况者优先; </li><li>热爱销售工作, 具有强烈的目标达成意识, 具有较强的项目协调能力和沟通能力; </li><li>具有敏锐的市场洞察力、业务分析能力及较强的业务推进能力; </li><li>自我驱动力强, 勇于接受挑战, 具有团队合作精神。</li></ul><br><strong>关于我们:</strong><br><br><strong>我们的销售团队, 不仅是</strong><strong>\"</strong><strong>业务开拓者</strong><strong>\"</strong><strong>, 更是</strong><strong>SI</strong><strong>的</strong><strong>\"</strong><strong>形象大使</strong><strong>\"</strong><strong>。团队掌握前沿数字化技术、产品知识、行业信息, 并以过硬的业务能力、优质的客户服务树立了评价极高的业界口碑。同时不断升级的培训体系、健全的培养机制, 能够使销售伙伴保持敏锐的市场洞察力, 善于发现市场潜在机遇, 在与客户的沟通中, 深入了解客户需求, 帮助客户发掘真正满足其需求的智能系统解决方案。</strong><br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Ltd., China<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "智慧配电销售 嘉兴", "type": "external", "publication_date": "2023-05-12T23:43:37Z", "short_name": "-5f097b", "model_type": "jobs", "id": 11365583, "locations": [{"name": "Jiaxing, China"}], "categories": [{"name": "Unknown"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/-5f097b"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Operations Manager is a member of the Store Management team, and as such, fulfills the company purpose of helping people on their path to better health by driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. Under the supervision of the Store Manager, the Operations Manager will maintain an engaged, productive store team through strong leadership, demonstrating initiative and leading by example.<br><br>The Operations Manager is responsible for supporting the Store Manager in the total leadership and strategic operation of a CVS/pharmacy store including:<ul><li>Overall store management, supervision, and policy implementation</li><li>Sales and inventory management</li><li>Employee staffing, training, and development</li><li>Financial management</li><li>Customer service leadership</li></ul>Unlike the Store Manager in Training position, the Operations Manager position is not part of the CVS/pharmacy Retail Management Development Program. Operations Managers are not eligible for direct promotion to Store Manager. Candidates with a short-term goal of becoming a CVS Store Manager should instead apply for Store Manager in Training openings.<br><br>Essential Functions:<br><br>1. Management<br><br>Lead others and work effectively with store crews<br><br>Supervise, assign and direct activities of the store's crew<br><br>Effectively communicate information to store crew and supervisors in an open and timely manner<br><br>Support Store Manager with actions plans for operational and service improvement<br><br>2. Customer Service<br><br>Assist customers with their questions, problems and complaints<br><br>Promote CVS customer service culture (greet, offer help, and thank)<br><br><b>Required Qualifications</b><ul><li>Deductive reasoning ability, advanced analytical skills and computer skills.</li><li>Advanced communication skills, leadership, supervision, and influencing skill</li><li>Ability to work a full-time flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed, and to respond to urgent issues at the store when they arise</li></ul><b>Preferred Qualifications</b><ul><li>Experience as a retail manager or supervisor</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$17.00 - $24.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Operations Manager", "type": "external", "publication_date": "2024-03-17T12:36:13Z", "short_name": "operations-manager-6b83b8", "model_type": "jobs", "id": 13823154, "locations": [{"name": "Wichita, KS"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/operations-manager-6b83b8"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br>Summary:<br>Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions.<br>As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management<br><br>A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart ΓÇô display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a ΓÇÿteam' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.Minimum Required Qualifications</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (e.g., APhA)</li><li>No pending felony charges or convictions for criminal offenses involving controlled substances.Bachelor of Science in Pharmacy or Pharm. D. degree</li><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60.00 - $73.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Staff Pharmacist FT", "type": "external", "publication_date": "2024-03-17T12:47:57Z", "short_name": "staff-pharmacist-ft-f4e48e", "model_type": "jobs", "id": 12868218, "locations": [{"name": "Manchester, NH"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/staff-pharmacist-ft-f4e48e"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Join Fortune 7 CVS Health as a Sr. Manager of Application Development within the Shared Services and Advanced Technology Delivery (SSATD) organization. As an Applications Development Senior Manager, IBM ACE Developer, you will collaborate with both full-time employees and contracted cross-functional resources to execute IT project work throughout the various phases of the SDLC for a number of initiatives that will range in size and complexity. This role will also be responsible for application stability, to maintain the corporate goals of system up-time.<br><br> Under general direction, formulates and defines system scope and objectives. Devises or modifies procedures to solve complex problems considering computer equipment capacity and limitations, operating time, and form of desired results. Designs, codes, tests, debugs, and documents those procedures. Competent to work at the highest technical level of all phases of applications systems analysis and programming activities. Regularly provides guidance and training to less-experienced programmer/analysts. <br><br><b> Fundamental Components: </b><ul><li> Independently designs and/or codes and may lead others in the development of cost-effective application and program solutions.  </li><li> Leads or acts as chief technical contributor to translation of business requirements to technical specifications.  </li><li> Leads or acts as a technical contributor in the design of new applications or enhancements including integration of purchased solutions. </li><li> Independently performs and assists other team members in providing ongoing system maintenance, research, problem resolution and on-call support tasks for existing systems.  </li><li> Is fully familiar and compliant with the efficient utilization of the prescribed methodologies and ensures compliance for the work of all aligned resources.  </li><li> Oversees or performs unit testing. </li><li> May perform or assist with integration and system testing, according to detailed test plans to ensure high-quality systems. </li><li> May assist business partners with User Acceptance Testing.  </li><li> With limited direction, supports the implementation of systems into production, including integration of purchased solutions.  </li><li> Responsible for Code Asset Management for an application or set of applications. Supports and promotes the reuse of assets across the organization.  </li><li> May lead or act as a subject matter expert for projects and/or service requests impacting an application or set of applications.  </li><li> Ability to support and lead others to develop API services utilizing onshore and offshore teams.  <br>Serves as team leader to direct technical activities, while also providing support for small and large highly complex projects that require increased skill across multiple technical environments and disciplines, that have system wide impact and that integrate across the organization. </li><li> Receives some supervision and direction as regards prioritization of work but is competent to work independently and to offer direction and oversight to assigned team.  </li><li> Understand the business and functional requirements that apply to the applications supporting a sub-domain or domain as well as their relevant interfaces. </li></ul><b>Required Qualifications</b><ul><li> 8+ years' experience in application program development, or an equivalent combination of education and work experience with at least 6+ years in strong IIB/ACE Development </li><li> 2+ years of experience with IBM Integration Bus (IIB) V10 / ACE11 </li><li> 2+ years of experience with IBM WebSphere Message Queue </li><li> Strong understanding of design and development of RESTful APIs and Web Services </li></ul><b>Preferred Qualifications</b><ul><li> IBM DB2 Database<br>Java / J2EE </li><li> Working experience in full CI/CD process (GIThub, Jenkins and Octopus) </li><li> Working experience in SAFE/Agile Methodology /Framework </li></ul><b>Education</b><br> Bachelor's Degree in Computer Science, Software Engineering or Information Technology or equivalent combination of education and experience (2 yrs experience with 2 yr Associate degree and 4 yrs experience with HS/equivalent).<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$120,750.00 - $240,000.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above.  This position also includes an award target in the company's equity award program. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies. <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Sr Mgr, IBM ACE Developer", "type": "external", "publication_date": "2024-03-17T12:47:57Z", "short_name": "sr-mgr-ibm-ace-developer-22d8a2", "model_type": "jobs", "id": 12910631, "locations": [{"name": "Hartford, CT"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/sr-mgr-ibm-ace-developer-22d8a2"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician Part Time", "type": "external", "publication_date": "2024-03-17T12:36:11Z", "short_name": "pharmacy-technician-part-time-11c43d", "model_type": "jobs", "id": 13905360, "locations": [{"name": "Marco Island, FL"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-part-time-11c43d"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Do you want to join us in helping to fight the world's mostthreatening diseases and enabling access to care for more people around theworld? At Siemens Healthineers, we pioneer breakthroughs in healthcare. Foreveryone. Everywhere.<br><br>We offer you a flexible and dynamic environment withopportunities to go beyond your comfort zone in order to grow personally andprofessionally. Sound interesting?<br><br><strong>Responsibilities</strong><strong>:</strong><br><br>Assembly &amp; Testing of components or systems according tothe Work Instruction.<br><br>按照作业指导书要求, 优质高效的完成部件或系统的装配和调试。<br><br>•              Perform In Process Quality Checkaccording to Quality Assurance Procedure to ensure Quality Target. <br><br>遵照质量保证程序实施质量检查, 确保质量目标<br><br>•              Timely Technical support andtroubleshooting on production line .<br><br>对生产线提供技术支持, 及时排除故障。<br><br>•              Documentation of testing procedure.<br><br>及时完成流程文件。<br><br>•              Continuously improve productivity,5S and EHS on shop-floor.<br><br>持续提高生产场地的工作效率、5S和EHS。<br><br>•              Other tasks assigned by leader.<br><br>  其他由上级指派的任务。<br><br><strong>Requirements</strong><strong>:</strong><br><br>&gt;1 years experience with testing /mechanical/electricalarea<br><br>1年以上测试/机械/电子方面工作经验<br><br>Diploma or Bachelor degree in medical devices, medicalequipment, testing, manufacturing etc.<br><br>大专或本科学历, 医疗仪器, 医疗设备测试或制造专业毕业<br><br>Our global team:<br><br>We are a team of 66,000 highly dedicated employees acrossmore than 70 countries passionately pushing the boundaries of what's possiblein healthcare to help improve people's lives around the world. As a leader inthe industry, we aspire to create better outcomes and experiences for patientsno matter where they live or what health issues they are facing. Our portfolio,spanning from in-vitro and in-vivo diagnostics to image-guided therapy andinnovative cancer care, is crucial for clinical decision-making and treatmentpathways.<br><br>Our culture:<br><br>We are part of an incredible community of scientists,clinicians, developers, researchers, professionals, and skilled specialistspushing the boundaries of what's possible, to improve people's lives around theworld. We embrace a culture of inclusivity in which the power and potential ofevery individual can be unleashed. We spark ideas that lead to positive impactand continued success.<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Shanghai Medical Equipment Ltd.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "SSME MI Assembly & Tester", "type": "external", "publication_date": "2023-04-05T11:52:15Z", "short_name": "ssme-mi-assembly-tester", "model_type": "jobs", "id": 11135564, "locations": [{"name": "Shanghai, China"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/ssme-mi-assembly-tester"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br>The Store Manager In Training (SMIT) job is a development focused role that is crafted to prepare you for a CVS Store Manager position.<br><br>The SMIT program is designed to enhance your career as a future store leader. We support your development towards the store manager role by participating in a self-paced, collaborative training over the span of 16 weeks.<br><br>We provide both virtual and hands on learning experiences to develop you as a leader. Our team of people, that support your growth toward your leadership career include: your District Leader, Human Resources Business Partner, Training Store Manager, and your Store Manager coach.<br><br>Some of the skills needed for this role are:<li>Communicate well verbally and in writing to support and lead your team.</li><li>Perform customer care duties to provide high levels of service.</li><li>Execute merchandising strategies to support store sales growth.</li><li>Manage the store inventory and assets to maintain profitability.<br><br>We are invested in your growth and anticipate that you will be as well. We expect our SMIT's to:</li><li>Actively engage with your leader in Key Learning Experiences to support you on your path to promotion during the structured program.</li><li>Support your store as management team member and lead in a manner that is consistent with CVS values and policies.</li><li>Engage your colleagues in support of the company's purpose of \"helping people on their path to better health.\"</li><li>Be willing to accept promotion roles with the market that you work in.<br><br>Selection for the SMIT position does not guarantee promotion into a Store Manager position. Whether and when you are actually promoted to Store Manager is dependent on a variety of factors, including but not limited to performance and availability of openings.</li><li> Willingness to accept a promotion to Store Manager role at any location in the designated market.</li><li> Ability to transfer to other CVS Pharmacy stores located within the designated market.</li><li> Ability to work a schedule that may vary based on business needs.</li><li> High School diploma or GED</li><li> Bachelor's Degree</li><li> Retail management experience, or experience as a CVS SupervisorΓÇÉ A high school diploma or GED is required. - A four year college degree is preferred, or relevant work experience may be considered in lieu of a college degree.</li><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$18.50 - $26.25<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Retail Store Manager", "type": "external", "publication_date": "2024-03-17T12:36:12Z", "short_name": "retail-store-manager-86cc48", "model_type": "jobs", "id": 13854481, "locations": [{"name": "Dedham, MA"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/retail-store-manager-86cc48"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br> <br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br> 2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $22.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:27:42Z", "short_name": "shift-supervisor-trainee-76bd93", "model_type": "jobs", "id": 14099534, "locations": [{"name": "Boston, NY"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-76bd93"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br>The Store Manager In Training (SMIT) job is a development focused role that is crafted to prepare you for a CVS Store Manager position.<br><br>The SMIT program is designed to enhance your career as a future store leader. We support your development towards the store manager role by participating in a self-paced, collaborative training over the span of 16 weeks.<br><br>We provide both virtual and hands on learning experiences to develop you as a leader. Our team of people, that support your growth toward your leadership career include: your District Leader, Human Resources Business Partner, Training Store Manager, and your Store Manager coach.<br><br>Some of the skills needed for this role are:<ul><li>Communicate well verbally and in writing to support and lead your team.</li><li>Perform customer care duties to provide high levels of service.</li><li>Execute merchandising strategies to support store sales growth.</li><li>Manage the store inventory and assets to maintain profitability.</li></ul>We are invested in your growth and anticipate that you will be as well.  We expect our SMIT's to:<ul><li>Actively engage with your leader in Key Learning Experiences to support you on your path to promotion during the structured program.</li><li>Support your store as management team member and lead in a manner that is consistent with CVS values and policies.</li><li>Engage your colleagues in support of the company's purpose of \"helping people on their path to better health.\"</li><li>Be willing to accept promotion roles with the market that you work in.</li></ul>Selection for the SMIT position does not guarantee promotion into a Store Manager position.  Whether and when you are actually promoted to Store Manager is dependent on a variety of factors, including but not limited to performance and availability of openings.<ul><li>Willingness to accept a promotion to Store Manager role at any location in the designated market.</li><li>Ability to transfer to other CVS Pharmacy stores located within the designated market.</li><li>Ability to work a schedule that may vary based on business needs.</li><li>High School diploma or GED</li><li>Bachelor's Degree</li><li>Retail management experience, or experience as a CVS SupervisorΓÇÉ A high school diploma or GED is required.</li></ul>- A four year college degree is preferred, or relevant work experience may be considered in lieu of a college degree.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$18.50 - $26.25<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 05/13/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Manager in Training", "type": "external", "publication_date": "2024-03-17T12:15:37Z", "short_name": "store-manager-in-training-92f80f", "model_type": "jobs", "id": 14357502, "locations": [{"name": "Peabody, MA"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-manager-in-training-92f80f"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary:<br>Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions.<br>As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management<br><br>A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li><b>Required Qualifications</b><br>Minimum Required Qualifications</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (e.g., APhA)</li><li>No pending felony charges or convictions for criminal offenses involving controlled substances</li><li><b>Preferred Qualifications</b><br><br><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60.00 - $73.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Staff Pharmacist FT", "type": "external", "publication_date": "2024-03-17T12:39:34Z", "short_name": "staff-pharmacist-ft-9e643d", "model_type": "jobs", "id": 13754744, "locations": [{"name": "Upper Saddle River, NJ"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/staff-pharmacist-ft-9e643d"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:15:35Z", "short_name": "pharmacy-technician-e987f5", "model_type": "jobs", "id": 14393328, "locations": [{"name": "Cambridge, MA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-e987f5"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Who designs your future? You do.</strong><br><br>Are you looking for a career where you can showcase your technical aptitude and passion for problem-solving to ensure your customers can work in a comfortable, safe, and energy-efficient environment? Then look to Siemens!<br><br><strong>Our Culture: </strong><br><br>At Siemens, we live and foster an ownership culture, in which every employee takes personal responsibility for our company's success. We trust and empower our leaders to act as owners, direct their teams, and innovate to succeed. We communicate openly and honestly to learn from our failures and celebrate our successes. We recognize individual and team achievements frequently. We invest in our team members, offering a wide variety of internal and external development opportunities.<br><br><strong>What you will do for Siemens Smart Infrastructure:</strong> <br><br>Our Associate Project Managers coordinate and deliver multiple, simultaneous Building Automation projects of various complexities. The Associate Project Manager has fiscal responsibility for all project facets, including project billing, job cost reporting, and overall customer satisfaction.<br><br><strong>Responsibilities:</strong><br><br><ul><li>Review project specifications, drawings and project-specific documents to establish project intent</li><li>Develop and maintain a project schedule and coordinate needs with the project team; identify time-sensitive installation needs</li><li>Manage the requisition of supplies and materials to complete projects</li><li>Review plans and specifications and participate in project cost reviews</li><li>Conduct an orientation for project technicians and provide all necessary project documentation, including scope of work, drawings, applicable specifications, application-engineered drawings, project contacts, etc.</li><li>Track resources and project progress</li><li>Document project events that impact the schedule, scope of work, and project efficiency</li><li>Pursue project-specific change-order opportunities</li><li>Coordinate and pursue project-specific billing; coordinate with Accounting team and Operations Manager</li><li>Schedule project-specific commissioning resources and provide commissioning documentation</li><li>Expedite the return of project-specific mark-ups for as-built development</li><li>Complete project-specific close-out documentation</li></ul><br><strong>Qualifications:</strong><br><br><ul><li>Associate or Bachelor's Degree in Mechanical or Electrical Engineering preferred, however, candidates with at least a High School Diploma or state-recognized GED, will also be considered</li><li>Project management experience in the HVAC controls industry; 3+ years preferred</li><li>Knowledge and understanding of HVAC industry applications; ability to read and understand MEP drawings and specifications, and electrical, network, and control wiring diagrams</li><li>Knowledge of industry-standard communication protocols such as Ethernet, Modbus, and BACnet preferred</li><li>Ability to work in a team environment providing dedicated support to our customers</li><li>Proficient in Microsoft Office and Microsoft Project</li><li>Good verbal and written communication skills in English</li><li>Scheduling and organizational skills are required</li><li>Qualified applicants must be legally authorized for employment in the United States without the need for employer-based sponsorship currently or in the future</li><li>Must be 21 years of age and possess a valid driver's license with limited violations</li></ul><br><strong>Benefits:</strong><br><br><ul><li>Competitive salary based on qualifications</li><li>Health, dental, and vision plans with options</li><li>Matching 401(k)</li><li>Competitive paid time off plan, holidays, and floating holidays</li><li>Paid parental leave</li><li>Company cell phone and laptop</li><li>Extensive product training and professional career development</li><li>Education and tuition reimbursement programs available</li><li>Overtime, on-call pay, and company uniform and vehicle for eligible positions</li></ul><br>#LI-DRR<br><br>#RSS<br><br>Keywords: Hvac controls, building controls,building automation, programming, field technician, heating, ventilation, airconditioning, direct digital control, apogee, desigo, modbus, tridium, alerton,controls, commissioning, lonworks, bacnet, ddc, bau, bms, building management,mechanical systems, system integration<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Associate Project Manager (Building Automation Controls) - Boston, MA", "type": "external", "publication_date": "2023-04-05T11:52:16Z", "short_name": "associate-project-manager-building-automation-controls-boston-ma-144aa7", "model_type": "jobs", "id": 11135424, "locations": [{"name": "Woburn, MA"}], "categories": [{"name": "Project Management"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/associate-project-manager-building-automation-controls-boston-ma-144aa7"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>Do you want to join us in helping to fight the world'smost threatening diseases and enabling access to care for more people aroundthe world? At Siemens Healthineers, we pioneer breakthroughs inhealthcare.  For everyone. Everywhere. </strong><br><br>At SiemensHealthineers, we offer you a flexible and dynamic environment withopportunities to go beyond your comfort zone in order to grow personally andprofessionally. Sound interesting? Then come and join our global team as <strong>CT</strong><strong>Product SalesSpecialist, Computed Tomography</strong> toassist account executives in the sales process withinthe computed tomography product line including Diagnostic and Oncology products. <br><br><strong>Our globalteam</strong><strong>:</strong> We are a team of more than 69,000 highly dedicatedemployees across more than 70 countries passionately pushing the boundaries ofwhat's possible in healthcare to help improve people's lives around the world.As a leader in the industry, we aspire to create better outcomes andexperiences for patients no matter where they live or what health issues theyare facing. Our portfolio, spanning from in-vitro and in-vivo diagnostics toimage-guided therapy and innovative cancer care, is crucial for clinical decision-makingand treatment pathways. <br><br><strong>Our culture</strong><strong>:</strong> We are partof an incredible community of scientists, clinicians, developers, researchers,professionals, and skilled specialists pushing the boundaries of what'spossible, to improve people's lives around the world.  We embrace a culture of inclusivity in whichthe power and potential of every individual can be unleashed. We spark ideasthat lead to positive impact and continued success. Check our Careers Site at https://jobs.siemens-healthineers.com/careers<br><br>This is a role well suited to an ambitious professional,looking for the next step in their career. As a <strong>CT Product Sales Specialist,</strong>you will be responsible for:<br><br><ul><li>SupportingSiemens Account Manager during sales process: before, during and after the sale</li><li>Assistingaccount manager in preparing and reviewing quote configurations in response toRFPs and technical RFP questionnaires</li><li>Helping Applications personnel and Field service personnel in     resolving customer product related issues and training</li><li>Presentingsolutions for RFPs and Education sessions</li><li>Delivering workstation demonstrations capability</li><li>Preparing,coordinate, and perform clinical site visits during sales process</li><li>Havingfrequent interaction withradiologists, Technologists, Physicists and Administrators</li><li>Interactingwith business units (Factory) product management/ participation in trade showsas sales support</li><li>PreparingPower Point presentations and adapt for specific customer needs and clinicalsituation</li><li>Beinga co-operative, team-oriented individual who takes strong accountability</li></ul><br>This positionmay suit you best if you are experienced with what is below and would like to further develop your career withHealthineers.<br><br><ul><li>Proficiencyin both Diagnostic and Oncology CT imaging modalities</li><li>Havea comprehensive clinical and technical knowledge in CT and Syngo products</li><li>Possessa Clinical background and understands customer clinical needs and explainproposed solutions</li><li>Self-motivatedindividual able to takes initiative and works independently</li><li>Co-operative,team-oriented individual who takes strong accountability</li></ul><br>Required skills to have for the success of this role include:<br><br><ul><li>Graduate of an accredited Medical Radiation TechnologyProgram</li><li>CAMRT or OTIMROEPMQ Certified</li><li>Minimum5 years industry experience in CT Imaging</li><li>Applicationsand clinical training experience (Diagnostics and Oncology)</li><li>Experiencedin sales and business development</li><li>Able to travel within Canada (approx. 25-40%) and on occasion     internationally (Mainly USA and Europe)</li><li>Bilingual(English/French - is an asset)</li></ul><br>While weappreciate all applications we receive, we advise that only candidates underconsideration will be contacted.<br><br>In ourcontinued commitment to prioritize colleague health, comply withcustomer/business partner requirements, and help preserve our businesscontinuity, Siemens Healthineers requires employees, contractors, and businesspartners to be fully vaccinated with relevant dose(s) of a Health Canadaapproved vaccine for all new hires by their start date. \"Fully vaccinated\"means it has been 14 days after receiving the full series of a COVID-19 vaccineor combination of COVID-19 vaccines approved by Health Canada (i.e. two dosesof a two-dose vaccine series, or one dose of a single-dose vaccine series), andwhich may include, at the Company's discretion, any further doses in accordancewith Health Canada guidelines. Exemptions will only be granted for medicalreasons or on the basis of a protected ground under applicable human rightslegislation.<br><br>At SiemensHealthineers, we value those who dedicate their energy and passion to a greatercause. Our people make us unique as an employer in the med-tech industry. Whatunites and motivates our global team is the inspiration of our commonpurpose:  To innovate for healthcare,building on our remarkable legacy of pioneering ideas that translate into evenbetter healthcare products and services. We recognize that taking ownership ofour work allows both us and the company to grow. We offer you a flexible anddynamic environment and the space to move beyond your comfort zone to grow bothpersonally and professionally.<br><br>If you wantto join us in transforming the way healthcare is delivered, visit our careersite at<strong>: </strong>https://jobs.siemens-healthineers.com/careers<br><br>If you wishto find out more about the specific division before applying, please visit: <br><br>https://www.siemens-healthineers.com/en-ca/about<br><br><strong>Beware of JobScams</strong><br><br>Please bewareof potentially fraudulent job postings or suspicious recruiting activity bypersons that are currently posing as Siemens Healthineers recruiters/employees.These scammers may attempt to collect your confidential personal or financialinformation. If you are concerned that an offer of employment with SiemensHealthineers might be a scam or that the recruiter is not legitimate, pleaseverify by searching for the posting on the Career site: https://jobs.siemens-healthineers.com/careers<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Healthcare Limited<br><br><b>Experience Level:</b> Mid-level Professional<br><br><b>Full / Part time:</b> Full-time<br><br>Siemens is committed to creating a diverse environment and is proud to be an equal opportunity employer. Upon request, Siemens Canada will provide reasonable accommodation for disabilities to support participation of candidates in all aspects of the recruitment process. All qualified applicants will receive consideration for employment.<br><br><b>By submitting personal information to Siemens Canada Limited or its affiliates, service providers and agents, you consent to our collection, use and disclosure of such information for the purposes described in our Privacy Code available at www.siemens.ca.</b><br><br>Siemens s'engage à créer un environnement diversifié et est fière d'être un employeur souscrivant au principe de l'égalité d'accès à l'emploi. Sur demande, Siemens Canada prendra des mesures d'accommodement raisonnables pour les personnes handicapées, dans le but de soutenir la participation des candidats dans tous les aspects du processus de recrutement. Tous les candidats qualifiés seront pris en considération pour ce poste.<br><br><b>En transmettant des renseignements personnels à Siemens Canada limitée ou à ses sociétés affiliées, à ses fournisseurs de services ou à ses agents, vous nous autorisez à recueillir, à utiliser et à divulguer ces renseignements aux fins prévues dans notre Code de protection de la confidentialité, que vous pouvez consulter au www.siemens.ca.</b></p>", "name": "Product Sales Specialist - Computed Tomography", "type": "external", "publication_date": "2023-05-19T23:38:55Z", "short_name": "product-sales-specialist-computed-tomography-7a3cb0", "model_type": "jobs", "id": 11404041, "locations": [{"name": "Oakville, Canada"}], "categories": [{"name": "Sales"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/product-sales-specialist-computed-tomography-7a3cb0"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Summary: Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions. As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management<br><br>A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li><b>Required Qualifications</b><br>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Free of pending felony charges or convictions for criminal offenses involving controlled substances</li><li><b>Education</b> - Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60.00 - $73.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Dist Suppt Pharmacist PT", "type": "external", "publication_date": "2024-03-17T12:32:15Z", "short_name": "dist-suppt-pharmacist-pt-6aaa29", "model_type": "jobs", "id": 14102678, "locations": [{"name": "Boulder City, NV"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/dist-suppt-pharmacist-pt-6aaa29"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br>The Store Manager In Training (SMIT) job is a development focused role that is crafted to prepare you for a CVS Store Manager position.<br><br>The SMIT program is designed to enhance your career as a future store leader. We support your development towards the store manager role by participating in a self-paced, collaborative training over the span of 16 weeks.<br><br>We provide both virtual and hands on learning experiences to develop you as a leader. Our team of people, that support your growth toward your leadership career include: your District Leader, Human Resources Business Partner, Training Store Manager, and your Store Manager coach.<br><br>Some of the skills needed for this role are:<ul><li>Communicate well verbally and in writing to support and lead your team.</li><li>Perform customer care duties to provide high levels of service.</li><li>Execute merchandising strategies to support store sales growth.</li><li>Manage the store inventory and assets to maintain profitability.</li></ul>We are invested in your growth and anticipate that you will be as well.  We expect our SMIT's to:<ul><li>Actively engage with your leader in Key Learning Experiences to support you on your path to promotion during the structured program.</li><li>Support your store as management team member and lead in a manner that is consistent with CVS values and policies.</li><li>Engage your colleagues in support of the company's purpose of \"helping people on their path to better health.\"</li><li>Be willing to accept promotion roles with the market that you work in.</li></ul>Selection for the SMIT position does not guarantee promotion into a Store Manager position.  Whether and when you are actually promoted to Store Manager is dependent on a variety of factors, including but not limited to performance and availability of openings.<ul><li>Willingness to accept a promotion to Store Manager role at any location in the designated market.</li><li>Ability to transfer to other CVS Pharmacy stores located within the designated market.</li><li>Ability to work a schedule that may vary based on business needs.</li><li>High School diploma or GED</li><li>Bachelor's Degree</li><li>Retail management experience, or experience as a CVS SupervisorΓÇÉ A high school diploma or GED is required.</li></ul>- A four year college degree is preferred, or relevant work experience may be considered in lieu of a college degree.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$18.50 - $28.67<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 04/30/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Manager in Training", "type": "external", "publication_date": "2024-03-17T12:22:26Z", "short_name": "store-manager-in-training-bc8aa8", "model_type": "jobs", "id": 14316080, "locations": [{"name": "Bluffton, SC"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-manager-in-training-bc8aa8"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>An Operations Supervisor is a key leader supporting the CVS Store Management team in planning and driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor leads the store and supervisory staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br><br>1. Management<ul><li>Work effectively with store management and store crews</li></ul><ul><li>Supervise the store's crew through assigning, directing and following up of all</li></ul>activities<ul><li>Effectively communicate information both to and from store management and crews</li></ul>2. Customer Service<ul><li>Assist customers with their questions, problems and complaints</li></ul><ul><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li></ul><ul><li>Handle all customer relations issues in accordance with company policy</li></ul>and promote a positive shopping experience for all CVS customers<br><br>Provide colleagues personalized customer service feedback and coaching (E.g., myImpact coaching; myCustomer feedback; personal observations)<ul><li>Maintain customer/patient confidentiality</li></ul>3. Merchandise/Presentation<ul><li>Price merchandise</li></ul><ul><li>Stock shelves</li></ul><ul><li>Support the planning, execute the displays, sign and inventory of weekly,</li></ul>promotional, and seasonal merchandise<ul><li>Support the planning, execute the display and maintenance of off-shelf merchandise</li></ul><b>Required Qualifications</b><ul><li>Deductive reasoning ability, analytical skills and computer skills.</li><li>Advanced communication skills, supervision, and influencing skills</li><li>Ability to work a full-time flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed, and to respond to urgent issues at the store when they arise</li></ul><b>Preferred Qualifications</b><ul><li>Experience as a retail supervisor</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.25 - $22.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Operations Supervisor", "type": "external", "publication_date": "2024-03-17T12:39:34Z", "short_name": "operations-supervisor-e8b7b0", "model_type": "jobs", "id": 13755122, "locations": [{"name": "San Rafael, CA"}], "categories": [{"name": "Business Operations"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/operations-supervisor-e8b7b0"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li></li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $22.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:27:43Z", "short_name": "shift-supervisor-trainee-50bae0", "model_type": "jobs", "id": 14101346, "locations": [{"name": "Miami, FL"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-50bae0"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}], "aggregations": {}}