{"page": 9, "page_count": 15774, "items_per_page": 20, "took": 16, "timed_out": false, "total": 315477, "results": [{"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:22:28Z", "short_name": "pharmacy-technician-31d695", "model_type": "jobs", "id": 14177829, "locations": [{"name": "Lake Worth, TX"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-31d695"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:22:27Z", "short_name": "shift-supervisor-trainee-5982fb", "model_type": "jobs", "id": 14301830, "locations": [{"name": "Atlanta, IL"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-5982fb"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.00 - $19.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:42:24Z", "short_name": "store-associate-cccafe", "model_type": "jobs", "id": 13628640, "locations": [{"name": "Fishkill, NY"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-cccafe"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.90 - $16.90<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:45:17Z", "short_name": "pharmacy-technician-ec9c0a", "model_type": "jobs", "id": 13340196, "locations": [{"name": "Lancaster, CA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-ec9c0a"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:22:26Z", "short_name": "pharmacy-technician-269c30", "model_type": "jobs", "id": 14316279, "locations": [{"name": "Baltimore, MD"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-269c30"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>产品创建者</strong><strong>-</strong><strong>软件工程师</strong><br><br><strong>如果你真的想有所作为</strong><strong>-请与我们一起努力</strong><br><br>数字产业部门提供了一整套无缝集成的硬件, 以软件和技术为基础的服务, 以支持世界各地的制造公司提高其制造过程的灵活性和效率, 缩短其产品的上市时间--无论是汽车或航空航天行业、机械工程还是其他有趣的行业。<br><br><strong>您在新角色中的使命</strong><strong>:</strong><br><br>与我们敏捷开发团队中的不同工程师合作, 为西门子HMI产品设计、实施、维护、增强、测试、调试和支持工程师平台, 您将为人与机器之间的微自动化生态系统开发迷人的\"新窗口\"。<br><br><strong>您的新角色</strong><strong>-</strong><strong>具有挑战性且面向未来</strong><br><br>1.     通过了解客户价值, 您将与其他工程师一起制定新一代HMI产品的软件设计概念和计划。<br><br>2.     你将成为一个全新的、有趣的、创新的、多元化的国际团队的一员 (中国、德国、土耳其、印度) <br><br>3.     您需要估计自己的工作包的成本和工作量, 以适当的方式独立实施工作包, 平衡成本、进度和质量, 持续改进以更好地解决项目中的问题。<br><br>4.     您需要在整个PLM过程中实施软件编码、测试、调试、问题解决和报告。<br><br>5.     您参与在配置管理工程师支持下建立的开发环境。<br><br>6.     您还与测试工程师合作, 以实现更多自动化测试设置。<br><br>7.     除了开发人员的角色外, 您还可以在架构思考、DevOps解决方案或将来作为Scrum大师担任其他职能。<br><br>8.     你喜欢不断地学习和与团队成员分享, 不怕提出新想法。<br><br>9.    你有记录结果的良好习惯, 并将高质量的输出转移到过程的下一阶段。<br><br><strong>你的资历</strong><strong>--</strong><strong>确定且适当</strong><br><br>1大学本科以上学历, 计算机、信息学、自动化、数学、物理、工程科学等专业毕业。<br><br>2.具有良好的逻辑思维和良好的软件调试技能。<br><br>3.您必须在软件开发或系统集成方面具有4年以上的专业经验。<br><br>4.具备在Microsoft.NET, C#方面的专业技能。<br><br>5.有2年以上Winform、WPF或者Web软件开发经验, 做过较大型软件开发。<br><br>6.有C++开发经验者优先<br><br>7.有良好的UI/UX设计经验者优先。<br><br>8.良好的沟通能力 (口头和书面) , 对新技术和新趋势有快速的学习能力。<br><br>9.英语流利。<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Ltd., China<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "FA西门子 成都研发中心 软件开发工程师-C#/WPF", "type": "external", "publication_date": "2023-04-06T23:49:29Z", "short_name": "fa-cwpf", "model_type": "jobs", "id": 10994769, "locations": [{"name": "Chengdu, China"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/fa-cwpf"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<div><p>SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars.</p></div>\n\n<div>\n<p><strong>SR. MECHANICAL ENGINEER, CONSUMER HARDWARE (STARLINK)</strong> </p>\n</div>\n\n<div>\n<div>At SpaceX we’re leveraging our experience in building rockets and spacecraft to deploy Starlink, the world’s most advanced broadband internet system. Starlink is the world’s largest satellite constellation and is providing fast, reliable internet to 2M+ users worldwide. We design, build, test, and operate all parts of the system – thousands of satellites, consumer receivers that allow users to connect within minutes of unboxing, and the software that brings it all together. We’ve only begun to scratch the surface of Starlink’s potential global impact and are looking for best-in-class engineers to help maximize Starlink’s utility for communities and businesses around the globe.</div>\n</div>\n\n<div>\n<p>Starlink Mechanical &amp; Design Engineers in our Austin facilities are hyper-focused on the high-volume consumer products that we ship directly to customers all over the world. We design this hardware to be both technically sophisticated and easy to use. Our customers currently include teachers in the most remote parts of the Amazon, researchers in Antarctica, digital nomads who travel via RV, emergency responders, commercial airlines, cruise lines, and residential users who live in more rural or developing areas. As a member of this team, you will lead creative, multi-disciplinary projects that include designing both the consumer products themselves and the factories that manufacture them, ushering in the next era of the internet, and delivering internet to those that need it most. </p>\n</div>\n\n<div>\n<div>\n<p><strong>RESPONSIBILITIES:</strong> </p>\n</div>\n<div>\n<ul>\n<li>Own Starlink consumer hardware from conceptual design through high volume production and public launch </li>\n<li>Develop design criteria, collaborate on requirements, and drive system-level optimization </li>\n<li>Test and iterate on products to enable high field reliability and performance in all environments and use cases</li>\n<li>Design and develop the production lines that manufacture your product, including robot end effector design, process development, control system design, automation programming, and more</li>\n<li>Refine the production system to create high-rate, high-yield, and reliable processes</li>\n<li>Establish an efficient product lifecycle starting in the supply chain all the way through final integration that balances cost, complexity, and quality; work closely with partner teams to design and realize an efficient in-house production line </li>\n</ul>\n</div>\n</div>\n\n<div>\n<div>\n<p><strong>BASIC QUALIFICATIONS:</strong> </p>\n</div>\n</div>\n\n<div>\n<div>\n<ul>\n<li>Bachelor's degree in an engineering discipline </li>\n<li>Experience with CAD and FEA software packages </li>\n<li>5+ years of experience with mechanical/electromechanical design, analysis, testing, and/or manufacturing </li>\n</ul>\n</div>\n<div>\n<p><strong>PREFERRED SKILLS AND EXPERIENCE:</strong> </p>\n</div>\n</div>\n\n<div>\n<ul>\n<li>Master’s degree in engineering or a related technical discipline </li>\n<li>3+ years of professional experience in mechanical design and analysis</li>\n<li>2+ years of hands-on project experience with complex mechanical systems, preferably as a team lead</li>\n<li>Proficient in 3D CAD (NX preferred)</li>\n<li>Solid understanding and application of GD&amp;T, mechanical engineering fundamentals, structural analysis, and failure modes of complex mechanical systems</li>\n<li>Prior ownership of a complex component or assembly from initial design through high-volume production ramp</li>\n<li>Familiarity with manufacturing processes and how to design for manufacturability</li>\n<li>Exposure to some variety of production machinery, industrial sensors, and equipment (motion systems, dispense systems, temperature controllers, laser distance sensors, injection molders, die casters, etc.)</li>\n<li>Self-motivated with strong organizational, written, and oral communication skills</li>\n</ul>\n</div>\n\n<div>\n<div>\n<p><strong>ADDITIONAL REQUIREMENTS:</strong> </p>\n</div>\n<div>\n<ul>\n<li>\n<p>Ability to work long hours and weekends as necessary to support critical milestones </p>\n</li>\n</ul>\n</div>\n</div>\n\n<div>\n<p><strong>COMPENSATION AND BENEFITS:             </strong> </p>\n</div>\n\n<div>Pay range:     </div>\n\n<div>Mechanical Engineer/Senior: $125,000.00 - $175,000.00/per year</div>\n\n<div> </div>\n\n<div>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience. </div>\n\n<div>\n<p>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short and long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation and will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year. </p>\n</div>\n\n<div><p><strong>ITAR REQUIREMENTS:</strong></p>\n<ul>\n<li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C. § 1157, or (iv) Asylee under 8 U.S.C. § 1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR <a href=\"https://www.pmddtc.state.gov/?id=ddtc_kb_article_page&amp;sys_id=24d528fddbfc930044f9ff621f961987\">here</a>.  </li>\n</ul>\n<p>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.</p>\n<p>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should notify the Human Resources Department at (310) 363-6000.</p></div>", "name": "Sr. Mechanical Engineer, Consumer Hardware (Starlink)", "type": "external", "publication_date": "2024-02-27T23:05:48Z", "short_name": "sr-mechanical-engineer-consumer-hardware-starlink-599af2", "model_type": "jobs", "id": 14126481, "locations": [{"name": "Lockhart, TX"}], "categories": [{"name": "Science and Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/spacex/sr-mechanical-engineer-consumer-hardware-starlink-599af2"}, "company": {"id": 15000190, "short_name": "spacex", "name": "SpaceX"}}, {"contents": "<p>Digitalizace představuje pro mnoho společností velké výzvy a v nadcházejících letech velmi pozmění procesy. To je také případ společnosti Siemens Mobility - jako IT Solution Expert budete aktivně pomáhat formovat a provázet projekt transformace Siemens Teamcenter. Projekt se řídí podle metodiky SAFe.<br> <br><strong>Klíčové zodpovědnosti:</strong><br><br><ul><li>Budete zodpovídat za Release Management komplexních IT požadavků a projektů</li><li>Organizovat příslušné release-verze, popisovat funkční rozsah a provádět nezbytné systémové a integrační testy, vypracovávat dokumentaci a sdílet své výsledky s kolegy</li><li>Vytváření plánů a reportů o stavu release</li><li>Plánování a koordinování globálních zaváděných release verzí</li><li>Poskytování aplikační a procesní podpory, aby byly zajištěny efektivní a harmonické obchodní procesy a struktury</li><li>Zlepšování procesů softwaru, včetně časových úseků a zvyšování stupně automatizace</li><li>Jako týmový hráč budete pracovat ruku v ruce s příslušnými odbornými odděleními a zahraničními kolegy a také externími poskytovateli služeb a pravidelně s nimi koordinovat různorodá témata/úkoly</li></ul><br><strong>Požadavky:</strong><br><br><ul><li>VŠ vzdělání technického směru zaměřené na informatiku, obchodní informatiku nebo jiný srovnatelný obor</li><li>Praktické zkušenosti s klasickými a agilními metodami projektového managementu</li><li>Mnohaleté odborné znalosti jako specialista na IT řešení v Release-Managementu, ideálně v prostředí Teamcenter</li><li>Plynulou angličtinu, němčina výhodou</li><li>Zkušenosti se spoluprací v globálních týmech, ideálně s odborným vedením/řízením zaměstnanců</li><li>Umíte pracovat strukturovaně a samostatně s orientací na hledání řešení, umíte komunikovat a jste týmový hráč</li><li>Ochota vyjíždět na služební cesty</li></ul><br><strong>Na co se u nás můžete těšit:</strong><br><br><ul><li>Až 33 dní dovolené/rok</li><li>Flexibilní pracovní dobu (pevné jádro 10-14 hod.)</li><li>Firemní mateřskou školku v blízkosti pracoviště v Praze</li><li>Možnost pracovat z domova pro lepší skloubení práce a osobního života (v případě práce z domova příspěvek 100 Kč/den)</li><li>Osobní roční rozpočet ve výši 24 000 Kč nebo 48 000 Kč (dle seniority), který můžete využít na různé např. volnočasové aktivity v naší cafeterii</li></ul><br>A to není vše. Co víc můžeme nabídnout? Klikněte sem: https://mobility.siemens.cz/jobs/cs/firemni-benefity/.<br> <br>Kde najdete naše kanceláře? V blízkosti metra Stodůlky v Praze.<br> <br>Chcete se stát součástí Siemens Mobility a nemáte připravené CV nebo Vám chybí více informací? Kontaktujte mě na zuzana.trubacova@siemens.com nebo přes LinkedIn www.linkedin.com/in/zuzana-trubacova. Ráda si Vás přidám do sítě kontaktů i pro případnou budoucí spolupráci!<br> <br>#LI-ZT1<br><br>#LI-Hybrid<br><br><b>Organizační jednotka:</b> Siemens Mobility<br><br><b>Společnost:</b> Siemens Mobility, s.r.o.<br><br><b>Úroveň zkušeností:</b> Zkušený profesionál<br><br><b>Plný/částečný úvazek:</b> Na plný úvazek</p>", "name": "IT Solution Expert - Release Management", "type": "external", "publication_date": "2023-05-03T23:46:10Z", "short_name": "it-solution-expert-release-management-45de94", "model_type": "jobs", "id": 11291220, "locations": [{"name": "Prague, Czech Republic"}], "categories": [{"name": "Unknown"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/it-solution-expert-release-management-45de94"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br>Health is everything. At CVS Health, colleagues are committed to increasing access, lowering costs and improving quality of care. Millions of times a day, we help people on their path to better health-from advising on prescriptions to helping manage chronic and specialty conditions. As a Staff Pharmacist, you have a critical role at the forefront of delivering our purpose, modeling our values, and demonstrating genuine, authentic care for our patients. In addition to supporting the Pharmacy Manager in leading and directing your Pharmacy Technician Support Staff, you are accountable for supporting the management, oversight and operation of all aspects within your pharmacy. This includes:<ul><li>Patient Safety</li><li>Pharmacy Professional Practice</li><li>Regulatory Requirements</li><li>Quality Assurance</li><li>Customer Service</li><li>Personnel Management</li><li>Inventory Management</li><li>Financial Profitability</li><li>Loss Prevention</li><li>Workflow Management A key component of the Staff Pharmacist role is keeping your customers and patients healthy through adoption and management of patient care programs. Additionally, you will:</li><li>Lead with Heart - display empathy and compassion for your patients, customers, caregivers and colleagues on your team</li><li>Motivate, inspire and develop your Pharmacy Support Staff by balancing assignments that maximize colleagues' strengths, address development opportunities and decrease knowledge gaps</li><li>Identify critical business opportunities and contribute to the development of meaningful solutions to drive growth and improve performance in your pharmacy</li><li>Successfully implement those solutions by leading your team to achieve specified goals</li><li>Adapt to change and adjust plans to thrive in a dynamic community healthcare setting</li><li>Seek new ways to grow, collaborate with others and deliver better outcomes</li><li>Align others around purpose to gain support and commitment</li><li>Actively contribute to a 'team' culture that promotes caring, energy, enthusiasm and pride</li><li>Apply acquired knowledge to help drive healthy outcomes and differentiate CVS from competitors</li><li>The above represents a summary of the functions of a Staff Pharmacist. Additional functions and physical requirements are available on the full job description.</li><li><b>Required Qualifications</b><br>Minimum Required Qualifications:</li><li>Active Pharmacy License in the state in which you are employed</li><li>Not on the DEA Excluded Parties List</li><li>Immunization Certification through an accredited organization (i.e. APhA)</li><li>Free of pending felony charges or convictions for criminal offenses involving controlled substances</li><li><b>Education</b><br>Bachelor of Science in Pharmacy or Pharm. D. degree</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$65.00 - $78.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 07/31/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "CA Staff Pharmacist - FT - Rohnert Park", "type": "external", "publication_date": "2024-03-17T12:15:36Z", "short_name": "ca-staff-pharmacist-ft-rohnert-park", "model_type": "jobs", "id": 14370094, "locations": [{"name": "Rohnert Park, CA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/ca-staff-pharmacist-ft-rohnert-park"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br>Acts as the primary resource for assigned, high profile providers and/or groups (i.e. local, individual providers, small groups/systems) to establish, oversee, and maintain positive relationships by assisting with or responding to complex issues regarding Medicaid policies and procedures, plan design, contract language, service, claims or compensation issues, and provider education needs.<ul><li>Research and handle contract related issues (ability to research and deep dive). </li><li>Claims research related to provider set up issues, payment resolutions and coordinate with Claims SME</li><li>Provider visits onsite, virtual, and telephonic </li><li>Facilitate JOCs and webinars</li><li>Provider orientations/visits</li><li>Provider training</li><li>State projects</li><li>Create and manage provider-facing communications: newsletters, website updates, provider manual, email/fax blast</li><li>Collaborates w/ Quality Management and VBS team to assist w/ facilitation of provider request to enhance quality metrics and relationship building</li><li>Coordinate with Network Management to issue provider CAP</li><li>Monitor Grievances according NCQA standards categories (3 grievances per QTR), including progressive corrective action</li><li>Monitor provider performance in accordance with provider responsibilities policy, contract, state and federal requirements</li><li>Attend Plan committee meetings, as needed</li><li>Recredentialing non-responder follow up</li><li>Communicate growth partner response to providers</li><li>Manage IPA provider rosters, submit to MPOS</li><li>Document visits/encounters in the appropriate systems (CRM)</li><li>Travel within Market</li><li>Other duties as assigned</li></ul><b>Required Qualifications</b><br><br>- 3+ years' experience in Medicaid Managed Care<br>business segment environment servicing providers with<br>exposure to benefits and/or contract interpretation<br>- Strong verbal and written communication, interpersonal,<br>problem resolution and critical thinking skills<br>- Working knowledge of business segment specific codes,<br>products, and terminology<br><br><b>Preferred Qualifications</b><br><br>- Comfortable presenting to small and large groups<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$60,300.00 - $132,600.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  This position is eligible for a CVS Health bonus, commission or short-term incentive program in addition to the base pay range listed above. <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 03/25/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Manager, Network Relations", "type": "external", "publication_date": "2024-03-17T12:15:36Z", "short_name": "manager-network-relations-fddc11", "model_type": "jobs", "id": 14357542, "locations": [{"name": "Harrisburg, PA"}], "categories": [{"name": "Business Operations"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/manager-network-relations-fddc11"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Operations Manager is a member of the Store Management team, and as such, fulfills the company purpose of helping people on their path to better health by driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. Under the supervision of the Store Manager, the Operations Manager will maintain an engaged, productive store team through strong leadership, demonstrating initiative and leading by example.<br><br>The Operations Manager is responsible for supporting the Store Manager in the total leadership and strategic operation of a CVS/pharmacy store including:<ul><li>Overall store management, supervision, and policy implementation</li><li>Sales and inventory management</li><li>Employee staffing, training, and development</li><li>Financial management</li><li>Customer service leadership</li></ul>Unlike the Store Manager in Training position, the Operations Manager position is not part of the CVS/pharmacy Retail Management Development Program. Operations Managers are not eligible for direct promotion to Store Manager. Candidates with a short-term goal of becoming a CVS Store Manager should instead apply for Store Manager in Training openings.<br><br>Essential Functions:<br><br>1. Management<br><br>Lead others and work effectively with store crews<br><br>Supervise, assign and direct activities of the store's crew<br><br>Effectively communicate information to store crew and supervisors in an open and timely manner<br><br>Support Store Manager with actions plans for operational and service improvement<br><br>2. Customer Service<br><br>Assist customers with their questions, problems and complaints<br><br>Promote CVS customer service culture (greet, offer help, and thank)<br><br><b>Required Qualifications</b><ul><li>Deductive reasoning ability, advanced analytical skills and computer skills.</li><li>Advanced communication skills, leadership, supervision, and influencing skill</li><li>Ability to work a full-time flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed, and to respond to urgent issues at the store when they arise</li></ul><b>Preferred Qualifications</b><ul><li>Experience as a retail manager or supervisor</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$17.00 - $25.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 06/10/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Operations Manager", "type": "external", "publication_date": "2024-03-17T12:15:38Z", "short_name": "operations-manager-62a9d7", "model_type": "jobs", "id": 14344227, "locations": [{"name": "Mount Vernon, OH"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/operations-manager-62a9d7"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br> The Telepharmacy Technician is responsible for all daily operations of a Telepharmacy Remote Dispensing Pharmacy location, where the Pharmacist oversight occurs from a separate Supervising Pharmacy location. Telepharmacy Technicians build upon the skills and responsibilities of the Pharmacy Technician, and are focused on managing day-to-day pharmacy operations, execution and performance, while building patient loyalty through a continuous focus on excellent customer service, service recovery, and facilitating communication with the Supervising Pharmacy/Pharmacist. In addition to the responsibilities required for the Pharmacy Technician Role, this Telepharmacy Technician position is responsible for: •  Overseeing the safe and secure operation of the Remote Dispensing Pharmacy, including serving as a keyholder, keeping alarm and safe codes, and protecting the integrity of all pharmacy products, with special attention to refrigerated products and controlled substances. •  Overseeing pharmacy inventory management, including controlled substances, i.e. reviewing orders, checking in products, cycle counts, and maintaining perpetual inventory. In particular: o Executing pharmacy ordering and day-to-day inventory management practices, including cycle counts, returns-to-stock, one-by-one returns/outdates, refrigerator organization and temperature logging, waiting bin, etc. o Responsible for monthly review of the Inventory Excellence Report and partnering with the entire Telepharmacy team to improve overall inventory excellence, ensuring the right medication is in stock at the right time for the right patients. o Serving as point person for annual inventories, resets (e.g. Rx Planograms), and pharmacy-related components of AP Pulse Checks. •  Receiving and acting upon all operational communications, including completion of required tasks (email, myWork, etc.), and similar activities. •  Improving total store service foundations by execution of outstanding performance, especially in areas of WeCARE workflow best practices, customer service, and patient care. •  Demonstrating growth mindset to support positive business outcomes; inspiring and motivating the total store team to embrace change, including workflow enhancements and new product/service offerings. •  Serving as a peer mentor for the onboarding, training, and development of new hires in the Telepharmacy. •  Customer Service: Actively seeks opportunities to expand clinical, technical and insurance knowledge, leveraging available tools and training resources, to develop the basic drug understanding and technical expertise needed to accurately and more effectively assist customers. a. Prescription Fulfillment •  Communicates among a number of individuals, including patients, co-workers, insurance companies and prescribers where allowed by law. •  Effectively follows and ensures full compliance to CVS workflow procedures and quality assurance standards, with an in-depth understanding of each workstation (i.e., Pick-Up, Drop-Off, Drive-Thru, Production); manages own responsibilities while shifting to help the team where needed. As allowable in applicable states, certified and trained Telepharmacy Technicians can expand on their clinical and managerial responsibilities, including administering vaccinations. b. Face-to-Face Patient Interaction •  Collect information about a customer's medical history, as appropriate to update the patient's profile. •  Ensures patient outreach calls are completed within workflow, where appropriate and applicable •  Attends to all patients and customers at Telepharmacy counter and phone calls. c. Facilitating RPh-to-Patient Communication •  Lives our purpose of bringing our heart to every moment of your health by engaging customers to learn about their health and medications. •  Creates genuine human connections by focusing on service, and keeping patients and caregivers top of mind at all times. This includes assisting all Telepharmacy and front store customers with their questions and concerns and facilitating audio/visual access to the Supervising Pharmacist for counseling. d. Problem Resolution •  Partners with front store management to drive customer service. This includes ensuring that the appropriate schedule is implemented to best serve the needs of the customer and business in accordance with budgeted payroll hours and workflow model. •  Demonstrates compassion and care by proactively identifying and resolving potential problems to ensure customers have their medications when needed; collaborates with immediate and extended pharmacy teams, medical staff, insurance companies, and customers alike to resolve issues, ensure accuracy, and delivers timely resolution of any medication or insurance related concerns. •  Effectively resolves all customer concerns, complaints, issues and appropriately involves Pharmacist at Supervising Pharmacy and/or Front Store Manager at Telepharmacy (remote dispensing pharmacy) as appropriate. •  Business Metrics: •  Supports high-performing teams by looking for opportunities to contribute to individual and broader team goals, remains flexible for both schedule and business needs while easily adapting to changes at work to enable a supportive, collaborative, and challenging work environment. •  Proactively takes on additional tasks and responsibilities, demonstrating a strong work ethic. Identifies opportunities and executes improvement strategies for patient care and customer service. •  Professionally, promptly and effectively addresses all customer concerns and inquiries regarding customer service, HIPAA complaints, and any other issues, filing any necessary reports and facilitating prompt communication with the Supervising Pharmacist as appropriate. •  Balances quality and efficiency in all tasks, contributing to both patient outcomes and broader team goals. •  Promotes all new service offerings and initiatives to appropriate customer base. •  Participates in all required district and store operational meetings and action planning. •  Coordinates/implements the training and development of support staff with the field training team. Coaches, trains and mentors new Telepharmacy Technicians to develop the team and share best practices. •  Maintains a clean, organized and professional Telepharmacy department, according to CVS standards. •  Inventory Management: •  Maintains in-stock inventory by coordinating and monitoring inventory management related activities and policies and procedures which are critical to maintaining the right focus on daily, weekly, and monthly tasks. •  Helps establish true ownership for inventory management activities in the Telepharmacy. •  Enables a consistent approach to inventory management and critical inventory functions. <br><br><b>Required Qualifications</b><br> Must be at least 18 years of age •  Minimum of 1+ year of experience as a Pharmacy Technician (may be 2+ in select states) •  PTCB National Certification or equivalent state-accepted national Pharmacy Technician Certification •  High school diploma or General Equivalent Development (GED) required •  State-level licensure requirements vary by state •  Regular and reliable attendance •  Attention and Focus o Ability to concentrate on a task over an extended period without being distracted •  Customer Service Orientation o Actively look for ways to help people, and do so in a friendly manner o Notice and understand customers' reactions, and respond appropriately •  Communication Skills o Use and understand verbal and written communication to interact with customers and colleagues o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times •  Mathematical Reasoning o Ability to use math to solve a problem, such as calculating day's supply of a prescription •  Problem Resolution o Ability to judge when something is wrong or is likely to go wrong; recognizing there is a problem o Choosing the best course of action when faced with a complex situation with several available options •  Physical Demands: o Remaining upright on the feet, particularly for sustained periods of time o Moving about on foot to accomplish tasks, particularly for moving from one work area to another, including outside of the pharmacy area o Lifting, scanning, and bagging purchased items o Finger Dexterity: Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm o Reaching overhead; able to stretch or reach out with the body, arms, and/or legs to grasp items o Extending hand(s) and arm(s) multiple directions to place, move, or lift items o Precision control: able to adjust machines to exact positions o Stooping to a considerable degree and requiring full use of the lower extremities and back muscles to move items between low and high positions, including bending spine at the waist o Visual Acuity: Close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts o Able to orally communicate information and instructions to colleagues and customers o Occasional lifting of up to a maximum of 30 lbs up to a height of 4 feet; exerting up to 20 lbs. of force occasionally and/or up to 10 lbs. of force frequently, and/or a negligible amount of force constantly to move objects <br><br><b>Preferred Qualifications</b><br> Experience in Inventory Specialist Role <br><br><b>Education</b> High School diploma or equivalent <br> Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br>We strive to promote and sustain a culture of diversity, inclusion and belonging every day.<br>CVS Health is an affirmative action employer, and is an equal opportunity employer, as are the physician-owned businesses for which CVS Health provides management services. We do not discriminate in recruiting, hiring, promotion, or any other personnel action based on race, ethnicity, color, national origin, sex/gender, sexual orientation, gender identity or expression, religion, age, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.<br><br><b>Required Qualifications</b><br>Certified pharmacy Technician and 1 year retail pharmacy experience<br><br><b>Preferred Qualifications</b><br>Immunizer<br><br><b>Education</b><br>Highschool Diploma or higher<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Telepharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:48:00Z", "short_name": "telepharmacy-technician-d671e7", "model_type": "jobs", "id": 12573420, "locations": [{"name": "Phoenix, AZ"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/telepharmacy-technician-d671e7"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><b>Job Description:</b><br><br><b>Job Description</b><br>At Bank of America, we're guided by a common purpose to help make financial lives better by connecting clients and communities to the resources they need to be successful. Make a difference where it counts by joining our industry-leading wealth management team at Bank of America and Merrill. We're looking for the next generation of financial advisors-those with a passion for people and drive to make clients' financial lives better. You'll advise and guide clients on how to achieve their financial goals. Additionally, you'll be equipped with the expertise to support them with personal investing tools and resources.<br><br>During this stage of your journey, the Merrill Financial Solutions Advisor (Merrill FSA) will help provide you with the necessary training and guidance through a defined path to become the financial advisor you want to be. You will have the opportunity to work with both affluent and high net worth clients, identifying needs, developing relationships, reviewing investment goals, and preparing investment recommendations that align with the goals of both existing and prospective clients. In this role you will develop the relationship management skills necessary to operate in an Elite Growth Practice (EGP). From marketing yourself to managing your own practice, we'll prepare you with everything you need as you develop within your role. The MFSA role provides experienced advisors the opportunity to pursue a career within Merrill Wealth Management. Once you have honed your skills and demonstrated success as a MFSA, you typically will progress into the next stage of training. Located in a Merrill branch.<br><br>This position is subject to SAFE Act registration requirements. Pursuant to the SAFE Act requirements, all employees engaged in residential loan mortgage originations must register with the federal registry system and remain in good standing. Your position requires SAFE Act registration and you'll be required to register and submit to the required SAFE Act background check and registration process. Failure to obtain and/or maintain SAFE Act registration may result in your immediate termination.<br><br><b>We'll help you</b><br>•  Get training and one-on-one mentorship from managers who are invested in your success. You'll enroll in our Academy to develop as an advisor; the potential for growth is yours!<br>•  Build connections to grow your network and business. Starting at a Merrill branch, you'll interact with Merrill financial advisors, institutional retirement participants and higher net worth clients.<br>•  Deliver advice through client reviews/presentations with confidence, including reviews of financial goals, and recommend investment advisory strategies to help clients achieve their financial goals.<br>•  Learn about the full suite of financial solutions. Connect clients to solutions that are in their best interest, such as core Banking, Investment &amp; Life Priority™ solutions, through Bank of America and Merrill to meet their financial needs.<br><br><b>As a Merrill FSA, you can look forward to</b><br>•  A strong referral network from across the business to increase opportunities for affluent and high net worth client acquisition and provide access to partners who are specialists in their field.<br>•  Marketing strategies to reach wider audiences with greater appeal.<br>•  Ongoing professional development to deepen your skills and optimize your practice as the industry evolves.<br>•  Potential Opportunities for professional growth.<br>•  Leadership opportunities, including leading client and conference seminars<br><br><b>We're a culture that</b><br>•  Is committed to building a workplace where every employee is welcomed and given the support and resources to build and advance their careers. Along with taking care of our clients, we want to be a great place for people to work, and we strive to create an environment where all employees have the opportunity to achieve their goals.<br>•  Believes diversity makes us stronger so we can reflect, connect to and meet the diverse needs of our clients around the world.<br>•  Provides continuous training and developmental opportunities to help employees achieve their goals, whatever their background or experience.<br>•  Is committed to advancing our tools, technology and ways of working. We always put our clients first to meet their evolving needs.<br>•  Believes in responsible growth and is dedicated to supporting communities around the world by connecting them to the lending, investing and giving they need to remain vibrant and vital.<br><br><b>Required skills:</b><br>•  Currently holds Series 7 &amp; 66 (63 &amp; 65 in lieu of 66) licenses.<br>•  Has two years' experience working in the financial service industry and/or a sales environment where goals were met or exceeded (including at least one year experience in the investments industry, including investment training and in-depth knowledge of investment products and services)<br>•  Is a self-starter who efficiently manages time and capacity.<br>•  Sets and accomplishes goals, achieving whatever you put your mind to.<br>•  Builds and nurtures strong relationships.<br>•  Collaborates effectively with others to get things done.<br>•  Communicates effectively and confidently and is comfortable engaging all clients.<br>•  Manages goals, navigates complexity, prioritizes tasks and executes in a fast-paced environment.<br>•  Likes to learn, adapts to new information and seeks the right solutions for clients.<br>•  Is thorough and thoughtful in incorporating relevant regulatory due diligence into daily activities and long-term strategies for clients.<br><br><b>Desired skills:</b><br>•  Proven ability to partner and promote lead generation.<br>•  Experience balancing investment management, sales activities and new client development.<br>•  Strong computer skills and the ability to multitask in a demanding environment.<br>•  A bachelor's degree, preferably in business-related field.<br>•  Achieved additional professional designations such as Certified Financial Planner (CFP) and/or Chartered Retirement Planning Counselor (CRPC).<br>•  Obtained insurance licenses.<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>", "name": "Merrill Financial Solutions Advisor - Morristown Short Hills Market", "type": "external", "publication_date": "2024-01-17T23:47:01Z", "short_name": "merrill-financial-solutions-advisor-morristown-short-hills-market-daf4f6", "model_type": "jobs", "id": 13735164, "locations": [{"name": "Florham Park, NJ"}, {"name": "Jersey City, NJ"}, {"name": "Mountainside, NJ"}, {"name": "Short Hills, NJ"}, {"name": "Summit, NJ"}], "categories": [], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/bankofamerica/merrill-financial-solutions-advisor-morristown-short-hills-market-daf4f6"}, "company": {"id": 12145, "short_name": "bankofamerica", "name": "Bank of America"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.70 - $19.70<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:32:18Z", "short_name": "store-associate-5a8289", "model_type": "jobs", "id": 13946655, "locations": [{"name": "Menlo Park, CA"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-5a8289"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:22:29Z", "short_name": "pharmacy-technician-ae7666", "model_type": "jobs", "id": 14148814, "locations": [{"name": "South Dennis, MA"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-ae7666"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:32:18Z", "short_name": "shift-supervisor-trainee-32d5b8", "model_type": "jobs", "id": 13958539, "locations": [{"name": "St. Petersburg, FL"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-32d5b8"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Global Customer Experience Specialist</strong></p>\n\n<p><strong>Must be able to work onsite in Dublin  </strong></p>\n\n<p>Want to be part of an amazing team, hell-bent on crafting a better future? We’re always looking for creative people who care!</p>\n\n<p>We are analysts. Creators. Designers. Doers. Dreamers. Explorers. Geeks. Hipsters. Leaders. Learners. Renegades. Seekers. Strategists. Visionaries. And we fundamentally believe that we’re better together.</p>\n\n<div></div>\n\n<p>We believe in teamwork, fun, complex projects, diverse perspectives, and simple solutions. How about you? We’re looking for a <strong>Global Customer Experience Specialist</strong> with the passion and experience to build what matters – one project at a time.</p>\n\n<p>Our new Global Customer Experience Specialist will play a role in helping our clients excel.</p>\n\n<p><strong>Would you like to...?</strong></p>\n\n<ul>\n<li>Review and Triage customer and partner escalations via multiple channels (Social, Chat, and Technical Support) and determine appropriate communication plan and customer resolution path.</li>\n<li>Partner across various cross-functional teams and key stakeholders to ensure team is providing optimal customer experience each and every time.</li>\n<li>Provide clear, concise communications for all Azure customers</li>\n<li>Partner with Service Engineering teams to determine customer impact and provide rapid communications to customers on Live Site Incidents.</li>\n<li>Provide ongoing communication and status updates throughout duration of incident</li>\n<li>Develop and share best practices and recommendations to improve efficiencies within the internal team</li>\n<li>Identify root cause of escalations to drive long term resolutions</li>\n<li>Contribute to the creation of future Microsoft support capabilities for the cloud</li>\n</ul>\n\n<p><strong>We would like you to have...</strong></p>\n\n<ul>\n<li>Excellent written and verbal communications skills are a must</li>\n<li>Effective, polished interaction with customers, proven ability to quickly capture relevant information; explain next steps in resolving issues; communicate next steps and status; and inspire confidence</li>\n<li>Demonstrated troubleshooting skills, cross-team collaboration, and critical thinking</li>\n<li>Ability to influence people at all levels to drive resolution</li>\n<li>Always look at problems with customer first solutions</li>\n<li>High attention to detail, able to problem solve logically and think critically in mission critical situations.</li>\n<li>Passion for problem solving through the ability to self-learn, think critically, and have fun while doing it</li>\n<li>Creative Problem Solving by driving innovative solutions</li>\n<li>Thrive in ambiguous situations; effectively manage change; shift gears comfortably; decide and act without having the total picture; comfortable handling risk and uncertainty</li>\n<li>Technical aptitude with a passion to learn</li>\n<li>Support experience is a plus</li>\n<li>Experience with Azure or other cloud technologies is a plus</li>\n<li>BA/BS Degree Communications or Computer Science is preferred or equivalent experience</li>\n<li>Available to work critical cases as needed on to be on a 24x7 basis and through an on-call model  </li>\n</ul>\n\n<p><strong>Would you like to join a global organization that...</strong></p>\n\n<ul>\n<li>Embraces work-life balance – our employees’ well-being remains a top priority for us</li>\n<li>Promotes a culture of learning and advocacy across the globe - diversity will enable us to strengthen our impact</li>\n<li>Encourages innovation and experimentation</li>\n<li>Understands that changes will occur and adaptability is crucial to assist when it does</li>\n<li>Emphasizes and rewards collaboration</li>\n<li>Works remotely. We continue to safeguard the health of our employees so our interviewing and on-boarding process will remain virtual until further notice</li>\n</ul>\n\n<p><strong><em>This role requires the individual to be fully-vaccinated against COVID-19.  The individual will be required to submit proof of vaccination.  Reasonable accommodations will be considered for exemptions to this requirement in accordance with applicable law. </em></strong></p>\n\n<p><strong>Want to know more?</strong></p>\n\n<p>Check out our open jobs around the world. Just so you know, we don’t have a dress code, but we do have a strict no jerk policy.</p>\n\n<p><a href=\"https://www.designit.com/\">https://www.designit.com/</a></p>\n\n<p><em>Designit is committed to ensuring that all candidates have an equal opportunity to be considered for employment. Please let us know if you need any reasonable accommodation to participate in the job application or interview process.</em></p>\n\n<p> </p>", "name": "Global Customer Experience Specialist", "type": "external", "publication_date": "2024-03-07T23:07:20Z", "short_name": "global-customer-experience-specialist-a2d5db", "model_type": "jobs", "id": 14319136, "locations": [{"name": "Dublin, Ireland"}], "categories": [{"name": "Protective Services"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/designit/global-customer-experience-specialist-a2d5db"}, "company": {"id": 15000194, "short_name": "designit", "name": "Designit"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:47:59Z", "short_name": "pharmacy-technician-f5ef68", "model_type": "jobs", "id": 12617827, "locations": [{"name": "Eustis, FL"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-f5ef68"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><b>Earn a $700 bonus in Boston when you give 140 rides during your first 30 days. New drivers only. Terms apply.</b><br>We're looking for a few good drivers. Lyft is excited to launch the highly requested Women+ Connect feature across the country which offers more choice, opportunity, and peace of mind for women and nonbinary drivers. We're making Lyft better for everyone.<br>Sign up today and all drivers of any gender are eligible to receive our new driver offer.<br><br><b>What is Lyft?</b><br> <br> Lyft is a flexible earning opportunity and a platform that connects drivers with individuals and organizations that need rides. Driving with Lyft is the perfect way to earn money on any schedule and is a great alternative to other types of earning opportunities. Drivers can cash out any time with Express Pay. <br> <br><b>Why Lyft?</b><br><br><ul>  <li><b>Boost Your Earnings:</b> With Upfront Pay you can view the fare for a ride before you accept it, giving you more control of your earnings. Plus, you keep 100% of your tips.</li><li><b>Peace of Mind:</b> In addition to a suite of products designed to make driving more comfortable, Women and nonbinary drivers can turn on Women+ Connect to increase their chances of matching with more women and nonbinary riders, offering more control over their driving experience</li>  <li><b>Be Your Own Boss:</b> Set your own schedule and keep control over when you drive and earn</li>  </ul><br><b>Our Vision</b><br><br><ul>  <li><b>Making Rideshare Better:</b> Diverse communities are stronger, more interesting communities. Making Lyft better for everyone</li><li><b>Community Connections:</b> Good vibes. Conversations that turn into friendships. Comfortable silence. Our Women+ Connect is here to improve the ride experience for all drivers and riders</li>  </ul><br><b>Driver Requirements</b><br><br><ul>  <li>You're at least 25 years old</li>   <li>You own an iPhone or Android smartphone</li>   <li>You have a clean driving record and auto insurance</li>   <li>You have a 4-door from 2009 or newer </li><em>Car year may vary by region<br>  <br></em>Does not apply if you are renting a car through Express Drive program</ul></p>", "name": "Drive with Lyft - No Experience Needed", "type": "external", "publication_date": "2024-03-14T15:30:38Z", "short_name": "drive-with-lyft-no-experience-needed-34d7ae", "model_type": "jobs", "id": 14262675, "locations": [{"name": "Boston, MA"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/lyft/drive-with-lyft-no-experience-needed-34d7ae"}, "company": {"id": 11895, "short_name": "lyft", "name": "Lyft"}}, {"contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day. <br> <br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being. <br> <br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization. <br> <br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br><b>Job Description:</b><br>This job is responsible for engaging clients in the lobby to educate and assist with conducting transactions through self-service resources, such as mobile banking, online banking, or ATM. Key responsibilities include accurately and efficiently processing cash transactions for clients as needed. Job expectations include having deep conversations with clients to gain in-depth knowledge of the financial and life priorities and connecting clients to solutions that meet the financial goals.<br><br><b>Responsibilities:</b><br>•  Executes the bank's risk culture and strives for operational excellence<br>•  Builds relationships with clients to meet financial needs<br>•  Follows established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations<br>•  Grows business knowledge and network by partnering with experts in small business, lending, and investments<br>•  Manages financial center traffic, appointments, and outbound calls effectively<br>•  Drives the client experience<br>•  Manages cash responsibilities<br><br><b>Required Qualifications:</b><br>•  Is an enthusiastic, highly motivated self-starter with a strong work ethic and intense focus on results, acting in the best interest of the client.<br>•  Collaborates effectively to get things done, building and nurturing strong relationships.<br>•  Displays passion, commitment and drive to deliver an experience that improves our clients' financial lives.<br>•  Is confident in identifying solutions for new and existing clients based on their needs.<br>•  Communicates effectively and confidently, and is comfortable engaging all clients.<br>•  Has the ability to learn and adapt to new information and technology platforms.<br>•  Is confident in educating clients on how to conduct simple banking transactions through self-service technologies (for example, ATM, online banking, mobile banking).<br>•  Applies strong critical thinking and problem-solving skills to meet clients' needs.<br>•  Will follow established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations.<br>•  Efficiently manages time and capacity.<br>•  Focuses on results, while acting in the best interest of the client.<br>•  Can be flexible to work weekends and/or extended hours as needed.<br><br>Desired Qualifications:<br>•  Experience in financial services and knowledge of financial services industry, products and solutions.<br>•  One year of demonstrated successful sales experience in a salary plus incentive environment with individual sales goals.<br>•  Six months of cash handling experience.<br>•  Bachelor's degree or business relevant associate degree such as business management, business administration, or finance.<br><br><b>Skills:</b><br>•  Adaptability<br>•  Business Acumen<br>•  Customer and Client Focus<br>•  Oral Communications<br>•  Problem Solving<br>•  Account Management<br>•  Client Experience Branding<br>•  Client Management<br>•  Client Solutions Advisory<br>•  Relationship Building<br>•  Business Development<br>•  Pipeline Management<br>•  Prospecting<br>•  Referral Identification<br>•  Referral Management<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>", "name": "Relationship Banker", "type": "external", "publication_date": "2024-03-12T23:28:43Z", "short_name": "relationship-banker-8ba63d", "model_type": "jobs", "id": 14362849, "locations": [{"name": "Redmond, WA"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/bankofamerica/relationship-banker-8ba63d"}, "company": {"id": 12145, "short_name": "bankofamerica", "name": "Bank of America"}}], "aggregations": {}}