{"page": 0, "page_count": 15640, "items_per_page": 20, "took": 19, "timed_out": false, "total": 312784, "results": [{"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Retail Store Associates play a meaningful role within the CVS Health family. At CVS Health, we're shaping the future of health care for people, businesses, and communities. With your talents and expertise, you can help us play a more active and supportive role in each person's unique healthcare needs. Join our team of thousands as we positively impact millions...one customer at a time.<br><br>The Retail Store Associate position provides an opportunity, in a leading retail setting, to excel in a growing, high impact, customer focused role, working both independently and as a member of a team, to positively impact the lives of others.<br><br>Essential Functions:<ul><li>Providing differentiated customer service by anticipating customer needs, demonstrating compassion and care in all interactions, and actively identifying and resolving potential service issues</li><li>Focusing on the customer by giving a warm and friendly greeting, maintaining eye contact and offering help locating additional items, when needed</li><li>Accurately perform cashier duties - handling cash, checks and credit card transactions with precision while following company policies and procedures</li><li>Maintaining the sales floor by restocking shelves, checking in vendors, updating pricing information and completing inventory management tasks as directed by store manager</li><li>Supporting opening and closing store activities, when needed</li><li>Providing customer support to all departments, including photo and beauty, ensuring departments are fully stocked and operational while remaining current with all updated services and tools</li><li>Assisting pharmacy personnel when needed, including working regular shifts in the pharmacy as part of opportunities for growth and career development</li><li>Embracing and advocating for new CVS services and loyalty programs that support our purpose of helping people on their path to better health</li><li><b>Required Qualifications</b><ul><li>At least 16 years of age<br><br>Physical Requirements:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Lifting and exerting up to 35 lbs of force occasionally, up to 10 lbs of force frequently, and a negligible amount of force regularly to move objects to and from, including overhead lifting</li><li>Visual Acuity - Having close visual acuity to perform activities such as: viewing a computer terminal, reading, visual inspection involving small parts/details</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a retail or customer service setting</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$15.70 - $15.70<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Store Associate", "type": "external", "publication_date": "2024-03-17T12:42:27Z", "short_name": "store-associate-aa0a17", "model_type": "jobs", "id": 13540382, "locations": [{"name": "San Dimas, CA"}], "categories": [{"name": "Retail"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/store-associate-aa0a17"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br> o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br> o Actively look for ways to help people, and do so in a friendly manner<br> o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br> o Use and understand verbal and written communication to interact with customers and colleagues<br> o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br> o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br> o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br> o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br> o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:39:34Z", "short_name": "pharmacy-technician-60696c", "model_type": "jobs", "id": 13718234, "locations": [{"name": "Livonia, MI"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-60696c"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br> The Telepharmacy Technician is responsible for all daily operations of a Telepharmacy Remote Dispensing Pharmacy location, where the Pharmacist oversight occurs from a separate Supervising Pharmacy location. Telepharmacy Technicians build upon the skills and responsibilities of the Pharmacy Technician, and are focused on managing day-to-day pharmacy operations, execution and performance, while building patient loyalty through a continuous focus on excellent customer service, service recovery, and facilitating communication with the Supervising Pharmacy/Pharmacist. In addition to the responsibilities required for the Pharmacy Technician Role, this Telepharmacy Technician position is responsible for: •  Overseeing the safe and secure operation of the Remote Dispensing Pharmacy, including serving as a keyholder, keeping alarm and safe codes, and protecting the integrity of all pharmacy products, with special attention to refrigerated products and controlled substances. •  Overseeing pharmacy inventory management, including controlled substances, i.e. reviewing orders, checking in products, cycle counts, and maintaining perpetual inventory. In particular: o Executing pharmacy ordering and day-to-day inventory management practices, including cycle counts, returns-to-stock, one-by-one returns/outdates, refrigerator organization and temperature logging, waiting bin, etc. o Responsible for monthly review of the Inventory Excellence Report and partnering with the entire Telepharmacy team to improve overall inventory excellence, ensuring the right medication is in stock at the right time for the right patients. o Serving as point person for annual inventories, resets (e.g. Rx Planograms), and pharmacy-related components of AP Pulse Checks. •  Receiving and acting upon all operational communications, including completion of required tasks (email, myWork, etc.), and similar activities. •  Improving total store service foundations by execution of outstanding performance, especially in areas of WeCARE workflow best practices, customer service, and patient care. •  Demonstrating growth mindset to support positive business outcomes; inspiring and motivating the total store team to embrace change, including workflow enhancements and new product/service offerings. •  Serving as a peer mentor for the onboarding, training, and development of new hires in the Telepharmacy. •  Customer Service: Actively seeks opportunities to expand clinical, technical and insurance knowledge, leveraging available tools and training resources, to develop the basic drug understanding and technical expertise needed to accurately and more effectively assist customers. a. Prescription Fulfillment •  Communicates among a number of individuals, including patients, co-workers, insurance companies and prescribers where allowed by law. •  Effectively follows and ensures full compliance to CVS workflow procedures and quality assurance standards, with an in-depth understanding of each workstation (i.e., Pick-Up, Drop-Off, Drive-Thru, Production); manages own responsibilities while shifting to help the team where needed. As allowable in applicable states, certified and trained Telepharmacy Technicians can expand on their clinical and managerial responsibilities, including administering vaccinations. b. Face-to-Face Patient Interaction •  Collect information about a customer's medical history, as appropriate to update the patient's profile. •  Ensures patient outreach calls are completed within workflow, where appropriate and applicable •  Attends to all patients and customers at Telepharmacy counter and phone calls. c. Facilitating RPh-to-Patient Communication •  Lives our purpose of bringing our heart to every moment of your health by engaging customers to learn about their health and medications. •  Creates genuine human connections by focusing on service, and keeping patients and caregivers top of mind at all times. This includes assisting all Telepharmacy and front store customers with their questions and concerns and facilitating audio/visual access to the Supervising Pharmacist for counseling. d. Problem Resolution •  Partners with front store management to drive customer service. This includes ensuring that the appropriate schedule is implemented to best serve the needs of the customer and business in accordance with budgeted payroll hours and workflow model. •  Demonstrates compassion and care by proactively identifying and resolving potential problems to ensure customers have their medications when needed; collaborates with immediate and extended pharmacy teams, medical staff, insurance companies, and customers alike to resolve issues, ensure accuracy, and delivers timely resolution of any medication or insurance related concerns. •  Effectively resolves all customer concerns, complaints, issues and appropriately involves Pharmacist at Supervising Pharmacy and/or Front Store Manager at Telepharmacy (remote dispensing pharmacy) as appropriate. •  Business Metrics: •  Supports high-performing teams by looking for opportunities to contribute to individual and broader team goals, remains flexible for both schedule and business needs while easily adapting to changes at work to enable a supportive, collaborative, and challenging work environment. •  Proactively takes on additional tasks and responsibilities, demonstrating a strong work ethic. Identifies opportunities and executes improvement strategies for patient care and customer service. •  Professionally, promptly and effectively addresses all customer concerns and inquiries regarding customer service, HIPAA complaints, and any other issues, filing any necessary reports and facilitating prompt communication with the Supervising Pharmacist as appropriate. •  Balances quality and efficiency in all tasks, contributing to both patient outcomes and broader team goals. •  Promotes all new service offerings and initiatives to appropriate customer base. •  Participates in all required district and store operational meetings and action planning. •  Coordinates/implements the training and development of support staff with the field training team. Coaches, trains and mentors new Telepharmacy Technicians to develop the team and share best practices. •  Maintains a clean, organized and professional Telepharmacy department, according to CVS standards. •  Inventory Management: •  Maintains in-stock inventory by coordinating and monitoring inventory management related activities and policies and procedures which are critical to maintaining the right focus on daily, weekly, and monthly tasks. •  Helps establish true ownership for inventory management activities in the Telepharmacy. •  Enables a consistent approach to inventory management and critical inventory functions. <br><br><b>Required Qualifications</b><br> Must be at least 18 years of age •  Minimum of 1+ year of experience as a Pharmacy Technician (may be 2+ in select states) •  PTCB National Certification or equivalent state-accepted national Pharmacy Technician Certification •  High school diploma or General Equivalent Development (GED) required •  State-level licensure requirements vary by state •  Regular and reliable attendance •  Attention and Focus o Ability to concentrate on a task over an extended period without being distracted •  Customer Service Orientation o Actively look for ways to help people, and do so in a friendly manner o Notice and understand customers' reactions, and respond appropriately •  Communication Skills o Use and understand verbal and written communication to interact with customers and colleagues o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times •  Mathematical Reasoning o Ability to use math to solve a problem, such as calculating day's supply of a prescription •  Problem Resolution o Ability to judge when something is wrong or is likely to go wrong; recognizing there is a problem o Choosing the best course of action when faced with a complex situation with several available options •  Physical Demands: o Remaining upright on the feet, particularly for sustained periods of time o Moving about on foot to accomplish tasks, particularly for moving from one work area to another, including outside of the pharmacy area o Lifting, scanning, and bagging purchased items o Finger Dexterity: Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm o Reaching overhead; able to stretch or reach out with the body, arms, and/or legs to grasp items o Extending hand(s) and arm(s) multiple directions to place, move, or lift items o Precision control: able to adjust machines to exact positions o Stooping to a considerable degree and requiring full use of the lower extremities and back muscles to move items between low and high positions, including bending spine at the waist o Visual Acuity: Close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts o Able to orally communicate information and instructions to colleagues and customers o Occasional lifting of up to a maximum of 30 lbs up to a height of 4 feet; exerting up to 20 lbs. of force occasionally and/or up to 10 lbs. of force frequently, and/or a negligible amount of force constantly to move objects <br><br><b>Preferred Qualifications</b><br> Experience in Inventory Specialist Role <br><br><b>Education</b> High School diploma or equivalent<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician  Telepharmacy (Onsite - Store 17714 - Phoenix AZ) - FT", "type": "external", "publication_date": "2024-03-17T12:47:56Z", "short_name": "pharmacy-technician-telepharmacy-onsite-store-17714-phoenix-az-ft", "model_type": "jobs", "id": 13034388, "locations": [{"name": "Phoenix, AZ"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-telepharmacy-onsite-store-17714-phoenix-az-ft"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Siemens Mobility Portugal is looking for an experiencedSenior Software Architect to join our architecture team for RealtimeDispatching Systems. In this role, your key responsibilities will be:<br><br><ul><li>Design and develop of software architecture fornew and existing products</li><li>Collaborate with cross-functional teams,including product management and agile development teams, to gatherrequirements, create technical specifications, and specify technical solutionsfor new requirements and product features</li><li>Break down solutions for implementation indevelopment teams, providing guidance and coaching</li><li>Document and maintain the technical productarchitecture</li><li>Coordinate and monitor the implementation ofarchitecture activities across product and project boundaries</li><li>Mentor and guide team members in software design anddevelopment best practices</li><li>Ensure that software code meets quality standards, includingperformance, security, and reliability</li><li>Stay up to date with industry trends and newtechnologies, continuously improving software design and development processes</li><li>Contribute to a healthy and collaborative teamspirit within the large, interdisciplinary product teams based in Aveiro and Hanover(Germany) as well as other Siemens Mobility's locations worldwide.</li></ul><br>Requirements:<br><br><ul><li>Abachelor's degree in Computer Science or a related field</li><li>Atleast 6 years of experience in software design and development</li><li>Experienceas a software architect, preferably with certification according to iSAQB orsimilar</li><li>Proficiency in at least one OOP programminglanguage, such as C++ or Java, with a strong understanding of OOP and softwaredesign patterns</li><li>Experience designing and implementingmulti-tier and distributed component/service architectures, as well as workingwith cloud technologies</li><li>Knowledgein Continuous Integration/Delivery practices and tools</li><li>Excellent communication and moderation skillsin English, with the ability to produce high quality written documentation</li><li>A solution-oriented and independent workingstyle, with the ability to mentor and guide other team members</li></ul><br>If you are an experienced software architect with apassion for solving complex problems and building scalable and reliablesoftware solutions, we encourage you to apply by submitting your resume.<br><br><b>Organization:</b> Siemens Mobility<br><br><b>Company:</b> SIEMENS MOBILITY, UNIPESSOAL LDA<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Senior Software Architect(m/f/d)", "type": "external", "publication_date": "2023-01-03T23:34:15Z", "short_name": "senior-software-architectmfd", "model_type": "jobs", "id": 10654819, "locations": [{"name": "Aveiro, Portugal"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/senior-software-architectmfd"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary:</b><br><br>Are you a skilled Pharmacy Technician looking to advance your career? Looking to change into a closed-door pharmacy setting and gain new skillsets? Join our Omnicare closed-door pharmacy team as an Advanced Pharmacy Technician- and find a career that rewards you.<br><br> \"No prior pharmacy related experience is required. Candidates are required to obtain licensure with the West Virginia Board of Pharmacy as a Pharmacy Technician in Training prior to start.\"<br><br><b> Day In The Life: </b><br><br>As an Advanced Pharmacy Technician, you will work to ensure all medication needs and regulatory compliance are met for our patients while working in various pharmacy workstations. Our back-end team focuses on order fulfillment including packaging and dispensing of medication, reviewing delivery orders and bins for accuracy, and coordinating stock rotations. Additional tasks and responsibilities include:<ul><li>Partnering with function supervisor to coordinate workflow for assigned areas that prepare and process medications</li><li>Rotating and working in various assigned pharmacy workstations including Packaging, Staging, Returns, Receiving, Narcotics, IV, Ekit, Compounding, Omnicell Cycle Fill, Machine Packaging</li><li>Receiving product deliveries, pull and stage product for distribution, rotate stock, and coordinate activities with drivers to ensure shipments are accurate and deliveries are timely</li><li>Performing physical inventories of medication</li></ul><b> The Team: </b><br><br>Omnicare, a CVS Health Company, provides care to those in skilled nursing facilities, assisted living communities, and chronic care settings.<br>Although Omnicare pharmacies are not open to the public, you'll work amongst great colleagues in a supportive environment aligned with the company's mission, allowing our customers to focus on giving their patients the best care.<br><br><b> Required Qualifications: </b><ul><li>Certification/licensed/registered pharmacy technician or as required by state law</li></ul><b> Preferred Qualifications: </b><br><br> Additional Skills/Experience, but not Required:<ul><li>Prior experience in the long-term care industry</li><li>Prior experience in a pharmacy, retail, medical, or customer service setting</li><li>PTCB National Certification</li><li>One (1) or more years of experience as a pharmacy technician or equivalent experience</li></ul><b> Education </b><ul><li>Verifiable High School Diploma or GED</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $23.56<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 04/30/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician Back End (Production) Omnicare", "type": "external", "publication_date": "2024-03-17T12:27:42Z", "short_name": "pharmacy-technician-back-end-production-omnicare-8370fe", "model_type": "jobs", "id": 14102352, "locations": [{"name": "Clarksburg, WV"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-back-end-production-omnicare-8370fe"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<div>AB Tasty is a global leader in AI-powered experience optimization solutions empowering brands using personalization, experimentation, recommendations, and search to build better experiences on their websites and apps. Integrated into a single platform, AB Tasty offers web and API-based solutions that provide companies with a unified approach to creating seamless experiences for customers.</div>\n\n<div><br></div>\n\n<div>Brands use AB Tasty’s platform to align digital, e-commerce, and product teams on revenue goals by optimizing and innovating digital experiences.</div>\n\n<div><br></div>\n\n<div>Founded in 2013, AB Tasty’s customer roster includes world-leading brands such as Kering, McDonald’s, Ulta Beauty, L’Oreal, Disneyland Paris, and LVMH among others.</div>\n\n<div>AB Tasty has 12 offices across the globe: North America, Europe, Asia Pacific</div>\n\n<div><br></div>\n\n<div><span>We are looking for our new Team Leader for our Core Interface team ! At AB Tasty, a squad is an agile and autonomous team, of about 6 people, with all the necessary skills for the development of new functionalities: front-end developers (JavaScript / React), back-developer (PHP Symfony), UX Designer, Product Manager, QA Engineer.</span></div>\n\n<div><br></div>\n\n<div><span>The Core Interface team is responsible for the quality of the interface layers of Client Side and Server-side &amp; Rollout Platform, as well as designing the next interface that merges all features from all our products.</span></div>\n\n<div><br></div>\n\n<div><span>The Team Leader of Core Interface team refers to the Head of Core Platform.</span></div>\n\n<p><strong>Contract &amp; Location</strong><ul><li>Permanent full-time contract</li><li>Paris or Nantes Office</li><li>Smooth remote work policy (up to 3 days a week)</li></ul></p>\n<p><strong>A few examples of your responsibilities:</strong><ul><li>Manage a team of data and backend engineers, both on-site and remotely.</li><li>Be responsible for the team's project management (scrum mastering, planning, follow-up).</li><li>Represent the team to other members of the company.</li><li>Collaborate with internal teams and help them define their needs.</li><li>Guarantee the stability and quality of projects for which the team is responsible.</li><li>Communicate successes and problems encountered to management and internal teams </li><li>Participate in feature development and bug resolution</li></ul></p>\n<p><strong>What we offer:</strong><ul><li><b>Huge impact. </b>AB Tasty is only as great as our team. By directly developing the publicly accessible SaaS platform used by all our clients, you’ll have a direct impact on the company’s success.</li><li><b>The opportunity to unleash your creativity.</b> You’ll be free to contribute to the processes, the tools and the organisation of the team, according the agile principles.</li><li><b>No micromanaging.</b> Be the owner of your effort - you’ll be one of the team and fully  trusted to take responsibility for your tasks. You’ll have every  incentive to make a real impact.</li><li><b>International reach.</b> Our audience is wildly international, and our team is too. Although our HQ is located in France, our company language is English.</li><li><b>Continuous education. </b>We offer many opportunities for each employee to learn and grow from a mix of professional and non professional topics.</li><li><b>Unique career opportunity. </b>By joining a fast-growing company that’s making waves in the tech industry, you’ll have a wonderful chance to enhance your learning and advance in your career faster than you ever thought possible.</li><li><b>Lots. Of. Fun. </b>Our incredible magic makers organize awesome events, such as team games, drinks, yoga classes, parties, and a company-wide retreat every year with employees from all countries gathering for 2 days of fun.</li><li><b>Remote working, flexible schedule. </b>This isn’t a “clock in, clock out” company. We care about your productivity,  not tracking every minute you’re on site. It’s up to you to always be responsible for your work, no matter where you are or what schedule you’re keeping.</li><li><b>Time for yourself.</b> After a year within AB Tasty, we offer you a day off during which we simply ask you to think  about your career expectations with us. It's not always easy to find time for introspection and to envision what path can lead us to a happy career so we offer a Retreat Day as an opportunity to reflect on that. We not only aim to succeed, but also to make you succeed.</li></ul></p>\n<p><strong>What we're looking for:</strong><ul><li>You are able to think \"outside the box\" while identifying problems and developing creative and innovative solutions</li><li>You have at least 3 years of experience as Front-End and / or Backend developper.</li><li>You have management experience even on a small scale in your previous experience(s)</li><li>You are sensitive to clients feedback, user experience, and you are aligned with one our main value “client satisfaction”</li><li>You have a good level of English (spoken and written)</li></ul></p>", "name": "Technical Team Leader - Core Team", "type": "external", "publication_date": "2024-01-15T23:04:50Z", "short_name": "technical-team-leader-core-team", "model_type": "jobs", "id": 13681803, "locations": [{"name": "Paris, France"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/abtasty/technical-team-leader-core-team"}, "company": {"id": 11719, "short_name": "abtasty", "name": "AB Tasty"}}, {"contents": "<p><strong>Art der Anstellung: </strong>Befristet; 15-20h /Woche<br> <br><strong>Deine Extraportion Praxis.</strong><br><br>Wie werden wir uns übermorgen fortbewegen, miteinander kommunizieren, Energien nutzen? Lass uns gemeinsam an den Antworten arbeiten. Wir suchen dafür kluge Köpfe, die Theorie in Praxis umwandeln und clever mitdenken. Kurz: Menschen, die ihre und unsere Fragen in neue Ausrufezeichen verwandeln wollen! Als Werkstudent*in stehen dir bei uns viele Türen offen, um dich einzubringen: Ergreife die Chance und werde Teil unseres weltweiten Netzwerks, knüpfe wichtige Kontakte und lege so den Grundstein für deine berufliche und persönliche Zukunft. Unsere Teams freuen sich auf dich.<br><br>CF F Trade Finance Advisory (TFA) hat als Governance Owner für Trade Finance innerhalb von Siemens die Aufgabe, einen effektiven und effizienten Risikorahmen für das Trade Finance Geschäft von Siemens zu schaffen und die mit Garantien, Akkreditiven und Treuhandkonten verbundenen Risiken zu verwalten.<br><br>TFA Global Coordination and Development (GCD) analysiert und optimiert kontinuierlich das globale Trade Finance Setup, alle Prozesse und die dazugehörige IT-Landschaft mit einem starken Fokus auf Prozesseffizienz, Standardisierung, Automatisierung und Digitalisierung. GCD unterstützt den Global Head of TFA bei der Entwicklung und Umsetzung einer globalen TFA-Strategie sowie bei der Konzeption und Umsetzung von strategischen Projekten. GCD ist außerdem für die Koordination der globalen Trade Finance Organisation und die Konzeption und Umsetzung eines Kommunikationskonzepts für die internen und externen Stakeholder von TFA verantwortlich.<br> <br><strong>Wir setzen um, worauf es ankommt. Das ist dein Beitrag.</strong><br><br><ul><li>Du unterstützt den Bereich Trade Finance bei der Entwicklung und Umsetzung eines internen als auch externen Kommunikationskonzeptes</li><li>Du übernimmst IT-Administrationsaufgaben für Chatbots</li><li>Du pflegst bestehende und neue Intranetseiten (Sharepoint)</li><li>Du hilfst uns, indem du Texte für interne und externe Kanäle, u.a. für unsere Social Media Auftritte oder Online-Nachrichten schreibst</li><li>Du unterstützt uns der bei Recherche und Dokumentation verschiedener Themen im Bereich Trade Finance und Digitalisierung</li><li>Du arbeitest bei der Erstellung und Aktualisierung von Präsentationen, Templates, Learning Videos, Tutorials, etc. mit</li><li>Du unterstützt bei der Entwicklung von Konzepten für interne und externe Events und erstellst aussagekräftige Präsentationen</li></ul><br><strong>Wir suchen keine Superhelden. Sondern super helle Köpfe.</strong><br><br><ul><li>Du studierst an einer Hochschule in der Fachrichtung Betriebswirtschaftslehre, Medien- oder Kommunikationswissenschaft oder eine vergleichbare Studienrichtung mit dem Schwerpunkt Kommunikation oder Finanzierung und stehst uns in Erlangen oder München für 15 - 20 h / Woche zur Verfügung</li><li>Außerdem begeisterst du dich für die Themen Finanzen, Kommunikation und Digitalisierung</li><li>Idealerweise konntest du schon erste Erfahrungen im redaktionellen Umfeld oder in den Bereichen Kommunikation, Internet, Intranet, Social Media, Analytics und Erstellung von Medien (z.B. Videos, Infografiken) sammeln</li><li>Du hast Spaß daran, Veranstaltungen zu organisieren und bringst Organisations- und Kommunikationsgeschick mit</li><li>Du punktest mit Praxiserfahrung in den MS-Office-Anwendungen, Newsletter-Tools und / oder Analytics Anwendungen</li><li>Erfahrungen mit Film-Bearbeitungs-Software wie Camtasia o.ä. sind ein Plus</li><li>Deine fließenden Deutsch- und Englischkenntnisse wendest du auch im internationalen Kontext souverän an</li></ul><br><strong>Gesucht: Mitgestalter von morgen.</strong><br> <br><strong>www.siemens.de</strong><br><br>wenn du vor deiner Bewerbung mehr über Siemens erfahren möchtest.<br><br>Du hast Fragen zur Bewerbung? <strong>Hier</strong> findest du Antworten auf häufig gestellte Fragen.<br><br>Wenn du darüber hinaus noch Fragen hast, wende dich gerne an uns: www.siemens.de/fragenzurbewerbung<br><strong>www.siemens.de/karriere</strong><br>wenn du mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchtest.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br><b>Organization:</b> Controlling and Finance<br><br><b>Company:</b> Siemens AG<br><br><b>Experience Level:</b> Student (Not Yet Graduated)<br><br><b>Full / Part time:</b> Part-time</p>", "name": "Werkstudent*in (w/m/d) im Bereich Finance - Strategic Development and Communication - Trade Finance", "type": "external", "publication_date": "2022-12-16T23:39:03Z", "short_name": "werkstudentin-wmd-im-bereich-finance-strategic-development-and-communication-trade-finance-e0c555", "model_type": "jobs", "id": 10591478, "locations": [{"name": "Erlangen, Germany"}], "categories": [{"name": "Accounting and Finance"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/werkstudentin-wmd-im-bereich-finance-strategic-development-and-communication-trade-finance-e0c555"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.75 - $22.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:15:37Z", "short_name": "shift-supervisor-trainee-bec2cd", "model_type": "jobs", "id": 14343707, "locations": [{"name": "Fresno, CA"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-bec2cd"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $19.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:36:12Z", "short_name": "shift-supervisor-trainee-4816dd", "model_type": "jobs", "id": 13854735, "locations": [{"name": "Lee's Summit, MO"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-4816dd"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$18.82 - $23.32<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:47:59Z", "short_name": "shift-supervisor-trainee-d54714", "model_type": "jobs", "id": 12832005, "locations": [{"name": "San Francisco, CA"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-d54714"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br><b>Job Description:</b><br>This job is responsible for providing resolution of multi-product fraud related client requests by answering calls, chats, or emails in an inbound contact center. Key responsibilities include working in an environment that requires accuracy, using logic, multi-tasking, toggling between systems, and communicating resolutions while delivering a great client experience. Job expectations include providing seamless service delivery to answer client questions, resolving problems, performing account maintenance, and looking for opportunities to deepen relationships through digital solutions.<br><br><b>Responsibilities:</b><br><br><ul><li>Identifies client needs and recommends solutions when fraud has been identified</li><li>Records data captured during client interactions accurately</li><li>Identifies and escalates through appropriate channels for items requiring risk review, exception handling, or further analysis</li><li>Reads frequent updates and learning materials, often while on the call, and implements into conversations with speed and accuracy</li><li>Complies with industry regulations, bank procedures, integrity levels of the department's system and financial controls</li></ul><br><b>Required Qualifications:</b><br><br><ul><li>Displays passion, integrity, commitment and drive to deliver a positive, differentiated service that improves our clients' financial lives.<br>•  Fully understands how life events can impact a client's financial situation and is prepared to actively advise solutions and analyze/resolve complex client problems through creative solutions.<br>•  Has a commitment to excellent attendance with proven reliability and can adhere to the agreed upon work schedule.<br>•  Has a dependable team-player attitude with an understanding that calls must be handled immediately, including weekends and holidays.<br>•  Communicates effectively and confidently with all clients to make their financial lives better.<br>•  Has the ability to engage with clients - begin a conversation, anticipate what questions a client will have, actively share information using plain language, build rapport, and handle objections.<br>•  Is comfortable receiving ongoing performance feedback and coaching.<br>•  Has the ability to learn and adapt to new information and technology platforms.<br>•  Has at least an intermediate level of proficiency with computers and current technology.<br>•  Has 1+ years of customer/client service experience, including experience handling difficult client situations.</li></ul><br><b>Desired Qualifications:</b><br><br><ul><li>1+ years of experience in the banking/financial industry.</li><li>2+ years of experience working in a client service capacity.</li></ul><br><b>Skills:</b><br><br><ul><li>Conflict Management</li><li>Customer and Client Focus</li><li>Decision Making</li><li>Fraud Management</li><li>Oral Communications</li><li>Active Listening</li><li>Attention to Detail</li><li>Data Collection and Entry</li><li>Issue Management</li><li>Problem Solving</li><li>Adaptability</li><li>Collaboration</li><li>Critical Thinking</li><li>Influence</li></ul><br><b>Class Start Date: May 28, 2024</b><br><br><b>Shift:</b><br>2nd shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>", "name": "Fraud Client Service Representative - Retail Banking - Bilingual Spanish - 2nd shift", "type": "external", "publication_date": "2024-03-13T23:27:45Z", "short_name": "fraud-client-service-representative-retail-banking-bilingual-spanish-2nd-shift-8f06c0", "model_type": "jobs", "id": 14374699, "locations": [{"name": "Phoenix, AZ"}], "categories": [{"name": "Data and Analytics"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/bankofamerica/fraud-client-service-representative-retail-banking-bilingual-spanish-2nd-shift-8f06c0"}, "company": {"id": 12145, "short_name": "bankofamerica", "name": "Bank of America"}}, {"contents": "<p><strong>Art der Anstellung: </strong>Befristet; 15-20 Stunden/Woche<br> <br><strong>Deine Extraportion Praxis.</strong><br><br>Wie werden wir uns übermorgen fortbewegen, miteinander kommunizieren, Energien nutzen? Lass uns gemeinsam an den Antworten arbeiten. Wir suchen dafür kluge Köpfe, die Theorie in Praxis umwandeln und clever mitdenken. Kurz: Menschen, die ihre und unsere Fragen in neue Ausrufezeichen verwandeln wollen! Als Werkstudent*in stehen dir bei uns viele Türen offen, um dich einzubringen: Ergreife die Chance und werde Teil unseres weltweiten Netzwerks, knüpfe wichtige Kontakte und lege so den Grundstein für deine berufliche und persönliche Zukunft. Unsere Teams freuen sich auf dich.<br><br><strong>Wir setzen um, worauf es ankommt. Das ist dein Beitrag.</strong><br><br><ul><li>Du unterstützt unser Innovation Excellence Expertenteam bei dem Aufbau und Pflege des Foresight Prozesses</li><li>Auch beim Trend Monitoring verlassen wir uns auf deine tatkräftige Mitarbeit</li><li>Darüber hinaus wirst du bei der Vor- und Nachbereitung von Experteninterviews und -Workshops eingebunden</li><li>Die Unterstützung bei der Vorbereitung von Strategieunterlagen und Zukunftsszenarien stellt ein weiteres spannendes Aufgabenfeld dar</li></ul><br><strong>Was du können solltest. Damit die Welt mehr kann.</strong><br><br><ul><li>Derzeit befindest du dich in einem fortgeschrittenen Bachelor- oder Masterstudium der Fachrichtung Wirtschaftsingenieurwesen o.Ä. und hast idealerweise deinen Schwerpunkt im Bereich Technologie- und Innovationsmanagement gewählt</li><li>Du konntest bereits erste praktische Erfahrungen mit Strategieprojekten (z.B. Portfolioanalyse, Marktsegmentierung, Foresighting) sammeln und bist motiviert, diese bei uns einzubringen und zu vertiefen</li><li>Kenntnisse und praktisches Know-how im Innovationsmanagement stechen in deinem Profil positiv hervor</li><li>An neue Themenfelder und Aufgabengebiete gehst du mit strategischem Denken, Kreativität und Lösungsorientierung heran</li><li>Ausgeprägte Kommunikations- und Teamfähigkeit sowie Planungs- und Organisationsgeschick zählen zu deinen Stärken</li><li>Du arbeitest eigenverantwortlich und strukturiert und punktest mit einer schnellen Auffassungsgabe</li><li>Fließende Deutsch- und Englischkenntnisse runden dein Profil ab</li></ul><br><strong>Wir wollen, dass du willst: Bewirb dich! </strong><br><br><strong>www.siemens.de</strong><br><br>wenn du vor deiner Bewerbung mehr über Siemens erfahren möchtest.<br><br>Du hast Fragen zur Bewerbung? <strong>Hier</strong> findest du Antworten auf häufig gestellte Fragen.<br><br>Wenn du darüber hinaus noch Fragen hast, wende dich gerne an uns: www.siemens.de/fragenzurbewerbung<br> <strong>www.siemens.de/karriere</strong><br> wenn du mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchtest.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens AG<br><br><b>Experience Level:</b> Student (Not Yet Graduated)<br><br><b>Full / Part time:</b> Part-time</p>", "name": "Werkstudent*in (w/m/d) Innovation Excellence mit Fokus auf Strategic Foresight", "type": "external", "publication_date": "2023-05-02T23:41:08Z", "short_name": "werkstudentin-wmd-innovation-excellence-mit-fokus-auf-strategic-foresight-079480", "model_type": "jobs", "id": 10767265, "locations": [{"name": "Nürnberg, Germany"}], "categories": [{"name": "Unknown"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/werkstudentin-wmd-innovation-excellence-mit-fokus-auf-strategic-foresight-079480"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.44 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:15:35Z", "short_name": "pharmacy-technician-7f557c", "model_type": "jobs", "id": 14392984, "locations": [{"name": "Mansfield, CT"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-7f557c"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.44 - $24.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:22:28Z", "short_name": "pharmacy-technician-7f359a", "model_type": "jobs", "id": 14160249, "locations": [{"name": "Plainville, CT"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-7f359a"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Siemens Mobility are currently recruiting for a high calibre Senior Electrical Design Engineer for our Rail Electrification business. The Senior Design Engineer, with a wide range of experience in Low Voltage Railway Designs, will be responsible for the production, development, delivery and innovation of E&amp;P designs on exciting major UK projects.<br><br><strong>Your role and what you'll be doing:</strong><br><br>Based out of our offices in York and working with the Principal Engineer, the Senior Design Engineer will deliver consistent high-quality designs which safely implement rail low voltage distribution solutions to the customer's specifications, agreed timescales and budgets. In addition, the Senior Design Engineer will support the creation of the programmes of work for their respective projects, and will either be able to demonstrate working towards or have undertaken the role of the Contractors Responsible Engineer (CRE) role.<br><br>In the role you will be a main point of contact for our client / customers and shall use excellent communication skills to positively manage and influence their expectations. You will also be required to manage the design and collaborate with other teams, ensuring a coherent design approach whilst taking into account both the clients and Siemen's quality and safety policies.<br><br><strong>What will be my Responsibilities?</strong><br><br><ul><li>Responsible for advising design engineers on their works and supporting them in providing an outstanding service to the construction teams / clients.</li><li>Preparing, checking and delivering design documentation to timescales and authorised budgets.</li><li>Contribute to the development of tenders and offers, and the change management process on designated projects.</li><li>Maintain technical and safety standards in all aspects of design work in order that successful project implementation and future reliability is achieved.</li><li>Ensure that Siemens quality control processes are followed and that designs being presented to clients meet the safety policies, industry standards and best practices of both Siemens and the rail industry.</li><li>Manage inter-disciplinary designs (Civils, Signalling, HV, OLE, Telecoms etc.) for low voltage designs.</li><li>Identify, review and report on project-based risks, ensuring appropriate actions / mitigations are taken.</li><li>Undertake lessons learnt exercises, providing opportunities for innovation and value for money to our clients.</li><li>Maintain and develop own professional knowledge and competence, and that of both experienced and junior Engineers.</li><li>Provide support and guidance to Project Manager and Project Engineers on projects.</li><li>Create programmes, report on the progress of works in relation to timeline and budget and ensure that the development, design, construction and testing requirements are met.</li><li>Have a sound understanding and capability to discharge safety responsibilities in relation to CDM Regulations, Health and Safety legislation and follow Company procedures including development of the project Safety Plan.</li><li>Undertake the role of Contractors' Responsible Engineer on allocated projects as advised.</li><li>Support problem solving and site engineering when required.</li></ul><br><strong>What Skills, Qualifications and Experience do I need for this role?</strong><br><br><strong>Essential:</strong><br><br><ul><li>Demonstratable experience of at least 2 of the following: Signalling Power Supplies / E&amp;P / LV / Building Services designs for the Railway.</li><li>An Engineering Degree or HND/HNC (minimum) in a relevant subject area.</li><li>Member of the IET or other recognised Professional body.</li><li>A good working knowledge of appropriate Railway and associated discipline standards.</li><li>A wide variety of experience in the design and implementation of E&amp;P / LV / building services systems with a proven track record of delivering good quality designs.</li><li>Practical experience of the operational requirements of railway construction works.</li><li>Good knowledge of Project Safety requirements.</li><li>Demonstrable experience of interfacing directly with clients and in representing a company to external parties.</li><li>Understanding of task, time and people management.</li></ul><br><strong>Desirable:</strong><br><br><ul><li>Working towards a Professional Engineering status, Incorporated or Chartered Engineer.</li><li>Holder of Personal Track Safety card.</li><li>Experience of working with programmes such as Amtech / lighting design software / Bentley Microstation</li><li>Previous experience of applications for railway LV DNO supplies</li></ul><br><strong>Benefits include:</strong><br><br><ul><li>26 days holiday, increasing up to 29 days with length of service</li><li>Excellent pension, with Siemens matching contributions up to 10% of pensionable salary</li><li>Performance related bonus scheme</li><li>Flexible benefits to suit your personal needs</li><li>Flexible working policy</li><li>Investment in personal development and support to membership of professional institutions</li></ul><br>We are looking forward to receiving your online application. Please ensure you complete all areas, of the application form, to the best of your ability to help us review your suitability for the role. We will be in contact as soon as possible with an update on your application.<br><br><strong>About us</strong><br><br>We're Siemens. A collection of over 377,000 great minds who are all making the future and you could be one of them. We have offices across the UK, full of hardworking individuals helping us to challenge the today and work towards a brighter tomorrow.<br><br><strong>What else do you need to know?</strong><br><br>Our compensation package includes a competitive salary, holiday allowance, pension and other additional benefits. We celebrate the fact that our employees are individuals and have different wants and needs. With this in mind, we have a flexible benefits scheme where you can tailor your benefits package to suit you.<br><br>If we all thought the same, we would never think of anything new. That's why we recruit great minds from all walks of life. We recognise that building a diverse workforce is essential to the success of our business, therefore we encourage applications from a diverse talent pool. We are proud to announce that we have partnered with VERCIDA, the UK's largest diversity and inclusion focused careers site where all our vacancies are in an accessible format. We welcome the opportunity to discuss flexibility requirements with our applicants to encourage agile working and innovation. #LI-SM1<br><br><b>Organization:</b> Siemens Mobility<br><br><b>Company:</b> Siemens Mobility Limited<br><br><b>Experience Level:</b> not defined<br><br><b>Full / Part time:</b> Full-time</p>", "name": "Senior Design Engineer (Low Voltage)", "type": "external", "publication_date": "2023-05-09T23:40:12Z", "short_name": "senior-design-engineer-low-voltage", "model_type": "jobs", "id": 11320952, "locations": [{"name": "York, United Kingdom"}], "categories": [{"name": "Science and Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/senior-design-engineer-low-voltage"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $16.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Pharmacy Technician", "type": "external", "publication_date": "2024-03-17T12:39:33Z", "short_name": "pharmacy-technician-151f5e", "model_type": "jobs", "id": 13766648, "locations": [{"name": "Beachwood, OH"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-technician-151f5e"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p><strong>Gemeinsam machen wir den Unterschied</strong><br><br><strong>Siemens Mobility</strong> ist ein eigenständig geführtes Unternehmen der Siemens AG und seit über 160 Jahren ein führender Anbieter im Bereich Mobilität. Zu unserem Kerngeschäft gehören Schienenfahrzeuge, Bahnautomatisierungs- und Elektrifizierungslösungen, schlüsselfertige Systeme sowie die dazugehörigen Serviceleistungen. Wir waren schon immer sehr innovativ, um Reisen schneller, sicherer und komfortabler zu machen. Heute brauchen wir neue Lösungen für neue Herausforderungen wie den Klimawandel und weltweit steigende Bevölkerungszahlen. Das ist es, was uns antreibt. Deshalb gestalten wir Mobilität mit Leidenschaft und sind immer einen Schritt voraus. Durch Digitalisierung machen wir Infrastrukturen intelligent und schaffen Möglichkeiten, die uns nachhaltig und nahtlos von A nach B bringen. Unsere 38.200 Mitarbeiter sind Pioniere im Mobilitätswesen, die dabei helfen, die Welt in Bewegung zu halten.#ServiceBahn<br><br><strong>Ihr neues Aufgabenfeld - herausfordernd und zukunftsorientiert</strong><br><br><ul><li>Sie helfen die Verfügbarkeit von Bahnanlagen sicher zu stellen, indem Sie Fahrleitungs- und Stromversorgungslangen montieren, warten und instand halten.</li><li>Nach einer umfassenden Einarbeitung führen Sie Montagearbeiten durch und stellen die Betriebsbereitschaft der montierten Anlagen sicher.</li><li>Ferner wirken sie an notwendigen Service- und Instandhaltungsarbeiten mit.</li><li>Sie erstellen die Leistungsberichte und kontrollieren die technischen Dokumentationen.</li><li>Je nach Bedarf werden Sie deutschlandweit in Projekten eingesetzt.</li></ul><br><strong>Ihre Qualifikationen - fundiert und adäquat</strong><br><br><ul><li>Sie haben eine Ausbildung zum Elektriker, Mechatroniker, Elektroniker, Schlosser, Freileitungsmonteur oder Fahrleitungsmonteur abgeschlossen.</li><li>Idealerweise bringen Sie bereits mehrjährige Erfahrungen in als Elektromonteur im Bahn- oder Industrieumfeld mit.</li><li>Erfahrungen im Bereich der Mittelspannung und im 15kV- Fahrleitungsbereich sind von Vorteil.</li><li>Idealerweise besitzen Sie einen Triebfahrzeugführerschein der Klasse 2 oder 3 für schwere Nebenfahrzeuge.</li><li>Zudem bringen Sie gute Deutschkenntnisse in Wort und Schrift</li></ul><br><strong>So treten Sie mit uns in Kontakt - einfach und direkt</strong><br><br><strong>www.siemens.de/mobility</strong><br>wenn Sie vor Ihrer Bewerbung mehr über Siemens erfahren möchten.<br><strong>+49 (9131) 17 52430</strong><br>wenn Sie erste Fragen gern persönlich mit unserem Recruiting Team klären möchten. Ansprechpartner für diese Stellenausschreibung ist Herr Martin Spandel.<br><strong>www.siemens.de/karriere</strong><br>wenn Sie mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchten.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br><b>Organisation:</b> Siemens Mobility<br><br><b>Unternehmen:</b> Siemens Mobility GmbH<br><br><b>Erfahrungsniveau:</b> Mid-level Professional<br><br><b>Voll-/Teilzeit:</b> Vollzeit</p>", "name": "Freileitungsmonteur (w/m/d) Fahrleitungs- und Stromversorgungsanlagen", "type": "external", "publication_date": "2023-01-24T00:42:10Z", "short_name": "freileitungsmonteur-wmd-fahrleitungs-und-stromversorgungsanlagen-c64550", "model_type": "jobs", "id": 10536487, "locations": [{"name": "Bad Mergentheim, Germany"}], "categories": [{"name": "Computer and IT"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/freileitungsmonteur-wmd-fahrleitungs-und-stromversorgungsanlagen-c64550"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p><strong>Mechanical Assembler</strong><br><br>Siemens is a global technology powerhouse that has stood for engineering excellence, innovation, quality, reliability, and internationality for more than 165 years. Siemens Smart Infrastructure is seeking an Mechanical Assembler for our Electrification and Automation (EA) Business Unit working with the Low Voltage Motor Control Center product.<br><br>As a Mechanical Assembler you will be responsible for the building, assembling, and wiring of Medium and Low Voltage Electrical Distribution Equipment, such as LV Motor Control Centers, MV breakers, MV switchgear and Motor Control Centers, DC Electrical Vehicle Chargers and Solar Inverters.<br><br><strong>Responsibilities</strong>:<br><br><ul><li>Assembly and wire LV MCC breakers, structures, sub-assemblies, parts kits, and aftermarket parts orders</li><li>Perform Sub assembly work including mechanical assembly of steel and components, control wiring, power cable work, and interconnection of control wires</li><li>Record appropriate job record transactions</li><li>Read BOM, follow layouts &amp; assembly drawings,</li><li>Perform some basic wiring per given instructions when requested</li><li>Set and correct use of Torque wrenches</li><li>Adhere to developed processes, methods and/or seek ways to improve</li><li>Must adhere to all safety rules and keep safety first for self and others</li><li>Perform miscellaneous other duties as assigned by Supervisor or Management</li></ul><br><strong>Requirements: knowledge/skills, education, and experience:</strong><br><br><ul><li>High School Diploma or GED</li><li>1+ years of experience performing mechanical assembly or experience in the mechanical field</li><li>1+ years' experience wiring in commercial or industrial applications</li><li>Must be able to lift parts or sub-assemblies that weigh up to 50 lbs. occasionally</li><li>Communicate in English (read, write &amp; speak fluently)</li><li>Must be able to Identify mechanical parts and electrical components</li><li>Experience with using a tape measure and other measuring devices</li><li>Must have extensive experience working with standard hand and power tools, both pneumatic and battery operated, 1 to 3 years</li><li>Must have knowledge of torque wrench and applied torque values</li><li>Must have a proven record in Quality and Productivity</li><li>Must be a strong team player</li><li>Conform with Environmental and Occupational Health and Safety policy and Management System and strive to continual improve the intended outcomes of the Management System.</li></ul><br><strong>Preferred </strong><strong>knowledge/skills, education, and experience</strong><br><br><ul><li>Forklift driver experience</li><li>SAP experience</li><li>Associates Degree or technical training in area of responsibility.</li></ul><br><strong>Benefits:</strong><br><br>In addition to the growth and development opportunities we continue to foster, we offer included benefits of PTO, a matching 401K plan, stock share match, health, life, vision and dental benefits, paid parental leave, and so much more.<br><br><strong>About Smart Infrastructure - Electrification &amp; Automation:</strong><br><br>The Electrification and Automation (EA) Business Unit offers the full range of energy distribution systems and solutions for all markets and through all sales channels. We provide reliable power distribution grids of today while investing into our Future Grids portfolio and applications to create the power distribution grid of the future. Our comprehensive portfolio meets the growing technical requirements of todays and tomorrow's power grid!<br><br>At Siemens, we live and foster an ownership culture, in which every employee takes personal responsibility for professional growth &amp; development and our company's success. We strive to transform the everyday for our customers, employees, and society by:<br><br><ul><li>Trusting and empowering our leaders to act as owners, directing their teams, and innovating to succeed.</li><li>Communicating openly and honestly to learn from our failures and celebrate our successes.</li><li>Recognizing individual and team achievements frequently</li><li>Our focus on investment in our team members, offering a wide variety of internal and external development opportunities.</li><li>Our commitment to diversity, equity, and inclusion</li></ul><br>Can <strong>you</strong> see yourself, learning, growing, and succeeding here? If so, we'd like to meet you! Apply today and learn how you can be a part of the Siemens family.<br><br>Qualified Applicants must be legally authorized for employment in the United States. Qualified Applicants will not require employer sponsored work authorization now or in the future for employment in the United States.<br><br>#LI-BJ1<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Early Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>", "name": "Mechanical Assembler - 1st Shift", "type": "external", "publication_date": "2023-04-26T23:41:35Z", "short_name": "mechanical-assembler-1st-shift-0a7d96", "model_type": "jobs", "id": 11259124, "locations": [{"name": "Clayton, NC"}], "categories": [{"name": "Software Engineering"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/siemens/mechanical-assembler-1st-shift-0a7d96"}, "company": {"id": 11913, "short_name": "siemens", "name": "Siemens"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>The Shift Supervisor Trainee role is an entry-level, short-term role that prepares an employee to perform a higher-level supervisory role, such as Operations Supervisor or Shift Supervisor. The Shift Supervisor Trainee performs work as directed in order to prepare for future supervisory responsibilities, completes basic operations and management skills training, and also learns about key aspects of the business (e.g., building customer loyalty through exceptional service) and CVS/pharmacy culture.<br><br>Upon successful completion of the training program, Shift Supervisor Trainees are eligible to be considered for promotion to open Operations Supervisor or Shift Supervisor positions. These key leadership roles support the CVS Store Management team in driving store execution and performance while building consumer loyalty to CVS/pharmacy through a focus on excellent customer service. When there is no manager onsite, the Operations Supervisor or Shift Supervisor leads the store staff, ensures that store operations run smoothly, and is responsible for ensuring the completion of all opening and closing procedures.<br><br>Essential Functions:<br>1. Management<ul><li>Work effectively with store management and store crews</li><li>Supervise the store's crew through assigning, directing and following up of all activities</li><li>Effectively communicate information both to and from store management and crews<br>2. Customer Service</li><li>Assist customers with their questions, problems and complaints</li><li>Promote CVS customer service culture. (Greet, offer help, and thank)</li><li>Handle all customer relations issues in accordance with company policy and promote a positive shopping experience for all CVS customers</li><li>Maintain customer/patient confidentiality</li><li></li><li><b>Required Qualifications</b><br>Deductive reasoning ability, analytical skills and computer skills. Advanced communication skills. Ability to work a flexible schedule, including some early morning, overnight and weekend shifts, to work overtime as needed.<br><br><b>Preferred Qualifications</b><ul><li>Experience in retail</li></ul><b>Education</b><br>High School diploma or equivalent preferred but not required.</li></ul><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $18.50<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "Shift Supervisor Trainee", "type": "external", "publication_date": "2024-03-17T12:47:58Z", "short_name": "shift-supervisor-trainee-d493f4", "model_type": "jobs", "id": 12835925, "locations": [{"name": "Huntsville, AL"}], "categories": [{"name": "Human Resources and Recruitment"}], "levels": [{"name": "Mid Level", "short_name": "mid"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/shift-supervisor-trainee-d493f4"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}, {"contents": "<p>Bring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand - with heart at its center - our purpose sends a personal message that how we deliver our services is just as important as what we deliver.<br> <br>Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.<br><br><b>Position Summary</b><br><br>Health is everything. At CVS Health, we are committed to increasing patient access to care, lowering costs and improving the quality of care. Millions of times a day, we're helping people on their path to better health- from advising patients on their prescriptions to helping them manage their chronic and specialty conditions. Because we're present in so many moments, big and small, we have an active, supportive role in shaping the future of health care. Pharmacy Technicians are at the forefront of our purpose as they deliver compassionate care to our millions of patients every day.<br><br>Come join our team of dedicated and caring Pharmacy Technicians who demonstrate our core values of Accountability, Caring, Collaboration,Innovation and Integrity in everything they do in our pharmacies every day. Whether you are new to working in pharmacies or are an experienced Pharmacy Technician, we have a place for you on our team to use your skills and talents to serve and care for our patients and customers.<br><br>The Pharmacy Technician position provides individuals with an opportunity to work in a leading retail pharmacy company and in a role that positively impacts the lives and health of others. You will work in an environment where the highest professional and ethical standards are maintained as well as full compliance with all Federal, State and Local laws and regulations. Pharmacy Technicians take important steps to ensure all medication needs and regulatory compliance standards are met for our patients and they demonstrate ethical conduct and maintain patient confidentiality at all times.<br><br>Success for incumbents in this role includes being able to manage all assigned pharmacy workstations and tasks to support the team's ability to promptly, safely and accurately fill patient prescriptions all while providing caring service that exceeds customer expectations. If you like working in fast-paced environments and demonstrating compassionate, genuine care for patients and customers, this job is for you!<br><br>As a new Pharmacy Technician, you are required to complete an extensive CVS Pharmacy Technician Training Program as well as satisfy all registration, licensing and certification requirements according to your State's Board of Pharmacy guidelines. Your Pharmacy Technician duties will be restricted by your manager at first until you complete all necessary requirements. Once you satisfy all requirements and expand your Pharmacy Technician duties, you have the opportunity to continue to build your clinical, technical and insurance knowledge and expertise by leveraging available tools and training to build your pharmacy career.<br><br>Are you ready to help people on their path to better health? We are ready to have you join our team and help you on your career path to achieve your goals!<br><br>Please note in select markets the collective bargaining agreement rules regarding the Pharmacy Technician would apply.<br><br>DISCLAIMER:<br><br>The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.<br><br>Based on the role and location, this position may require you to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless you are approved for a reasonable accommodation based on disability, medical condition, pregnancy, or religious belief that prevents them from being vaccinated. Proof of vaccination will be required on your first day of employment or within the first few months in the position, depending on the role and location. If you are considered for a role, more information will be provided during the hiring process.<br><br><b>Required Qualifications</b><ul><li>Must be at least 16 years of age</li><li>Licensure requirements vary by state</li><li>Attention and Focus<br>o The ability to concentrate on a task over a period of time without being distracted</li><li>Customer Service Orientation<br>o Actively look for ways to help people, and do so in a friendly manner<br>o Notice and understand customers' reactions, and respond appropriately</li><li>Communication Skills<br>o Use and understand verbal and written communication to interact with customers and colleagues<br>o Actively listening by giving full attention to what others are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times</li><li>Mathematical Reasoning<br>o The ability to use math to solve a problem, such as calculating day's supply of a prescription</li><li>Problem Resolution<br>o Is able to judge when something is wrong or is likely to go wrong; recognizing there is a problem<br>o Choosing the best course of action when faced with a complex situation with several available options<br><br>PHYSICAL DEMANDS:</li><li>Remaining upright on the feet, particularly for sustained periods of time</li><li>Moving about on foot to accomplish tasks, particularly for moving from one work area to another</li><li>Picking, pinching, typing or otherwise working primarily with fingers rather than whole hand or arm</li><li>Extending hand(s) and arm(s) in any direction</li><li>Bending body downward and forward by bending spine at the waist</li><li>Stooping to a considerable degree and requiring full use of the lower extremities and back muscles</li><li>Expressing or exchanging ideas by means of spoken word; those activities where detailed or important spoken instructions must be conveyed accurately</li><li>Perceiving the nature of sounds at normal speaking levels with or without correction, and having the ability to receive detailed information through oral communication</li><li>Visual Acuity:<br>o The worker is required to have close visual acuity to perform activities such as: transcribing, viewing a computer terminal, reading, visual inspection involving small parts</li><li>Occasional lifting of up to 30 lbs; exerting up to 30 lbs of force occasionally and/or up to 10 lbs of force frequently, and/or a negligible amount of force constantly to move objects</li></ul><b>Preferred Qualifications</b><ul><li>Previous experience in a pharmacy, retail, medical, or customer service setting</li><li>Previous experience as a Pharmacy Technician</li><li>PTCB National Certification</li></ul><b>Education</b><br><br>High School diploma or equivalent preferred but not required.<br><br><b>Pay Range</b><br><br>The typical pay range for this role is:<br><br>$16.00 - $21.00<br><br>This pay range represents the base hourly rate or base annual full-time salary for all positions in the job grade within which this position falls.  The actual base salary offer will depend on a variety of factors including experience, education, geography and other relevant factors.  <br> <br>In addition to your compensation, enjoy the rewards of an organization that puts our heart into caring for our colleagues and our communities.  The Company offers a full range of medical, dental, and vision benefits.  Eligible employees may enroll in the Company's 401(k) retirement savings plan, and an Employee Stock Purchase Plan is also available for eligible employees.  The Company provides a fully-paid term life insurance plan to eligible employees, and short-term and long term disability benefits. CVS Health also offers numerous well-being programs, education assistance, free development courses, a CVS store discount, and discount programs with participating partners.  As for time off, Company employees enjoy Paid Time Off (\"PTO\") or vacation pay, as well as paid holidays throughout the calendar year. Number of paid holidays, sick time and other time off are provided consistent with relevant state law and Company policies.  <br> <br>For more detailed information on available benefits, please visit jobs.CVSHealth.com/benefits<br><br>We anticipate the application window for this opening will close on: 04/30/2024<br><br>CVS Health requires certain colleagues to be fully vaccinated against COVID-19 (including any booster shots if required), where allowable under the law, unless they are approved for a reasonable accommodation based on disability, medical condition, religious belief, or other legally recognized reasons that prevents them from being vaccinated.<br><br>You are required to have received at least one COVID-19 shot prior to your first day of employment and to provide proof of your vaccination status or apply for a reasonable accommodation within the first 10 days of your employment. Please note that in some states and roles, you may be required to provide proof of full vaccination or an approved reasonable accommodation before you can begin to actively work.<br><br>CVS Health is committed to recruiting, hiring, developing, advancing, and retaining individuals with disabilities. As such, we strive to provide equal access to the benefits and privileges of employment, including the provision of a reasonable accommodation to perform essential job functions. CVS Health can provide a request for a reasonable accommodation, including a qualified interpreter, written information in other formats, translation or other services through ColleagueRelations@CVSHealth.com If you have a speech or hearing disability, please call 7-1-1 to utilize Telecommunications Relay Services (TRS). We will make every effort to respond to your request within 48 business hours and do everything we can to work towards a solution.</p>", "name": "pharmacy tech", "type": "external", "publication_date": "2024-03-17T12:15:36Z", "short_name": "pharmacy-tech-e5baa4", "model_type": "jobs", "id": 14370568, "locations": [{"name": "Wells, ME"}], "categories": [{"name": "Healthcare"}], "levels": [{"name": "Senior Level", "short_name": "senior"}], "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cvshealth/pharmacy-tech-e5baa4"}, "company": {"id": 12096, "short_name": "cvshealth", "name": "CVS Health"}}], "aggregations": {}}